{
    "title": "The Aztecs",
    "air_date": "6 May 1964",
    "num_episodes": 4,
    "episode_titles": [
        "1: The Temple of Evil",
        "2: The Warriors of Death",
        "3: The Bride of Sacrifice",
        "4: The Day of Darkness"
    ],
    "episode_duration": 25,
    "writers": [
        "John Lucarotti"
    ],
    "directors": [
        "John Crockett"
    ],
    "media_format": "B_W",
    "dialogue_triumphs": [
        "'How shall a man know his gods?' 'By the signs of their divinity.' 'And what if thieves walk among the gods?' 'Then, indeed, how shall a man know?'"
    ],
    "dialogue_disasters": null,
    "goofs": [
        "William Hartnell and William Russell stumble their way through a scene in episode one.",
        "The obvious use of doubles for William Russell and Ian Cullen in the fight sequence in episode four.",
        "The Aztecs wear more clothes than would be comfortable in the heat of Mexico."
    ],
    "continuity_notes": [
        {
            "name": "Barbara",
            "type": "Character",
            "description": "One of the Doctor's companions, knowledgeable about Aztec history",
            "origin": null,
            "current_status": "Using her expertise in Aztec history during their adventure"
        },
        {
            "name": "The Doctor",
            "type": "Character",
            "description": "The protagonist of the series, a Time Lord from Gallifrey",
            "origin": "Gallifrey",
            "current_status": "Describes himself as 'a scientist, an engineer, a builder of things'"
        },
        {
            "name": "Ian",
            "type": "Character",
            "description": "One of the Doctor's companions",
            "origin": "Earth",
            "current_status": "Revealed to have trained as a fighter, possibly during National Service"
        }
    ],
    "technobabble": null,
    "roots": [
        "Richard III (John Ringham's performance)",
        "Kipling's The Man Who Would Be King",
        "The Royal Hunt of the Sun",
        "Herodotus (the story of the grave-robber architect who built himself a secret entrance)"
    ],
    "links": null,
    "locations": [
        {
            "name": "Mexico",
            "type": "Location",
            "description": "The setting of the story, during the Aztec civilization",
            "origin": "Earth",
            "current_status": "Between 1430 and 1520, likely around 1450 during the reign of Montezuma I"
        }
    ],
    "future_history": null,
    "untold_adventures": null,
    "qv": [
        "The Doctor's Doctorate, 'The Moonbase'"
    ],
    "additional_notes": "The Doctor removes a wheel he made to aid their escape, demonstrating his reluctance to change history.",
    "bottom_line": "'You can't rewrite history. Not one line!' Doctor Who often works best when it is pretending to be something other than a family SF show, and 'The Aztecs' – which wants desperately to be a Shakespearian historical tragedy – works on this principle. A lyrical piece of BBC costume drama and a gem to cherish."
}