{
    "title": "The Reign of Terror",
    "air_date": "8 August 1964",
    "num_episodes": 6,
    "episode_titles": [
        "A Land of Fear",
        "Guests of Madame Guillotine",
        "A Change of Identity",
        "The Tyrant of France",
        "A Bargain of Necessity",
        "Prisoners of Conciergerie"
    ],
    "episode_duration": 25,
    "writers": [
        "Dennis Spooner"
    ],
    "directors": [
        "Henric Hirsch",
        "John Gorrie (uncredited)"
    ],
    "media_format": "B_W",
    "dialogue_triumphs": [
        "Our lives are important – at least to us – and as we see, so we learn… Our destiny is in the stars, so let's go and search for it…"
    ],
    "dialogue_disasters": null,
    "goofs": [
        "The hum of the control room can be heard in the forest before the TARDIS appears.",
        "When the TARDIS finally materializes, it does so silently, and the flashing light shines through the windows.",
        "The clothes found in a box in the farmhouse fit the travellers perfectly.",
        "The dying Webster tells Ian of 'Le Chien Gris' and Jules Renan, but he remembers him talking of 'The Sinking Ship' and Barrass.",
        "Renan has made a rule that the escape line works on first name only terms, yet he knows two of the people on it as Rouvray and D'Argenson.",
        "The involvement of Robespierre (who never controlled the Terror) and Napoleon in this story is historically inaccurate."
    ],
    "continuity_notes": [
        {
            "name": "TARDIS",
            "type": "Object",
            "description": "The Doctor's time machine and spacecraft",
            "origin": "Gallifrey",
            "current_status": "The Doctor admits to only two 'minor' faults: the failure of the chameleon circuit and the Fast Return switch jamming."
        },
        {
            "name": "The Doctor",
            "type": "Character",
            "description": "The protagonist and titular character of the series",
            "origin": "Gallifrey",
            "current_status": "Reveals that the French Revolution is his favorite period of Earth history. Has no money and barters with his ring."
        },
        {
            "name": "Barbara",
            "type": "Character",
            "description": "One of the Doctor's companions",
            "origin": "Earth",
            "current_status": "Mentions having taken a holiday in Somerset. States she's 'learnt her lesson' about interfering with history after 'The Aztecs'."
        },
        {
            "name": "Susan",
            "type": "Character",
            "description": "The Doctor's granddaughter and companion",
            "origin": "Gallifrey",
            "current_status": "Revealed to be terrified of rats."
        }
    ],
    "technobabble": null,
    "roots": [
        "A Tale of Two Cities",
        "The Scarlet Pimpernel"
    ],
    "links": [
        "Reference is made to the Doctor's previous attempt to take Ian and Barbara home ('Marco Polo').",
        "The cell reminds Barbara of their imprisonment in 'An Unearthly Child'",
        "Barbara mentions learning her lesson about interfering with history after 'The Aztecs'"
    ],
    "locations": [
        {
            "name": "Paris and environs",
            "type": "Location",
            "description": "The capital city of France and its surrounding areas",
            "origin": "Earth",
            "current_status": "Setting of the story in July 1794, during the French Revolution"
        }
    ],
    "future_history": null,
    "untold_adventures": null,
    "qv": [
        "Language, 'The Masque of Mandragora'",
        "The TARDIS Scanner, 'Full Circle'"
    ],
    "additional_notes": "Ian's comment on Barbara's hair: 'Hairstyle's a bit modern, but it's alright.' This story ends the season with the Doctor's speech over a background of stars.",
    "bottom_line": "As you would expect of Dennis Spooner, there are jokey characters (the jailer and the overseer who calls the Doctor 'skinny') and good dialogue. What is more surprising is the uncompromising nature of the story, in keeping with the historical period presented: the peasant-soldiers are vicious, the cells are dingy, and Robespierre is shot in the jaw off-screen."
}