{
    "title": "The Dalek Invasion of Earth",
    "air_date": "21 November 1964",
    "num_episodes": 6,
    "episode_titles": [
        "1: World's End",
        "2: The Daleks",
        "3: Day of Reckoning",
        "4: The End of Tomorrow",
        "5: The Waking Ally",
        "6: Flashpoint"
    ],
    "episode_duration": 25,
    "writers": [
        "Terry Nation"
    ],
    "directors": [
        "Richard Martin"
    ],
    "media_format": "B_W",
    "dialogue_triumphs": [
        "One day I shall come back… Just go forward in all your beliefs, and prove to me that I am not mistaken in mine."
    ],
    "dialogue_disasters": [
        "What you need is a jolly good smacked bottom!",
        "I think we'd better pit our wits against them and defeat them!",
        "Resistance is useless!",
        "We… are the masters of Earth!",
        "Are you one of these Brotherhood of Man kind of people?"
    ],
    "goofs": [
        "The Dalek saucer in episode one: belief has never been so suspended.",
        "The saucer commander changes colour scheme between episodes.",
        "A Dalek is inexplicably in the river.",
        "In episode two, outside the Dalek saucer, two studio technicians are visible.",
        "Jenny and Barbara have to hold their neck manacles in place.",
        "Cars go by when the Daleks are in Trafalgar Square.",
        "There are still pleasure cruisers on the Thames after 10 years of alien occupation.",
        "In episode six a Dalek comes through a door with its eyestalk looking straight at the ambushing rebels, and quickly turns away.",
        "The Black Dalek, before addressing the humans, clears its throat.",
        "Twice boom-mike shadows are visible (episodes three and six).",
        "In episode six, as the Doctor unlocks the TARDIS, a faint Dalek voice can be heard screeching."
    ],
    "continuity_notes": [
        {
            "name": "Daleks",
            "type": "Character",
            "description": "Alien race capable of moving underwater, telling time in hours, and writing maps in English. They communicate by radio, pointing their eye stalks at the ceiling when doing so. Led by a Supreme Controller in black livery, with Black Daleks below it.",
            "origin": "Skaro",
            "current_status": "Invading Earth"
        },
        {
            "name": "Dalekanium",
            "type": "Object",
            "description": "The name given by Dortmun to the Dalek's outer casing material.",
            "origin": null,
            "current_status": "Used in Dalek construction"
        },
        {
            "name": "TARDIS",
            "type": "Object",
            "description": "The Doctor's time and space machine, with instruments capable of measuring oxygen and air pressure.",
            "origin": "Gallifrey",
            "current_status": "Functional"
        },
        {
            "name": "Barbara",
            "type": "Character",
            "description": "Companion of the Doctor, formerly lived in Bedfordshire and can drive a lorry and cook.",
            "origin": "Earth",
            "current_status": "Traveling with the Doctor"
        },
        {
            "name": "Susan",
            "type": "Character",
            "description": "The Doctor's granddaughter, who can cook and feels she has never belonged to any time or place.",
            "origin": "Gallifrey",
            "current_status": "Considering staying on Earth with David"
        },
        {
            "name": "The Doctor",
            "type": "Character",
            "description": "Time Lord who avoids taking life unless immediately threatened. Willing to let Susan stay on Earth.",
            "origin": "Gallifrey",
            "current_status": "Traveling in the TARDIS"
        }
    ],
    "technobabble": [
        "Earth has something 'that no other planet has': a magnetic core.",
        "Removing the core will get rid of gravity, upsetting 'the entire constellation'."
    ],
    "roots": [
        "War of the Worlds",
        "Things to Come",
        "resistance movies"
    ],
    "links": [
        "The First Dalek History, 'The Daleks'",
        "The TARDIS Scanner, 'Full Circle'"
    ],
    "locations": [
        {
            "name": "London",
            "type": "Location",
            "description": "Capital city of England, invaded by Daleks",
            "origin": "Earth",
            "current_status": "Under Dalek occupation"
        },
        {
            "name": "Bedfordshire",
            "type": "Location",
            "description": "County in England where Daleks locate their mine",
            "origin": "Earth",
            "current_status": "Site of Dalek mining operation"
        }
    ],
    "future_history": "By 2164, Earth had several moon stations. London had moving pavements and an 'astronaut fair'. Police boxes are still in use.",
    "untold_adventures": null,
    "qv": [
        "The First Dalek History, 'The Daleks'",
        "The TARDIS Scanner, 'Full Circle'"
    ],
    "additional_notes": "The episode title 'The Waking Ally' is questioned as it doesn't seem to fit the story. The Dalek mine location in Bedfordshire is criticized as an illogical choice. The Daleks' intelligence tests for Robomen conversion are questioned.",
    "bottom_line": "There are some wonderful exterior sequences, with giddy scenes of Daleks on Westminster Bridge and in Trafalgar Square. The only thing that lets down the vast production values is the Slyther. Daleks refer to the destruction of humans as 'the final solution'. Obvious Dan Dare stuff, but done with such hallucinatory conviction that the end result is very impressive."
}