{
    "title": "The Web Planet",
    "air_date": "13 February 1965",
    "num_episodes": 6,
    "episode_titles": [
        "The Web Planet",
        "The Zarbi",
        "Escape to Danger",
        "Crater of Needles",
        "Invasion",
        "The Centre"
    ],
    "episode_duration": 25,
    "writers": [
        "Bill Strutton"
    ],
    "directors": [
        "Richard Martin"
    ],
    "media_format": "B_W",
    "dialogue_triumphs": [
        "Hetra describes digging in one of Doctor Who's few attempts to show alien thought patterns: 'A silent wall. We must make mouths in it with our weapons, then it will speak more light.'"
    ],
    "dialogue_disasters": [
        "Doctor to Ian: 'Whatever power has taken hold of the TARDIS has taken your pen.'",
        "Asking the Animus to lower its communication helmet: 'Drop this hairdryer, or whatever it is.'"
    ],
    "goofs": [
        "Ian Thompson's decision to play Hetra with a stilted French bandit accent is interesting. 'Zarbiiiiiii!'",
        "A Zarbi hits a camera with an audible thump in episode three, and a Zarbi abdomen clangs on the studio floor.",
        "One of the imprisoned Menoptra, judging by its gestures, is merrily chatting to a Zarbi guard.",
        "The Zarbi are scared of tiny dead spiders.",
        "In episode two, when Hroonda is killed, his wings fall off.",
        "For five seconds in episode two, nothing appears to be happening in 'Web HQ'.",
        "In episode four, as Ian is buried in the rock fall, someone can be heard laughing.",
        "Shadows are cast on the sky through much of the story.",
        "Barbara gives Vicki an aspirin when she asks for a sedative."
    ],
    "continuity_notes": [
        {
            "name": "The Doctor",
            "type": "Character",
            "description": "The main protagonist of the series, a Time Lord who travels through time and space.",
            "origin": "Gallifrey",
            "current_status": "Exploring Vortis and confronting the Animus"
        },
        {
            "name": "The Doctor's Ring",
            "type": "Object",
            "description": "A ring with special properties, linked to the TARDIS and capable of various functions.",
            "origin": null,
            "current_status": "Used to open TARDIS doors and control Zarbi when connected to TARDIS systems"
        },
        {
            "name": "Vicki",
            "type": "Character",
            "description": "A companion of the Doctor with acute hearing and advanced education for her age.",
            "origin": null,
            "current_status": "Traveling with the Doctor and exploring Vortis"
        },
        {
            "name": "Ian Chesterton",
            "type": "Character",
            "description": "A companion of the Doctor and former teacher at Coal Hill School.",
            "origin": "Earth",
            "current_status": "Exploring Vortis and helping confront the Animus"
        },
        {
            "name": "TARDIS",
            "type": "Object",
            "description": "The Doctor's time and space machine, capable of various functions beyond transportation.",
            "origin": "Gallifrey",
            "current_status": "Under influence of the Animus, with some systems compromised"
        },
        {
            "name": "Menoptra",
            "type": "Character",
            "description": "Butterfly-like inhabitants of Vortis, formerly worshipped at temples of light.",
            "origin": "Vortis",
            "current_status": "Fighting against the Animus"
        },
        {
            "name": "Zarbi",
            "type": "Character",
            "description": "Ant-like creatures of Vortis, formerly used as cattle by the Menoptra.",
            "origin": "Vortis",
            "current_status": "Under control of the Animus"
        },
        {
            "name": "Animus",
            "type": "Character",
            "description": "A parasitic entity that absorbs energy and seeks to invade Earth.",
            "origin": "Unknown",
            "current_status": "Controlling Vortis and attempting to expand its influence"
        }
    ],
    "technobabble": [
        "Atmospheric Density Jackets",
        "The TARDIS can be remotely controlled by mental power"
    ],
    "roots": [
        "Freudian terms",
        "50s giant insect movies",
        "Capek's The Insect Play",
        "D-Day (the Menoptra invasion plans)",
        "White's The Sword in the Stone",
        "The Lord of the Rings",
        "The Outer Limits episode 'The Zanti Misfits'"
    ],
    "links": [
        "Barbara wears the gold bracelet that Nero gave her ('The Romans')."
    ],
    "locations": [
        {
            "name": "Vortis",
            "type": "Location",
            "description": "A planet in the Isop galaxy, home to the Menoptra and Zarbi, now under the influence of the Animus.",
            "origin": "Isop galaxy",
            "current_status": "Controlled by the Animus, orbited by Pictos"
        }
    ],
    "future_history": "The story is set in the far future, as the Animus plans to 'take from man his mastery of space'.",
    "untold_adventures": null,
    "qv": [
        "The TARDIS Lock, 'The Sensorites'",
        "Language, 'The Masque of Mandragora'",
        "The TARDIS Scanner, 'Full Circle'"
    ],
    "additional_notes": "Ian uses his tie as a belt. The story features ambitious attempts to portray alien environments and thought patterns.",
    "bottom_line": "Imaginative, ambitious, and, by modern standards, slow and silly-looking. It's hard to judge a story that, at the time, was astonishing but has aged so badly. Effects age faster than anything else, so basing a story on them is risky. The insect gestures, odd speech patterns and use of camera filters are all sincere attempts to suggest the alien, applaudable in a series where aliens are usually Nazis with make-up. You've got to appreciate lofty ambitions."
}