{
    "title": "The Massacre",
    "air_date": "5 February 1966",
    "num_episodes": 4,
    "episode_titles": [
        "The War of God",
        "The Sea Beggar",
        "Priest of Death",
        "Bell of Doom"
    ],
    "episode_duration": 25,
    "writers": [
        "John Lucarotti",
        "Donald Tosh"
    ],
    "directors": [
        "Paddy Russell"
    ],
    "media_format": "B_W",
    "dialogue_triumphs": [
        "This city shall weep tears of blood.",
        "And now they've all gone… None of them could understand, not even my little Susan, or Vicki. And as for Barbara, and Chatterton… Chesterton… they were all too impatient to get back to their own time. Perhaps, I should go home, back to my own planet. But I can't…"
    ],
    "dialogue_disasters": null,
    "goofs": [
        "If Dodo is related to Anne Chaplet, why is her name still Chaplet?",
        "Anne's Cornish accent is an odd way to communicate working-class French."
    ],
    "continuity_notes": [
        {
            "name": "Dodo Chaplet",
            "type": "Character",
            "description": "Full name Dorothea Chaplet, has no living parents and is looked after by an uncaring great aunt. Has a French grandad.",
            "origin": null,
            "current_status": "Newly introduced companion"
        },
        {
            "name": "Steven Taylor",
            "type": "Character",
            "description": "English and Protestant companion of the Doctor",
            "origin": null,
            "current_status": "Temporarily leaves the TARDIS due to disgust with the Doctor's actions"
        },
        {
            "name": "The Doctor",
            "type": "Character",
            "description": "Time Lord protagonist, knowledgeable about history and scientific advancements",
            "origin": "Gallifrey",
            "current_status": "Reflects on past companions and considers returning home"
        },
        {
            "name": "Anne Chaplet",
            "type": "Character",
            "description": "16th century French woman, possibly an ancestor of Dodo Chaplet",
            "origin": "Paris, 16th century",
            "current_status": "Abandoned by the Doctor, likely killed in the massacre"
        }
    ],
    "technobabble": null,
    "roots": [],
    "links": [
        "Steven mentions being in Egypt (reference to 'The Daleks' Master Plan')"
    ],
    "locations": [
        {
            "name": "Paris",
            "type": "Location",
            "description": "Capital city of France, site of the St. Bartholomew's Day massacre",
            "origin": "Earth",
            "current_status": "Experiencing religious tensions and violence"
        },
        {
            "name": "Wimbledon Common",
            "type": "Location",
            "description": "Area in London where the TARDIS lands in the 1960s",
            "origin": "Earth",
            "current_status": null
        }
    ],
    "future_history": null,
    "untold_adventures": null,
    "qv": null,
    "additional_notes": "The Doctor's abandonment of Anne seems almost a reaction to the loss of Katarina, as if he's been taught a lesson about interfering. Hartnell's performance as the Abbot is noted as solid and sinister, showing a different side to his acting abilities.",
    "bottom_line": "Not only the best historical, but the best Hartnell, and, in its serious handling of dramatic material in a truly dramatic style, arguably the best ever Doctor Who story."
}