{
    "title": "The Time Meddler",
    "air_date": "3 July 1965",
    "num_episodes": 4,
    "episode_titles": [
        "The Watcher",
        "The Meddling Monk",
        "A Battle of Wits",
        "Checkmate"
    ],
    "episode_duration": 25,
    "writers": [
        "Dennis Spooner"
    ],
    "directors": [
        "Douglas Caulfield"
    ],
    "media_format": "B_W",
    "dialogue_triumphs": [
        "Steven, pointing to a switch on the console: 'Well, what does this do?' Doctor: 'That is the dematerialising control. And that over yonder is the horizontal hold. Up there is the scanner, those are the doors, that is a chair with a panda on it. Sheer poetry, dear boy. Now please stop bothering me.'",
        "The Doctor finds a Viking helmet, but Steven still doesn't believe that they have time-travelled. 'What do you think it is, a space helmet for a cow?' responds the Doctor."
    ],
    "dialogue_disasters": null,
    "goofs": [
        "In episode one Steven, on finding a wrist watch, asks how they could possibly be in the 10th century (the Doctor has already told him they are in the 11th).",
        "Hartnell stumbles the response: 'But I'm not a mountain goat and I prefer walking to any day. And I hate climbing.'",
        "Hartnell also has a problem with 'personal correspondence' in the final episode."
    ],
    "continuity_notes": [
        {
            "name": "TARDIS",
            "type": "Object",
            "description": "The Doctor's time machine, with a faulty chameleon circuit and random landings.",
            "origin": "Gallifrey",
            "current_status": "Functional but with technical issues"
        },
        {
            "name": "The Doctor",
            "type": "Character",
            "description": "Time Lord protagonist, left his home planet 50 years before the Monk",
            "origin": "Gallifrey",
            "current_status": "Traveling with companions, concerned about time meddling"
        },
        {
            "name": "The Monk",
            "type": "Character",
            "description": "Another Time Lord, uses time travel for personal gain and to alter history",
            "origin": "Gallifrey",
            "current_status": "Attempting to change Earth's history"
        },
        {
            "name": "Mark Four TARDIS",
            "type": "Object",
            "description": "The Monk's more advanced TARDIS with better controls and features",
            "origin": "Gallifrey",
            "current_status": "Functional until sabotaged by the Doctor"
        }
    ],
    "technobabble": [
        "Dimensional control unit",
        "Time Vector Generator",
        "Automatic drift control"
    ],
    "roots": [
        "A Connecticut Yankee in King Arthur's Court"
    ],
    "links": [
        "Vicki notes that she would quite like to take a proper look at New York ('The Chase')."
    ],
    "locations": [
        {
            "name": "Northumbria",
            "type": "Location",
            "description": "Region in northern England",
            "origin": "Earth",
            "current_status": "Setting of the story in late Summer, 1066"
        }
    ],
    "future_history": null,
    "untold_adventures": [
        "The Monk meeting Leonardo Da Vinci and discussing principles of powered flight",
        "The Monk helping ancient Britons build Stonehenge using an anti-gravity lift"
    ],
    "qv": [
        "Terror of the Autons",
        "The Wheel in Space",
        "Carnival of Monsters",
        "The Sensorites"
    ],
    "additional_notes": "This story marks a significant change in Doctor Who, introducing another Time Lord and the concept of altering history through time travel interference.",
    "bottom_line": "An atmospheric story with cheesy Saxons and Vikings, but significant for introducing another Time Lord and the concept of changing history. Good performances, especially from Hartnell and Butterworth, with a lovely season end."
}