{
    "title": "Terror of the Autons",
    "air_date": "2 January 1971",
    "num_episodes": 4,
    "episode_titles": [
        "Part One",
        "Part Two",
        "Part Three",
        "Part Four"
    ],
    "episode_duration": 25,
    "writers": [
        "Robert Holmes"
    ],
    "directors": [
        "Barry Letts"
    ],
    "media_format": "Color",
    "dialogue_triumphs": [
        "The Master: 'He sat down in this chair here and just slipped away.'",
        "The Doctor's reply to the statement that 'Gentlemen never talk about money': 'Gentlemen never talk about anything else.'"
    ],
    "dialogue_disasters": [
        "You ham-fisted bun vendor!",
        "You're a dolly Scotsman, Mr Campbell."
    ],
    "goofs": [
        "In episode three, Pertwee responds to Yates's 'Fetch some cocoa' with 'Fetch a tin of what?'",
        "Why does Yates, after checking the repair man's credentials, stare at his bottom?",
        "How does the Master disguise himself as someone of a different height? And, indeed, why disguise himself at all?",
        "In episode one the Doctor could have got to the volatizer by hopping in through the open window (which is how the Master must have got out having set the trap).",
        "The Doctor intuitively leaps to the conclusion that Jo is opening a bomb at the end of episode one.",
        "At the start of episode three, neither Auton policeman is killed, but only one returns to the Master and Farrell. What happened to the other one?"
    ],
    "continuity_notes": [
        {
            "name": "The Doctor",
            "type": "Character",
            "description": "The Third Doctor, exiled to Earth by the Time Lords. He doesn't carry cash, can crack safes, knows Morse code, and is familiar with Civil Service details.",
            "origin": "Gallifrey",
            "current_status": "Working with UNIT, sentenced by a tribunal that still presides over his welfare."
        },
        {
            "name": "Jo Grant",
            "type": "Character",
            "description": "The Doctor's new assistant, skilled in cryptology, safe-breaking, escapology, and explosives.",
            "origin": "Earth",
            "current_status": "Recently joined UNIT, despite failing her General Science 'A' level."
        },
        {
            "name": "The Master",
            "type": "Character",
            "description": "Time Lord renegade, the Doctor's old acquaintance turned enemy. Highly skilled in hypnosis and disguise.",
            "origin": "Gallifrey",
            "current_status": "Attempting to aid the Nestene invasion of Earth."
        },
        {
            "name": "UNIT",
            "type": "Organization",
            "description": "United Nations Intelligence Taskforce, dealing with extraterrestrial threats to Earth.",
            "origin": "Earth",
            "current_status": "Active, with the Doctor as scientific advisor."
        },
        {
            "name": "Nestenes",
            "type": "Character",
            "description": "Mutually telepathic octopoid cephalopods capable of animating plastic.",
            "origin": "Unknown",
            "current_status": "Attempting to invade Earth."
        },
        {
            "name": "Gallifrey",
            "type": "Location",
            "description": "Home planet of the Time Lords, located in the constellation of Kasterborous.",
            "origin": null,
            "current_status": "Active Time Lord civilization."
        }
    ],
    "technobabble": [
        "The Master's TARDIS uses a Mark Two dematerialization circuit, as opposed to the Doctor's Mark One.",
        "The Lamadines are a species with nine opposable digits who pioneered steady-state micro-welding."
    ],
    "roots": [
        "Doomwatch ('The Devil's Sweets')",
        "Adam Adamant Lives! ('The Sweet Smell of Disaster')",
        "Groucho Marx (military intelligence being a contradiction in terms)",
        "The Power Game"
    ],
    "links": [
        "The War Games",
        "Spearhead from Space",
        "The Time Meddler",
        "The Daleks' Master Plan",
        "The Three Doctors",
        "The Five Doctors"
    ],
    "locations": [
        {
            "name": "England",
            "type": "Location",
            "description": "Primary setting of the story, specifically around Tarminster.",
            "origin": "Earth",
            "current_status": "Under threat from Nestene invasion."
        },
        {
            "name": "National Space Museum",
            "type": "Location",
            "description": "A museum dedicated to space exploration.",
            "origin": "Earth",
            "current_status": "Operational."
        }
    ],
    "future_history": null,
    "untold_adventures": [
        "The Doctor has been to a circus.",
        "At some point, he angered the Master enough to make him want to kill his 'old acquaintance'."
    ],
    "qv": [
        "UNIT Call-Signs, 'The Invasion'",
        "Season 6 (b), 'The War Games'"
    ],
    "additional_notes": "This story introduces the Master as a recurring villain and Jo Grant as the Doctor's new assistant. It also features extensive use of CSO (Colour Separation Overlay) for special effects.",
    "bottom_line": "Functional and memorably scary, but by no means an Auton story."
}