{
    "title": "The Mutants",
    "air_date": "8 April 1972",
    "num_episodes": 6,
    "episode_titles": [
        "Episode 1",
        "Episode 2",
        "Episode 3",
        "Episode 4",
        "Episode 5",
        "Episode 6"
    ],
    "episode_duration": 25,
    "writers": [
        "Bob Baker",
        "Dave Martin"
    ],
    "directors": [
        "Christopher Barry"
    ],
    "media_format": "Color",
    "dialogue_triumphs": [
        "The Doctor on 30th-century Earth: 'Grey cities linked by grey highways across a grey desert. Slag, ash and clinker, the fruits of technology.'"
    ],
    "dialogue_disasters": [
        "The Doctor's silly speech about an antimatter explosion turning them into 'un-people, un-doing un-things un-together.'",
        "'Die, Overlord, die!'",
        "'We'll all be done for!'"
    ],
    "goofs": [
        "Jon Pertwee in episode one: 'I'm not allowed to open it. I couldn't even if I wanted to. No, I'm not meant to. I couldn't open it even if I wanted to.'",
        "The opening, with a hermit-like figure shambling towards the camera, is screaming out for an 'It's…'",
        "When using oxymasks, the Overlords' dialogue is frequently unintelligible.",
        "The end of episode four is ludicrous: Varan, shot by the Marshal, falls against the hull of Skybase which disintegrates, sucking him into space (he doesn't explode in the vacuum). Despite the gaping hole, Jo, Cotton, Stubbs and Ky are able to walk away from the area once the pressure has 'normalised'."
    ],
    "continuity_notes": [
        {
            "name": "The Doctor",
            "type": "Character",
            "description": "Time Lord protagonist, currently in his third incarnation",
            "origin": "Gallifrey",
            "current_status": "Working as a 'messenger boy' for the CIA, able to withstand considerable radiation and toxic atmospheres"
        },
        {
            "name": "Thaesium",
            "type": "Object",
            "description": "A rich fuel mineral mined on Solos",
            "origin": "Solos",
            "current_status": "Being mined by Earth colonists"
        },
        {
            "name": "Solonians",
            "type": "Character",
            "description": "Indigenous species of Solos, undergoing metamorphic changes",
            "origin": "Solos",
            "current_status": "Oppressed by Earth colonists, experiencing cyclical mutations"
        }
    ],
    "technobabble": [
        "The Doctor plans to install a minimum-inertia hyperdrive for Bessie (see 'The Time Monster')."
    ],
    "roots": [
        "References to the book of Genesis",
        "Gibbon's Decline and Fall of the Roman Empire",
        "Diamonds are Forever",
        "Star Trek's 'The Cloud Minders'",
        "An allegory concerning South African racism and British colonialism in general"
    ],
    "links": [
        "'The Time Monster' (reference to Bessie's hyperdrive)",
        "'The Brain of Morbius' (mentions Solos being in the Nebula of Cyclops)"
    ],
    "locations": [
        {
            "name": "Solos",
            "type": "Location",
            "description": "Earth colony in the 30th century, located in the Nebula of Cyclops",
            "origin": null,
            "current_status": "Under Earth colonial rule for 500 years, experiencing 500-year 'seasons' that affect Solonian biology"
        },
        {
            "name": "Earth",
            "type": "Location",
            "description": "Home planet of humans, future state",
            "origin": null,
            "current_status": "Exhausted politically, economically, and biologically in the 30th century"
        }
    ],
    "future_history": "After Earth 'sacked the solar system they moved on to pastures new'. Earth is described as exhausted 'politically, economically and biologically' in the 30th century. Solos has been colonized for 500 years, with Earth running an apartheid policy.",
    "untold_adventures": null,
    "qv": [
        "'The Time Monster' (reference to Bessie's hyperdrive)"
    ],
    "additional_notes": "The story is mentioned in Salman Rushdie's novel 'The Satanic Verses'.",
    "bottom_line": "'Genocide as a side effect.' The episode is described as tedious, with poor special effects (CSO) and acting. Geoffrey Palmer's performance is noted as the best part, despite his character dying in the first episode."
}