{
    "title": "The Green Death",
    "air_date": "19 May 1973",
    "num_episodes": 6,
    "episode_titles": [
        "Episode One",
        "Episode Two",
        "Episode Three",
        "Episode Four",
        "Episode Five",
        "Episode Six"
    ],
    "episode_duration": 25,
    "writers": [
        "Robert Sloman",
        "Barry Letts (uncredited)"
    ],
    "directors": [
        "Michael Briant"
    ],
    "media_format": "Color",
    "dialogue_triumphs": [
        "BOSS taunts Stevens: 'Living dangerously? That's how you get your kicks like the good little Nietzschean you are.'"
    ],
    "dialogue_disasters": null,
    "goofs": [
        "In episode one, when Dai Evans is on the telephone in the mine, an arm appears to the bottom right, giving him his cue to speak.",
        "In episode five, the Doctor escapes from Global during the day. When Yates is caught it's dark, but the next scene, on the slag heap, is in daylight again.",
        "Episode four's end credits list 'Yate's Guard'.",
        "The end credit background is upside-down on episodes two, five and six.",
        "The dodgy CSO in episode three results in the cart bottom vanishing.",
        "Professor Jones's veggie followers appear to be wearing sheepskin coats.",
        "Why is the mine still being checked if it's been closed down as an uneconomic pit?",
        "Why is there a camera in a pipeline?",
        "The function (and lines) of Engin are taken up by James halfway through the story.",
        "The Doctor mispronounces 'chitinous' ('chit' instead of 'kite')."
    ],
    "continuity_notes": [
        {
            "name": "Metebelis 3",
            "type": "Location",
            "description": "A planet visited by the Doctor, from which he retrieves a blue sapphire.",
            "origin": null,
            "current_status": "Visited by the Doctor"
        },
        {
            "name": "The Brigadier",
            "type": "Character",
            "description": "UNIT officer who attempts to quote from article 17 of the Enabling Act.",
            "origin": "UNIT",
            "current_status": "Active UNIT officer"
        },
        {
            "name": "Jeremy Thorpe",
            "type": "Character",
            "description": "Prime Minister leading a coalition government in the early 1970s.",
            "origin": "Earth",
            "current_status": "Prime Minister of the UK"
        },
        {
            "name": "Shirley Williams",
            "type": "Character",
            "description": "Leader of the Labour party, becomes Prime Minister after the fall of Thorpe's government.",
            "origin": "Earth",
            "current_status": "Leader of the Labour Party"
        }
    ],
    "technobabble": null,
    "roots": [
        "Chamberlain's Munich speech",
        "Don Quixote",
        "Shane",
        "Doomwatch",
        "Emmerdale Farm",
        "Star Trek ('Return of the Archons', 'The Ultimate computer')",
        "Timeslip ('The Time of the Ice Box')",
        "Bug movies of the 1950s",
        "Quatermass II"
    ],
    "links": [
        "Jo's uncle at the UN gets the Nut Hutch declared a Priority One research complex. 'It's only the second time I've ever asked him for anything.' (See 'Terror of the Autons'.)"
    ],
    "locations": [
        {
            "name": "Llanfairfach, Wales",
            "type": "Location",
            "description": "The primary setting of the story",
            "origin": "Earth",
            "current_status": "Active mining town"
        }
    ],
    "future_history": "In the aftermath of several invasions of London in the late 60s, the 1970 election produces a hung parliament. A coalition government, led by Jeremy Thorpe, governs Britain in the early 70s. The government falls in early 1973, bringing the Labour party, with Shirley Williams as leader, back to power.",
    "untold_adventures": null,
    "qv": [
        "Dating the UNIT Stories, 'The Invasion'",
        "UNIT Call-Signs, 'The Invasion'",
        "Venus, 'The Time Monster'"
    ],
    "additional_notes": "BOSS misquotes Oscar Wilde and hums Wagner. Jo's trouser suit makes her look like a member of Mud. The Doctor wears a vulgar red waistcoat.",
    "bottom_line": "Still remembered as 'that Doctor Who story with the maggots', 'The Green Death' patronises the Welsh (lots of characters say 'Boyo' at every given opportunity), but Jo Grant is at last given the ability to walk in a straight line and talk at the same time. A smashing story, and UNIT's final gasp of greatness."
}