{
    "title": "Delta and the Bannermen",
    "air_date": "2 November 1987",
    "num_episodes": 3,
    "episode_titles": [
        "Part One",
        "Part Two",
        "Part Three"
    ],
    "episode_duration": 25,
    "writers": [
        "Malcolm Kohll"
    ],
    "directors": [
        "Chris Clough"
    ],
    "media_format": "Color",
    "dialogue_triumphs": [
        "The Doctor: 'Love has never been known for its rationality.'",
        "The Doctor: 'Many a slap 'twixt a cup and a lap.'",
        "'From Wales… in England!'",
        "Burton to the Doctor: 'You are not the Happy Hearts Holiday Club from Bolton, but instead are spacemen in fear of an attack from some other spacemen?'"
    ],
    "dialogue_disasters": null,
    "goofs": [
        "The rubber bodies on the ground during the initial battle.",
        "The unsatisfying bus explosion.",
        "McCoy wears his glasses in the long shots when he's driving the bike.",
        "The Doctor says the explosion of the sonic cone will destroy everyone, so why doesn't it?",
        "Why isn't Billy poisoned by the alien food? (Why does it, instead, turn him into a Chimeron?)"
    ],
    "continuity_notes": [
        {
            "name": "The Doctor's question-mark umbrella",
            "type": "Object",
            "description": "The Seventh Doctor's iconic umbrella with a question mark handle makes its first appearance in this story.",
            "origin": null,
            "current_status": "Introduced as part of the Seventh Doctor's outfit"
        },
        {
            "name": "Navarinos",
            "type": "Character",
            "description": "Squat, wrinkly purple creatures who can shapechange and time travel. They have a high metabolic rate and seem to have similarities with Time Lords.",
            "origin": "Navaro (implied)",
            "current_status": "Peaceful time-traveling species, possibly permitted by Time Lords"
        },
        {
            "name": "Chimerons",
            "type": "Character",
            "description": "An alien species with green males and infants, and humanoid females. They have been nearly wiped out by the Bannermen.",
            "origin": null,
            "current_status": "Near extinction due to conflict with Bannermen"
        },
        {
            "name": "Bannermen",
            "type": "Organization",
            "description": "A group responsible for the genocide of the Chimerons, possibly subject to punishment by a higher authority (possibly the Time Lords).",
            "origin": null,
            "current_status": "Antagonists in the story, pursuing the remaining Chimerons"
        },
        {
            "name": "Goronwy",
            "type": "Character",
            "description": "A mysterious old man who seems familiar with the Doctor and alien concepts, possibly a Time Lord in disguise.",
            "origin": "Wales (apparent)",
            "current_status": "Assisting the Doctor, hinted to have a secret identity"
        }
    ],
    "technobabble": [
        "high impulse beam",
        "sonic cone"
    ],
    "roots": [
        "Hi-De-Hi!",
        "Echo and the Bunnymen",
        "Akira Kurosawa's films (Bannermen)",
        "50s nostalgia films (American Graffiti, Peggy Sue Got Married, Back to the Future)",
        "Steve Parkhouse's Doctor Who strips",
        "Herod"
    ],
    "links": null,
    "locations": [
        {
            "name": "Shangri-La holiday camp",
            "type": "Location",
            "description": "A holiday camp near Llandrudnod Wells, Wales, serving as the main setting for the story.",
            "origin": "Wales, Earth",
            "current_status": "Active holiday destination in 1959"
        },
        {
            "name": "Toll point in space",
            "type": "Location",
            "description": "A future location in space where time travelers pay a toll, possibly near Navaro and on one of the Navarinos' main routes.",
            "origin": "Space, possibly near Navaro",
            "current_status": "Active toll collection point for time travelers"
        }
    ],
    "future_history": null,
    "untold_adventures": [
        "Mel's previous encounter with the Bannermen (implied)",
        "The Doctor's story about 'Glass Eaters'",
        "A previous Nostalgia Trips disaster"
    ],
    "qv": null,
    "additional_notes": "Murray reads The Eagle. Sylvester McCoy has trouble with 'high impulse beam' in episode two. Ray's bow makes her look like a Mouseketeer. Mel's pyjamas are rather woeful.",
    "bottom_line": "Confident, slick, and hugely enjoyable from beginning to end, 'Delta and the Bannermen' isn't grim, gritty or cynical, and is thus tremendously adult. It roars with new style. This is the first real hint of McCoy's Doctor, dancing awkwardly with Ray, hugging a Stratocaster, confronting Gavrok and threatening the Bannermen. Langford is actually great in this, a very human story of sex, drugs and rock'n'roll. Even Ken Dodd's OK. But who told Don Henderson to play it so straight?"
}