{
    "title": "Survival",
    "air_date": "22 November 1989",
    "num_episodes": 3,
    "episode_titles": [
        "Part One",
        "Part Two",
        "Part Three"
    ],
    "episode_duration": 25,
    "writers": [
        "Rona Munro"
    ],
    "directors": [
        "Alan Wareing"
    ],
    "media_format": "Color",
    "dialogue_triumphs": [
        "'If we fight like animals, we die like animals!' shouts the Doctor on the streets of 80s London.",
        "'I thought you'd died. Or gone to Birmingham.'",
        "'There are worlds out there where the sky is burning, and the sea's asleep, and the rivers dream. People made of smoke and cities made of song. Somewhere there's danger, somewhere there's injustice, somewhere else the tea's getting cold. Come on Ace, we've got work to do.'"
    ],
    "dialogue_disasters": null,
    "goofs": [
        "That awful shot of the colliding bikes.",
        "Why doesn't the Master, as much a Cheetah Person as Ace is, just teleport off the planet? [The Master doesn't realise that to use the teleportation powers does not necessarily mean becoming a full Cheetah Person.]"
    ],
    "continuity_notes": [
        {
            "name": "The Doctor",
            "type": "Character",
            "description": "The protagonist of the series, a Time Lord who travels through time and space.",
            "origin": "Gallifrey",
            "current_status": "Can stun with one finger, juggle, ride both horse and motorcycle, has a calculator/scanner fob watch, and regards Earth or the TARDIS as his home."
        },
        {
            "name": "Ace",
            "type": "Character",
            "description": "The Doctor's companion, a teenage girl from 1980s London.",
            "origin": "Perivale, London",
            "current_status": "Can ride a horse, supports hunt saboteurs, drinks Diet Coke. Her friends used to meet at the Youth Club, pub or Horsenden Hill on Sundays. Her Mum has reported her as missing."
        },
        {
            "name": "The Master",
            "type": "Character",
            "description": "The Doctor's nemesis, another Time Lord.",
            "origin": "Gallifrey",
            "current_status": "Brought to the planet as prey, hypnotically controls the Cheetah People and has linked mentally with the Kitlings through his connection to the planet."
        },
        {
            "name": "Cheetah People",
            "type": "Character",
            "description": "Inhabitants of an unnamed planet that transforms its inhabitants.",
            "origin": "Unnamed planet",
            "current_status": "Controlled by the Master"
        }
    ],
    "technobabble": null,
    "roots": [
        "Val Lewton's Cat People",
        "Cats (a poster)",
        "Lord of the Flies",
        "The Wizard of Oz (Ace gets to do her Dorothy bit again, clicking her heels to go home)"
    ],
    "links": null,
    "locations": [
        {
            "name": "Perivale",
            "type": "Location",
            "description": "A suburb in London where Ace is from.",
            "origin": "Earth",
            "current_status": "Setting for parts of the episode in the 1980s"
        },
        {
            "name": "Unnamed planet of the Cheetah People",
            "type": "Location",
            "description": "A [telepathic?] organism that transforms its inhabitants.",
            "origin": null,
            "current_status": "Setting for parts of the episode"
        }
    ],
    "future_history": null,
    "untold_adventures": null,
    "qv": null,
    "additional_notes": "Anthony Ainley gives his best performance as the Master in this episode. The episode wraps up Ace's past life, gives the Doctor a home, sees him refuse to fight an old enemy, and restates his creed almost as a parable. The series ends in the same place it began (contemporary London), with the Doctor bringing a missing Londoner home. It criticizes the morality the series embraced in 'The Daleks' and implicitly criticizes free-market values.",
    "bottom_line": "A great end to the series with themes that wrap up Ace's past life, give the Doctor a home, see him refuse to fight an old enemy, and restate his creed almost as a parable. The episode comes full circle, has grown up with its audience, and remains just as relevant as it ever was."
}