{
    "title": "The Space Pirates",
    "air_date": "8 March 1969",
    "num_episodes": 6,
    "episode_titles": [
        "Episode 1",
        "Episode 2",
        "Episode 3",
        "Episode 4",
        "Episode 5",
        "Episode 6"
    ],
    "episode_duration": 25,
    "writers": [
        "Robert Holmes"
    ],
    "directors": [
        "Michael Hart"
    ],
    "media_format": "B_W",
    "dialogue_triumphs": [
        "Jamie (to Zoe, when she proves unable to open a door): 'You'll have to eat more porridge.'"
    ],
    "dialogue_disasters": null,
    "goofs": [
        "Zoe does not know how candles work. However, in 'The Mind Robber' she recognised them without hesitation.",
        "In the cliffhanger to episode three the screams of the Doctor and the others can be heard for ages: in the next episode they've only fallen a few feet.",
        "There are noisy explosions in space, but no stars."
    ],
    "continuity_notes": [
        {
            "name": "Argonite",
            "type": "Object",
            "description": "The most valuable mineral known to man, found only on certain planets of the fourth sector of Earth's galaxy. It is practically indestructible.",
            "origin": "Fourth sector of Earth's galaxy, including Ta in the Pliny system",
            "current_status": "Highly sought after, with a black market existing on Ruta Magnum"
        },
        {
            "name": "The Doctor",
            "type": "Character",
            "description": "Time Lord protagonist",
            "origin": "Gallifrey",
            "current_status": "Carries marbles, pins, and a tuning fork in his pockets. Uses a normal screwdriver."
        },
        {
            "name": "Zoe",
            "type": "Character",
            "description": "The Doctor's companion",
            "origin": "Future Earth",
            "current_status": "Unfamiliar with argonite, suggesting the story takes place after her time"
        },
        {
            "name": "Space Corps",
            "type": "Organization",
            "description": "Law enforcement body in space",
            "origin": "Earth",
            "current_status": "Enforcing law and order in areas where pirates operate"
        }
    ],
    "technobabble": [
        "'Clancey has a terrible temper. He's likely to explode like glyciltrinitrate.'",
        "The unit that remotely operates the LIZ is 'transistorised'."
    ],
    "roots": [
        "The works of Gerry Anderson",
        "Star Trek",
        "Buck Rogers",
        "2001",
        "contemporary NASA missions",
        "Westerns"
    ],
    "links": [
        "'Fury from the Deep'",
        "'The Mind Robber'",
        "'Nightmare of Eden'",
        "'Colony in Space'"
    ],
    "locations": [
        {
            "name": "Ta",
            "type": "Location",
            "description": "Planet in the Pliny system where argonite is found",
            "origin": "Fourth sector of Earth's galaxy",
            "current_status": "Site of argonite mining operations"
        },
        {
            "name": "Beacon Alpha 4",
            "type": "Location",
            "description": "Navigation beacon where the TARDIS lands",
            "origin": "Space",
            "current_status": "Constructed from argonite, frequently targeted by pirates"
        }
    ],
    "future_history": "Earth – normally known as 'the Home Planet' – is ruled by a single government. Information regarding flight plans and the like is normally transmitted back to Central Flight Information. Navigation beacons are constructed from argonite, and are frequently destroyed and then plundered by pirates. The Space Corps enforce law and order in an area where pirates also steal shipments of argonite ore. Argonite mining is almost always done by large companies, including the Issigri Mining Company [which later became the Interplanetary Mining Corporation].",
    "untold_adventures": null,
    "qv": null,
    "additional_notes": "The model work and music almost stand comparison with Gerry Anderson's series. Fashion Victims: Technician Penn has a horrible droopy moustache.",
    "bottom_line": "The Space Pirates is padded with laboured comedy and some horrible American accents. It ends like an episode of Scooby Doo, with a bad joke and lots of forced laughter. Despite this, it is possible to see the first real emergence of Robert Holmes' gift for characterisation and engaging plot."
}