{
    "title": "The Enemy of the World",
    "air_date": "23 December 1967",
    "num_episodes": 6,
    "episode_titles": [
        "Episode 1",
        "Episode 2",
        "Episode 3",
        "Episode 4",
        "Episode 5",
        "Episode 6"
    ],
    "episode_duration": 25,
    "writers": [
        "David Whitaker"
    ],
    "directors": [
        "Barry Letts"
    ],
    "media_format": "B_W",
    "dialogue_triumphs": [
        "'People spend all their time making nice things, and then other people come along and break them,' muses the Doctor.",
        "Griffin the chef on events in episode three: 'First course interrupted by bomb explosion… Second course affected by earthquakes…'"
    ],
    "dialogue_disasters": null,
    "goofs": [
        "Troughton's Mexican accent is variable.",
        "In episode four Colin Douglas asks the right questions in the wrong order, getting a series of puzzled silences.",
        "There's another slow TARDIS landing sound.",
        "The serial is so under-budget that Denes is kept prisoner in a corridor. 'It's easier to guard him here,' claims the guard.",
        "In episode five, Bruce similarly notes: 'You don't really believe I came here with just one guard, do you?'",
        "In episode three, Benik completely fails to destroy Kent's portrait."
    ],
    "continuity_notes": [
        {
            "name": "Victoria",
            "type": "Character",
            "description": "Companion of the Second Doctor",
            "origin": "19th century Earth",
            "current_status": "Traveling with the Doctor and Jamie, likes Kaiser pudding but can't cook"
        },
        {
            "name": "The Doctor",
            "type": "Character",
            "description": "Time Lord protagonist, currently in his second incarnation",
            "origin": "Gallifrey",
            "current_status": "Can mimic voices and identify dialects, plays 'Twinkle Twinkle Little Star'"
        }
    ],
    "technobabble": null,
    "roots": [
        "The Prisoner of Zenda",
        "1984",
        "The Avengers (Astrid's fighting style and costume)",
        "James Bond",
        "Our Man Flint",
        "The Man from UNCLE's 'The Cherry Blossom Affair'"
    ],
    "links": [
        "The Doctor plays 'Twinkle Twinkle Little Star' again (see 'The Abominable Snowmen').",
        "The Doctor says they have been 'on ice', which is why they're not clued up about the political situation.",
        "When Kent mentions a disused jetty the Doctor says: 'A disused Yeti?'"
    ],
    "locations": [
        {
            "name": "Australia",
            "type": "Location",
            "description": "Area around Cape Melville, including the Cedar district, and Kanowa, 200 miles away",
            "origin": "Earth",
            "current_status": "Setting for part of the story"
        },
        {
            "name": "Central Europe",
            "type": "Location",
            "description": "Near the Eperjet Tokyar mountains",
            "origin": "Earth",
            "current_status": "Setting for part of the story"
        }
    ],
    "future_history": "The World Zones Organisation runs the world, divided as it is into large zones, including Central Asian, Arctic, European, and Central European. Regular conferences on dwindling world resources are held in Geneva, but Salamander's satellite energy technology has resulted in corn in Siberia and vineyards in Alaska. Hovercraft, helicopters and intercontinental rocket transport are all commonplace. Public telephones and holiday liners still exist. War between countries is a thing of the past, but this didn't look so likely five years previously.",
    "untold_adventures": null,
    "qv": null,
    "additional_notes": "Fashion Victims: The guards' silly helmets, Salamander's bullfighter look, and Jamie's kinky rubber guard jacket. Double Entendres: 'What sort of records has he got down there?' Bruce asks about Salamander's sojourns to the Records Room. New Romantic, if his clothes are anything to go by.",
    "bottom_line": "Griffin the chef is wonderful – it's a pity we don't see more of this most ordinary person in Doctor Who – and Benik is the campest character in Who, a much more contested award. The story is edited really badly, so characters leap from scene to scene interrupting each other. Troughton's fun villainy apart, it all feels rather irrelevant."
}