{
    "title": "The Moonbase",
    "air_date": "11 February 1967",
    "num_episodes": 4,
    "episode_titles": [
        "Episode 1",
        "Episode 2",
        "Episode 3",
        "Episode 4"
    ],
    "episode_duration": 25,
    "writers": [
        "Gerry Davis (uncredited)",
        "Kit Pedler"
    ],
    "directors": [
        "Morris Barry"
    ],
    "media_format": "B_W",
    "dialogue_triumphs": [
        "There are some corners of the universe which have bred the most terrible things… They must be fought."
    ],
    "dialogue_disasters": [
        "Feelings? Yes, we know of this weakness of yours. We do not possess feelings.",
        "Only stupid Earth brains like yours would have been fooled.",
        "Clever, clever, clever…"
    ],
    "goofs": [
        "Anneke Wills talks about landing on the 'move' instead of 'moon'.",
        "Troughton's reference to Lister being at Glasgow is wrong (it should be Edinburgh).",
        "A Cyberman nearly takes the whole sickbay bed with him when getting up.",
        "A Cyberman misses zapping Polly, but she falls anyway.",
        "The Cybermen's spaceships look like paper plates held up by string.",
        "Evans puts the cloth helmet on back-to-front in one scene, but it's correct in the next."
    ],
    "continuity_notes": [
        {
            "name": "Cybermen",
            "type": "Character",
            "description": "Cybernetic beings from Mondas, Earth's twin planet.",
            "origin": "Mondas",
            "current_status": "Attacking the Moonbase, with new abilities and appearance."
        },
        {
            "name": "The Doctor",
            "type": "Character",
            "description": "Time Lord protagonist, currently in his second incarnation.",
            "origin": "Gallifrey",
            "current_status": "Defending the Moonbase from Cybermen attack."
        },
        {
            "name": "TARDIS",
            "type": "Object",
            "description": "The Doctor's time and space machine.",
            "origin": "Gallifrey",
            "current_status": "Used to transport the crew to the Moon."
        }
    ],
    "technobabble": [
        "Gravitron",
        "Thermonuclear power",
        "Interferon as a viral antibody"
    ],
    "roots": [
        "Conquest of Space"
    ],
    "links": [
        "The Tenth Planet"
    ],
    "locations": [
        {
            "name": "The Moon",
            "type": "Location",
            "description": "Earth's natural satellite, site of a weather control base.",
            "origin": "Solar System",
            "current_status": "Location of human base and site of Cybermen attack."
        },
        {
            "name": "Moonbase",
            "type": "Location",
            "description": "Human facility on the Moon for controlling Earth's weather.",
            "origin": "Earth",
            "current_status": "Under attack by Cybermen."
        }
    ],
    "future_history": "The Moonbase was established around 2050 to control the Earth's weather via the Gravitron. Earth has become environmentally unstable. This story seems to take place before 'The Seeds of Death', when a moonbase is used to control Earth's travel system and weather control has been moved to the Earth.",
    "untold_adventures": [
        "The Doctor claims to have gained a doctorate under Joseph Lister in Glasgow in 1888, though this conflicts with known history."
    ],
    "qv": [
        "Cyber History, 'The Tenth Planet'",
        "The TARDIS Scanner, 'Full Circle'"
    ],
    "additional_notes": "The episode features extensive discussion about the Doctor's qualifications and medical knowledge, with conflicting information presented across various stories in the series.",
    "bottom_line": "Final proof that ridiculous and tacky Doctor Who didn't begin in the 1970s. 'The Moonbase' is illogical and boring, reducing the Cybermen to the role of intergalactic gangsters. A waste of the talent involved."
}