{
    "title": "The Highlanders",
    "air_date": "17 December 1966",
    "num_episodes": 4,
    "episode_titles": [
        "Episode 1",
        "Episode 2",
        "Episode 3",
        "Episode 4"
    ],
    "episode_duration": 25,
    "writers": [
        "Elwyn Jones",
        "Gerry Davis"
    ],
    "directors": [
        "Hugh David"
    ],
    "media_format": "B_W",
    "dialogue_triumphs": [
        "I've never seen a silent lawyer before.",
        "There is no plot,"
    ],
    "dialogue_disasters": null,
    "goofs": [
        "Ffinch threatens his men with 300 lashes apiece. (In the book, Davis alters it to a less terminal six.)",
        "The Jacobite rebellion is erroneously presented as an Anglo-Scottish conflict, rather than the attempt to restore the Stuart dynasty as it actually was."
    ],
    "continuity_notes": [
        {
            "name": "The Doctor",
            "type": "Character",
            "description": "The main protagonist of Doctor Who, a Time Lord from Gallifrey.",
            "origin": "Gallifrey",
            "current_status": "Carries a magnifying glass and a conker. Threatens people with an unloaded pistol throughout, despite professing a lack of ability with it."
        },
        {
            "name": "Jamie McCrimmon",
            "type": "Character",
            "description": "A new companion of the Doctor, a young Highlander from 18th century Scotland.",
            "origin": "Scotland, 18th century",
            "current_status": "Can't swim. Son of Donald McCrimmon, a piper. Boards the TARDIS on condition that he teaches the Doctor how to play the bagpipes."
        }
    ],
    "technobabble": null,
    "roots": [
        "Kidnapped",
        "The Magic Flute",
        "Peter Watkins' drama-documentary Culloden",
        "The legend of the McCrimmons"
    ],
    "links": [
        "The War Machines"
    ],
    "locations": [
        {
            "name": "Culloden",
            "type": "Location",
            "description": "Site of the Battle of Culloden in 1746, a significant battle in Scottish history.",
            "origin": "Scotland",
            "current_status": "Setting of the episode in 1746"
        }
    ],
    "future_history": null,
    "untold_adventures": null,
    "qv": [
        "The Doctor's Name",
        "The War Machines"
    ],
    "additional_notes": "The Doctor wears his 16th-century hat, various disguises and drag. Jamie's battle cry of 'Craeg An Tuire' is heard for the first time. The episode contains several double entendres.",
    "bottom_line": "Troughton Chaplins his way through disguises and comic voices, as a German doctor, an old Scottish lady, and a Redcoat. Trask, master of the slave ship, is wonderfully OTT: 'Silence, ye scurvy dogs!' It is fitting that the most anarchic Doctor should be accompanied by a master of the Piobaireachd, the banned music of rebellion."
}