{
    "title": "Nightmare of Eden",
    "air_date": "24 November 1979",
    "num_episodes": 4,
    "episode_titles": [
        "Part One",
        "Part Two",
        "Part Three",
        "Part Four"
    ],
    "episode_duration": 25,
    "writers": [
        "Bob Baker"
    ],
    "directors": [
        "Alan Bromly",
        "Graham Williams (uncredited)"
    ],
    "media_format": "Color",
    "dialogue_triumphs": [
        "The Doctor [quoting CIA ethics]: 'Of course we should interfere. Always do what you're good at.'",
        "Captain Rigg blows the Doctor's cover: 'Galactic went out of business twenty years ago.' The Doctor: 'I wondered why I hadn't been paid…'",
        "'That's not good enough!' 'That's what I said!'"
    ],
    "dialogue_disasters": [
        "The Doctor attacked by Mandrels: 'Oh my fingers! My arms! My legs! My everything!'",
        "The Doctor tells Romana she has two minutes 58 seconds to rebuild the CET: 'I'll need a screwdriver.'"
    ],
    "goofs": [
        "The Doctor leaves the TARDIS doors open.",
        "In episode two, when K-9 seals up the wall panel, a hand emerges to hold the thing in place.",
        "When Delia gets shot in the face in episode four, she clutches her stomach."
    ],
    "continuity_notes": [
        {
            "name": "K-9",
            "type": "Character",
            "description": "The Doctor's robotic dog companion",
            "origin": null,
            "current_status": "Can track the Doctor. His scanners won't work in a 'matter interface'. Has saved the Doctor's life many times and beat him at chess (once)."
        },
        {
            "name": "The Doctor",
            "type": "Character",
            "description": "Time Lord protagonist",
            "origin": "Gallifrey",
            "current_status": "Claims his date of birth is 'some time quite soon'. Can start 'anything from a steam engine to a TARDIS'. Able to suspend his breathing whilst in a vacuum."
        },
        {
            "name": "Vraxoin",
            "type": "Object",
            "description": "Highly addictive and destructive drug",
            "origin": null,
            "current_status": "A fungus that induces apathy. The Doctor has seen 'whole planets' destroyed by it."
        },
        {
            "name": "Continual Event Transmuter (CET)",
            "type": "Object",
            "description": "Device for storing life forms as electromagnetic signals",
            "origin": null,
            "current_status": "Converts specimens to electromagnetic signals, stored on laser crystals."
        }
    ],
    "technobabble": [
        "The Doctor asks whether the CET features a spatial integrator, a transmutation oscillator, a hologistic retention circuit or a dimensional osmosis damper.",
        "Tryst and Dymond plan to smuggle vraxoin with an entuckor laser."
    ],
    "roots": [
        "Airport-style disaster movies",
        "The Pied Piper of Hamelin (the Doctor's dog whistle leads the Mandrels into the CET)",
        "The Doctor misquotes Captain Oates ('I may be rather a long time')",
        "The Doctor misquotes Henry V ('Once more into the…')"
    ],
    "links": null,
    "locations": [
        {
            "name": "The Empress",
            "type": "Location",
            "description": "Cruise liner with 900 passengers",
            "origin": null,
            "current_status": "Commutes between Station 9 and Azure in the Western Galaxy"
        },
        {
            "name": "Eden",
            "type": "Location",
            "description": "Planet stored in the CET",
            "origin": null,
            "current_status": "One of several planets stored in Tryst's CET"
        }
    ],
    "future_history": "Galactic Salvage Insurance was formed in London in 2068 and was liquidated in 2096. The story is set around 2116.",
    "untold_adventures": [
        "The Doctor knew Tryst's mentor, the late Professor Stein."
    ],
    "qv": null,
    "additional_notes": "Fashion victims include Romana's maternity dress, Fisk's leatherman outfit, Rigg's neck ring, and Mandrels with flares. Nobody knows how to pronounce 'Hecate'. In episode three Barry Andrews can't say 'expedition'. In episode four Geoffrey Hinsliff (Fisk) calls Tryst 'Fisk'!",
    "bottom_line": "An oddly mature story, 'Nightmare of Eden' is very watchable. Sadly a couple of awful scenes in episode four and the Mandrels have been allowed to undermine the story's many favourable points. The scene of Tryst's attempted justification for his crimes ('They had a choice') and the Doctor coldly rejecting him ('Go away') is worthy of considerable praise."
}