{
    "title": "Revenge of the Cybermen",
    "air_date": "19 April 1975",
    "num_episodes": 4,
    "episode_titles": [
        "Part One",
        "Part Two",
        "Part Three",
        "Part Four"
    ],
    "episode_duration": 25,
    "writers": [
        "Gerry Davis",
        "Robert Holmes (uncredited)"
    ],
    "directors": [
        "Michael E. Briant"
    ],
    "media_format": "Color",
    "dialogue_triumphs": [
        "Nice sense of irony",
        "I think you've riled him"
    ],
    "dialogue_disasters": [
        "You have the philosophy of a cringing mouse, Tyrum."
    ],
    "goofs": [
        "The Doctor was wearing a long brown coat and hat at the end of the previous story, but they've vanished when he materialises",
        "Lester wears his Interplanetary Space Command insignia upside-down",
        "There is air and gravity inside a four-kilometre-wide asteroid, and a noisy explosion in space",
        "Cybermats are hugged to make them look as if they're attacking",
        "Obvious NASA footage is used for the rocket take-off",
        "The Cyberleader shakes the Doctor's shoulders in what appears to be Swedish massage rather than strangulation",
        "A spinning roll of lunar landscape simulates a near-miss of the asteroid",
        "If the transmat only works on human tissue, why doesn't it wreck Cybermen and leave humans naked?",
        "When the Doctor enters the TARDIS in episode four the paper print-out of the space/time telegraph can be seen hanging on a hook just inside the door",
        "Voga is the Planet of Gold, but when the Cybermen arrive, two of them gun down half of the Vogan army with non-gold bullets"
    ],
    "continuity_notes": [
        {
            "name": "Cybermen",
            "type": "Character",
            "description": "Cybernetic beings susceptible to gold, expressing emotions despite their nature. Bullet-proof with hydraulic muscles and head-mounted weapons.",
            "origin": null,
            "current_status": "Reduced to one ship, seeking revenge"
        },
        {
            "name": "Gold",
            "type": "Object",
            "description": "Non-corrodable metal that clogs Cybermen's breathing apparatus and blocks their radar",
            "origin": null,
            "current_status": "Used as a weapon against Cybermen"
        },
        {
            "name": "Glittergun",
            "type": "Object",
            "description": "Weapon that can destroy Cybermen using gold",
            "origin": null,
            "current_status": "Mentioned as a defense against Cybermen"
        },
        {
            "name": "Armageddon Convention",
            "type": "Concept",
            "description": "Agreement that banned Cyberbombs",
            "origin": null,
            "current_status": "In effect during the story"
        },
        {
            "name": "TARDIS",
            "type": "Object",
            "description": "The Doctor's time and space machine",
            "origin": null,
            "current_status": "Drifts back through time and space to meet the Doctor"
        }
    ],
    "technobabble": [
        "Phobic energy in physics rather than psychology"
    ],
    "roots": [
        "Misquotes of Descartes ('Cogito ergo sum: I think therefore it missed')",
        "Misquotes of Macbeth ('Out, out, dusty death')",
        "Live and Let Die (hairbrush radio)",
        "Voga as a reference to an island of gold that Columbus was looking for in the Atlantic"
    ],
    "links": [
        "The Moonbase",
        "Genesis of the Daleks",
        "Planet of the Spiders"
    ],
    "locations": [
        {
            "name": "Nerva Beacon",
            "type": "Location",
            "description": "Military beacon orbiting Jupiter, monitoring Earth-Pluto flights",
            "origin": "Earth",
            "current_status": "Active space station in c.2875"
        },
        {
            "name": "Voga (Neo Phobos)",
            "type": "Location",
            "description": "Planet of Gold, 13th Jovian satellite",
            "origin": "Jupiter's orbit",
            "current_status": "Under threat from Cybermen"
        }
    ],
    "future_history": "Nerva Beacon orbits Jupiter as a military station before becoming the cryogenic space ark Terra Nova. Earth-Pluto flights are regular occurrences.",
    "untold_adventures": [
        "The Doctor mentions meeting Harry Houdini"
    ],
    "qv": [
        "Cyber History, 'The Tenth Planet'",
        "The Doctor's Doctorate, 'The Moonbase'"
    ],
    "additional_notes": "The Cybermen's appearance includes flares, giving them a smiling expression. The episode contains several double entendres.",
    "bottom_line": "A contradictory, tedious, and unimaginative mess. The humans know the Cybermen are going to arrive, yet are surprised when they do, and talk fondly of the Doctor and companions having just been suspicious of them. No time. No money. No mercy. Even the title's rubbish."
}