{
    "title": "State of Decay",
    "air_date": "22 November 1980",
    "num_episodes": 4,
    "episode_titles": [
        "Part One",
        "Part Two",
        "Part Three",
        "Part Four"
    ],
    "episode_duration": 25,
    "writers": [
        "Terrance Dicks"
    ],
    "directors": [
        "Peter Moffatt"
    ],
    "media_format": "Color",
    "dialogue_triumphs": [
        "He who outlives this day and comes safe home shall stand a-tiptoe when this day is named and rouse him at the name of E-space!",
        "That is the question",
        "What is, is wrong",
        "There was once an old hermit from the mountains of South Gallifrey…",
        "They came out of nowhere and swarmed… all over the Universe",
        "Do you know, it just occurs to me, there are vampire legends on almost every inhabited planet?… Creatures that stalk the night and feast on the blood of the living."
    ],
    "dialogue_disasters": null,
    "goofs": [
        "The Doctor says the Tower decor is rococo when actually it's late Saxon/early Romanesque.",
        "In episode three, a rebel bursts into the Doctor's cell, catching him across the nose with the door (Tom Baker appears slightly stunned, and misses his next cue).",
        "Why is Kalmar so concerned to get back to Earth when he and his people have never been there?"
    ],
    "continuity_notes": [
        {
            "name": "K-9",
            "type": "Character",
            "description": "The Doctor's robotic companion, capable of storing vast amounts of data.",
            "origin": null,
            "current_status": "Traveling with the Doctor and providing information about vampires and TARDIS procedures."
        },
        {
            "name": "Rassilon",
            "type": "Character",
            "description": "Legendary founder of Time Lord society, involved in the war against the Great Vampires.",
            "origin": "Gallifrey",
            "current_status": "Historical figure, mentioned in relation to vampire lore."
        },
        {
            "name": "Great Vampires",
            "type": "Character",
            "description": "Ancient enemies of the Time Lords, nearly extinct except for one survivor.",
            "origin": "Unknown",
            "current_status": "One survivor present on the unnamed planet in E-space."
        },
        {
            "name": "Hydrax",
            "type": "Object",
            "description": "Earth ship drawn into E-space by the Great Vampire.",
            "origin": "Earth",
            "current_status": "Used by the vampires on the unnamed planet."
        },
        {
            "name": "TARDIS",
            "type": "Object",
            "description": "The Doctor's time and space machine, containing important historical records.",
            "origin": "Gallifrey",
            "current_status": "In use by the Doctor and companions, containing the Record of Rassilon."
        },
        {
            "name": "E-space",
            "type": "Location",
            "description": "An alternate universe where the TARDIS is currently trapped.",
            "origin": null,
            "current_status": "Current location of the Doctor and companions."
        }
    ],
    "technobabble": [
        "A 'technacothaka' is said to be a museum.",
        "CVE (Charged Vacuum Emboitment)",
        "Bow-ships which fired bolts of steel to kill the vampires"
    ],
    "roots": [
        "The vampire genre (especially Hammer vampire films)",
        "J. Sheridan Le Fanu's 1872 story 'Carmilla'",
        "The Vampire Lovers",
        "Vampyres: Daughters of Darkness",
        "Jean Rollin's work",
        "Shakespeare's Henry V and Hamlet",
        "Pope's 'Essay on Man'",
        "Browning's 'Childe Roland to the Dark Tower Came'",
        "Mervyn Peake's Gormenghast",
        "Lest Darkness Fall"
    ],
    "links": [
        "Full Circle (previous episode in the E-space trilogy)",
        "The Deadly Assassin",
        "The Time Monster",
        "Planet of the Spiders",
        "The Trial of a Time Lord"
    ],
    "locations": [
        {
            "name": "Unnamed planet in E-space",
            "type": "Location",
            "description": "A planet with a day equivalent to 23.3 Earth hours and a year of 350 Earth days, unchanged for thousands of years.",
            "origin": "E-space",
            "current_status": "Under the control of vampire-like beings, with a fearful population of villagers."
        }
    ],
    "future_history": null,
    "untold_adventures": [
        "The Time Lord war with the Great Vampires"
    ],
    "qv": [
        "The Origins of the Time Lords",
        "The Deadly Assassin"
    ],
    "additional_notes": "The episode heavily features vampire lore and connects it to Time Lord history, expanding on the mythology of the Doctor Who universe.",
    "bottom_line": "A smashing evocation of a traditional horror story, worked into the Doctor Who formula."
}