{
    "title": "The Android Invasion",
    "air_date": "22 November 1975",
    "num_episodes": 4,
    "episode_titles": [
        "Part One",
        "Part Two",
        "Part Three",
        "Part Four"
    ],
    "episode_duration": 25,
    "writers": [
        "Terry Nation"
    ],
    "directors": [
        "Barry Letts"
    ],
    "media_format": "Color",
    "dialogue_triumphs": [
        "'Let's try the pub!' chuckles the Doctor. [Kraals drink McEwans Export.]",
        "'Is that finger loaded?'"
    ],
    "dialogue_disasters": [
        "'I will now activate the hostility circuits.'"
    ],
    "goofs": [
        "The Doctor lets go of a branch and it slaps Sarah in the face.",
        "A large piece of cardboard appears behind the pod for the Doctor to lie on.",
        "The Doctor's robot detector in episode four would have been very useful earlier on.",
        "The Kraal plan has several flawed aspects: their indestructible androids' faces fall off when they trip, and their complete memory prints don't include a dislike for ginger pop.",
        "The village, the Space Centre and all the people were copied from Crayford's mind, so why is there an android of Harry (he wasn't a member of UNIT two years previously), and why isn't there one of the Brigadier (who does, after all, have his own office at the Space Centre)?",
        "Crayford has never looked under his eyepatch to find his intact eye! (And nobody at Space Control notices this acquisition, either.)",
        "As the Daily Mail reviewer in 1975 wondered, how can the Doctor use his own android against Styggron if all the androids have been neutralized?"
    ],
    "continuity_notes": [
        {
            "name": "The Doctor",
            "type": "Character",
            "description": "Time Lord protagonist, likes tea, muffins and ginger beer. Can survive high acceleration and was unpaid when advising UNIT.",
            "origin": "Gallifrey",
            "current_status": "Investigating strange occurrences in Devesham"
        },
        {
            "name": "Sarah Jane Smith",
            "type": "Character",
            "description": "The Doctor's companion, a journalist for at least two years. Hates ginger pop and once came to Devesham on a story.",
            "origin": "Earth",
            "current_status": "Accompanying the Doctor"
        },
        {
            "name": "Sergeant Benton",
            "type": "Character",
            "description": "UNIT soldier, has a younger sister who is his ballroom-dancing partner.",
            "origin": "Earth",
            "current_status": "UNIT staff member"
        },
        {
            "name": "TARDIS",
            "type": "Object",
            "description": "The Doctor's time and space machine, due for its 500-year service.",
            "origin": "Gallifrey",
            "current_status": "Operational"
        },
        {
            "name": "Kraals",
            "type": "Character",
            "description": "Alien race attempting to invade Earth, aware of the Time Lords.",
            "origin": "Oseidon",
            "current_status": "Planning invasion of Earth"
        },
        {
            "name": "Space Defence Station",
            "type": "Location",
            "description": "British installation against alien attack, the only one of its kind in the world.",
            "origin": "Earth",
            "current_status": "Operational"
        },
        {
            "name": "UNIT",
            "type": "Organization",
            "description": "United Nations Intelligence Taskforce, dealing with extraterrestrial threats.",
            "origin": "Earth",
            "current_status": "Active, with staff present at the Space Defence Station"
        }
    ],
    "technobabble": [
        "The planet Oseidon has the highest natural radiation level in the galaxy, but an Earth-type atmosphere, gravity, etc."
    ],
    "roots": [
        "Invasion of the Body Snatchers",
        "The Stepford Wives",
        "Pohl's Tunnel under the World",
        "Star Trek (the mind probe in 'Errand of Mercy')"
    ],
    "links": null,
    "locations": [
        {
            "name": "Oseidon",
            "type": "Location",
            "description": "Home planet of the Kraals, with the highest natural radiation level in the galaxy but Earth-like conditions.",
            "origin": null,
            "current_status": "Habitable by Kraals and seemingly by humans"
        },
        {
            "name": "Devesham Space Defence Station",
            "type": "Location",
            "description": "British space defense installation, capable of rocket launches and landings.",
            "origin": "Earth",
            "current_status": "Operational, focus of Kraal invasion plan"
        },
        {
            "name": "Devesham village",
            "type": "Location",
            "description": "Village near the Space Defence Station, replicated by the Kraals.",
            "origin": "Earth",
            "current_status": "Replica created as part of invasion plan"
        }
    ],
    "future_history": "Humans have only got as far as orbiting Jupiter. Space freighters were being tested two years ago, suggesting the existence of space stations.",
    "untold_adventures": [
        "The Doctor once met the Duke of Marlborough."
    ],
    "qv": null,
    "additional_notes": "Fashion Victims: Styggron's silver Doc Martens. The android mechanics' space helmets. 'I don't like the look of them,' says Sarah.",
    "bottom_line": "'Resistance is… inadvisable.' Stupid, tiresome and very irritating. Kenneth Williams' description of episode two in his diaries: 'Doctor Who gets more and more silly.'"
}