{
    "title": "The Androids of Tara",
    "air_date": "25 November 1978",
    "num_episodes": 4,
    "episode_titles": [
        "Part One",
        "Part Two",
        "Part Three",
        "Part Four"
    ],
    "episode_duration": 25,
    "writers": [
        "David Fisher"
    ],
    "directors": [
        "Michael Hayes"
    ],
    "media_format": "Color",
    "dialogue_triumphs": [
        "Would you mind not standing on my chest, my hat's on fire?",
        "They always want you to go alone when you're walking into a trap, have you noticed that?",
        "To K-9, cutting a door: 'A hamster with a blunt penknife could do it quicker!'",
        "Grendel's parting riposte as he leaps from the castle battlements: 'Next time, I shall not be so lenient!'"
    ],
    "dialogue_disasters": null,
    "goofs": [
        "The Taran Beast looks unconvincing.",
        "Romana's restraints appear easy to escape from.",
        "Reynart's throne is recognizable as Tim's chair from The Goodies.",
        "In episode three, when the Doctor enters the Pavillion of the Summer Winds and shuts the door, it slowly swings open again. A hand then appears from behind the set wall and pulls the door closed."
    ],
    "continuity_notes": [
        {
            "name": "K-9",
            "type": "Character",
            "description": "The Doctor's robotic dog companion",
            "origin": null,
            "current_status": "Programmed with all world chess championships since 1866"
        },
        {
            "name": "TARDIS",
            "type": "Object",
            "description": "The Doctor's time and space machine",
            "origin": "Gallifrey",
            "current_status": "Has a junk cupboard in the console room and an alphabetical wardrobe including Taran fashions"
        },
        {
            "name": "Romana",
            "type": "Character",
            "description": "The Doctor's Time Lord companion",
            "origin": "Gallifrey",
            "current_status": "Unfamiliar with horses, looking for a starter"
        },
        {
            "name": "Key to Time",
            "type": "Object",
            "description": "A powerful artifact the Doctor is seeking",
            "origin": null,
            "current_status": "One segment disguised as a stone dragon, part of a Gracht family statue"
        }
    ],
    "technobabble": [
        "Electrified swords",
        "Crossbows firing energy bolts"
    ],
    "roots": [
        "The Prisoner of Zenda",
        "Star Wars (high-tech swords and crossbows)",
        "Julius Caesar",
        "Richard III (Grendel's ambition)"
    ],
    "links": null,
    "locations": [
        {
            "name": "Tara",
            "type": "Location",
            "description": "A planet with a monarchy and advanced android technology",
            "origin": "Likely an ex-colony of Earth",
            "current_status": "Recovering from a plague that wiped out nine-tenths of the population 200 years ago"
        }
    ],
    "future_history": "The story is set approximately in the 2370s, as Romana mentions the TARDIS has travelled 400 years in time.",
    "untold_adventures": [
        "The Doctor saw Capablanca play Alekhine at chess in 1927 in Buenos Aires",
        "The Doctor met Izaak Walton, author of The Compleat Angler"
    ],
    "qv": null,
    "additional_notes": "Fashion oddities include the Archimandrite's hat, a British general at the coronation, and Lamia's 70s-style boots. There are several double entendres in the dialogue.",
    "bottom_line": "Wonderful, Doctor Who as heroic romance, with plenty of swashbuckling, wit and color. The final duel is particularly praised, with Tom Baker at the height of his powers. The story is noted for its small stakes and charming nature."
}