{
    "title": "The Robots of Death",
    "air_date": "29 January 1977",
    "num_episodes": 4,
    "episode_titles": [
        "Part One",
        "Part Two",
        "Part Three",
        "Part Four"
    ],
    "episode_duration": 25,
    "writers": [
        "Chris Boucher"
    ],
    "directors": [
        "Michael E. Briant"
    ],
    "media_format": "Color",
    "dialogue_triumphs": [
        "You know, you're a classic example of the inverse ratio between the size of the mouth and the size of the brain.",
        "It is a Laserson probe. It can punch a fist-sized hole in six-inch armour plate, or take the crystals from a snowflake one by one.",
        "Please do not throw hands at me."
    ],
    "dialogue_disasters": [
        "Now you're showing off."
    ],
    "goofs": [
        "Tom Baker pronounces 'Terran' like the capital of Iran.",
        "Chub's dying scream is one of the weirdest-sounding in Who history.",
        "When Leela throws her knife at the attacking robot it makes a cartoony 'shhhh-doinkk!' noise.",
        "The corpse markers are bicycle reflectors.",
        "The Doctor's scarf vanishes while he's detained in the crew's quarters.",
        "In the second episode it's possible to tell who the villain is as his feet, lower trousers and (slightly distorted) face are shown.",
        "In episode three you can see a studio cameraman when Toos says: 'There's a strict legal code covering the disposal of robots.'",
        "When Leela bandages Toos's arm someone is visible on the edge of the set.",
        "V35 and V40 are said to have searched the ore hoppers, but V35 spends the entire story in the 'morgue'.",
        "The robot listening outside the crew's quarters was presumably meant to be D84, but it's actually a Voc."
    ],
    "continuity_notes": [
        {
            "name": "TARDIS",
            "type": "Object",
            "description": "The Doctor's time and space machine, with dimensional transcendence.",
            "origin": null,
            "current_status": "The Doctor attempts to explain its nature to Leela."
        },
        {
            "name": "The Doctor",
            "type": "Character",
            "description": "Time Lord protagonist with unique physiology.",
            "origin": "Gallifrey",
            "current_status": "Demonstrating resistance to helium's effects on his voice, mentions of two hearts and respiratory bypass system."
        },
        {
            "name": "Voc-class robots",
            "type": "Object",
            "description": "Advanced robots with over one million circuit constrainers to prevent harming humans.",
            "origin": null,
            "current_status": "Common on Sandminers, less so in cities."
        },
        {
            "name": "Sandminers",
            "type": "Object",
            "description": "Massive vehicles that extract minerals from desert planets.",
            "origin": null,
            "current_status": "Operational, extracting zelanite, keefan, and lucanol."
        },
        {
            "name": "Kaldor City",
            "type": "Location",
            "description": "A city on the unnamed desert planet.",
            "origin": null,
            "current_status": "Mentioned as the only named city."
        },
        {
            "name": "Grimwade's Syndrome",
            "type": "Concept",
            "description": "Irrational fear of robots, also known as robophobia.",
            "origin": null,
            "current_status": "Recognized psychological condition in this society."
        },
        {
            "name": "The Twenty",
            "type": "Organization",
            "description": "The founding families of the civilization on the desert planet.",
            "origin": null,
            "current_status": "Their descendants are highly respected."
        }
    ],
    "technobabble": [
        "Laserson probe",
        "Zelanite",
        "Keefan",
        "Lucanol"
    ],
    "roots": [
        "Isaac Asimov's I, Robot",
        "Frank Herbert's Dune",
        "Arthur C. Clarke's A Fall of Moondust",
        "Murder on the Orient Express",
        "And Then There Were None",
        "The Naked Sun",
        "Superman comics",
        "Desmond Morris's Manwatching"
    ],
    "links": [
        "The story seems to follow on almost directly from 'The Face of Evil', Leela having a Tesh gun."
    ],
    "locations": [
        {
            "name": "Storm Mine 4",
            "type": "Location",
            "description": "A Sandminer vehicle where the story takes place.",
            "origin": "Unnamed desert planet",
            "current_status": "Operational, site of the main action."
        }
    ],
    "future_history": null,
    "untold_adventures": [
        "The Doctor claims to have seen similar 'moving mines' on Korlano Beta."
    ],
    "qv": [
        "The Doctor's Age, 'Pyramids of Mars'"
    ],
    "additional_notes": "Poul's name is derived from SF author Poul Anderson. Taren Capel comes from Karel Capek, whose play R.U.R. introduced the word 'robot'.",
    "bottom_line": "The script is one of the best ever: a tightly constructed, claustrophobic SF thriller, with moments of great psychological insight. Even Chris Boucher, though, must have been delighted when he saw the finished product, a rare case of something being enhanced by clever, opulent design. The art deco robots are all the more frightening for being beautiful and well-spoken. The actors put in flawless performances, and the direction is superb."
}