{
    "title": "The Ark in Space",
    "air_date": "25 January 1975",
    "num_episodes": 4,
    "episode_titles": [
        "Part One",
        "Part Two",
        "Part Three",
        "Part Four"
    ],
    "episode_duration": 25,
    "writers": [
        "Robert Holmes",
        "John Lucarotti (uncredited plot)"
    ],
    "directors": [
        "Rodney Bennett"
    ],
    "media_format": "Color",
    "dialogue_triumphs": [
        "Homo sapiens. What an inventive, invincible species. It's only a few million years since they crawled up out of the mud and learned to walk. Puny, defenceless bipeds. They've survived flood, famine and plague. They've survived cosmic wars and holocausts. And now, here they are, out among the stars, waiting to begin a new life. Ready to outsit eternity. They're indomitable."
    ],
    "dialogue_disasters": [
        "Harry: 'Fancy a member of the fair sex being top of the totem pole'",
        "Harry: 'Independent sort of bird, isn't she?'",
        "Noah: 'Your resistance is useless!'"
    ],
    "goofs": [
        "Humanity in the future is divided into functional groups, like insects, but Rogin wakes up as a fully-fledged Holmes wide-boy.",
        "The slime trail which the Doctor and Harry chance upon is clearly visible to the audience from the start of the scene.",
        "One of the frozen humans can be seen blinking.",
        "Sarah's knickers are visible in episode one.",
        "Can all of the Wirrn really fit into that small cockpit?",
        "Why doesn't the Doctor want to wake everybody up and take them to Earth in the TARDIS?",
        "Why are there only three transmat pads when there are thousands of people on Nerva?",
        "Why doesn't the Doctor go down in the TARDIS, as the transmat is faulty (and possibly dangerous)?"
    ],
    "continuity_notes": [
        {
            "name": "The Doctor",
            "type": "Character",
            "description": "Time Lord protagonist, currently in his Fourth incarnation",
            "origin": "Gallifrey",
            "current_status": "Exploring space station Nerva with companions"
        },
        {
            "name": "Madame Nostradamus",
            "type": "Character",
            "description": "Historical figure mentioned as having knitted the Doctor's scarf",
            "origin": null,
            "current_status": null
        },
        {
            "name": "Cricket ball",
            "type": "Object",
            "description": "Item carried by the Doctor",
            "origin": null,
            "current_status": "In the Doctor's possession"
        },
        {
            "name": "Harry Sullivan",
            "type": "Character",
            "description": "One of the Doctor's companions, a medical doctor",
            "origin": "Earth",
            "current_status": "Accompanying the Doctor on Nerva"
        },
        {
            "name": "Sarah Jane Smith",
            "type": "Character",
            "description": "One of the Doctor's companions, a journalist",
            "origin": "Earth",
            "current_status": "Accompanying the Doctor on Nerva"
        },
        {
            "name": "TARDIS",
            "type": "Object",
            "description": "The Doctor's time and space machine",
            "origin": "Gallifrey",
            "current_status": "Present on Nerva"
        },
        {
            "name": "Wirrn",
            "type": "Character",
            "description": "Insectoid alien species, antagonists of the story",
            "origin": "Andromeda galaxy",
            "current_status": "Attempting to take over Nerva and its inhabitants"
        }
    ],
    "technobabble": [
        "Bennett Oscillator"
    ],
    "roots": [
        "The Quatermass Experiment",
        "Quatermass and the Pit",
        "Genesis",
        "Dr Strangelove",
        "It! The Terror from Beyond Space",
        "The Fly",
        "Voyage of the Space Beagle"
    ],
    "links": [
        "The Moonbase"
    ],
    "locations": [
        {
            "name": "Space station Nerva",
            "type": "Location",
            "description": "Space station in Earth orbit, used as an ark for humanity",
            "origin": "Earth orbit",
            "current_status": "Active, housing cryogenically frozen humans"
        }
    ],
    "future_history": "Nerva was built in the late 29th or early 30th century under a female High Minister, this story being set many thousand years later when it is being used to escape the solar flares that decimated Earth. Rogin refers to trade unions in a reference to demarcation disputes.",
    "untold_adventures": null,
    "qv": [
        "The Doctor's Doctorate"
    ],
    "additional_notes": "The entire population of Earth are wearing flares. (No wonder there's all that panic about 'stacks' and 'flares'.)",
    "bottom_line": "Robert Holmes' most optimistic script, where he defends humanity (the instinctive Rogin) against insect-like conformity. 'The Ark in Space' rises above the dodginess of the effects by treating its themes so seriously that it's a possible influence on Alien. Philip Hinchcliffe's new style is vastly different to Barry Letts', summed up by the alien way that Noah holds up what, in other circumstances, would obviously be a plastic glove over his hand."
}