{
    "title": "The Hand of Fear",
    "air_date": "2 October 1976",
    "num_episodes": 4,
    "episode_titles": [
        "Part One",
        "Part Two",
        "Part Three",
        "Part Four"
    ],
    "episode_duration": 25,
    "writers": [
        "Bob Baker",
        "Dave Martin"
    ],
    "directors": [
        "Lennie Mayne"
    ],
    "media_format": "Color",
    "dialogue_triumphs": [
        "'So now you are king, as was your wish. I salute you from the dead. Hail Eldrad, King of Nothing!'"
    ],
    "dialogue_disasters": [
        "'You reckon this fella just copped it in a crash, like?'",
        "Sarah's line: 'That's not as 'armless as it looks.'"
    ],
    "goofs": [
        "The Doctor and Sarah seem unable to comprehend clear signs of danger in the first episode (sirens, man waving, etc.).",
        "The fly that Elisabeth Sladen swallowed in an out-take can be seen walking across Glyn Houston's brow.",
        "There's lots of bad nuclear physics on show, including the air strike against the complex and hiding behind a jeep from an exploding reactor."
    ],
    "continuity_notes": [
        {
            "name": "Kastria",
            "type": "Location",
            "description": "A cold and inhospitable planet, ravaged by solar winds. Eldrad built barriers to protect it and machines to replenish the soil and atmosphere.",
            "origin": null,
            "current_status": "Destroyed and uninhabited"
        },
        {
            "name": "Eldrad",
            "type": "Character",
            "description": "A Kastrian who created silicon-based life forms for his people and was sentenced to death for attempting to lead them into galactic war.",
            "origin": "Kastria",
            "current_status": "Reconstituted and seeking to rule Kastria"
        },
        {
            "name": "Time Lords",
            "type": "Organization",
            "description": "A powerful race pledged to uphold the laws of time and prevent alien aggression, but only in cases where indigenous populations are threatened.",
            "origin": "Gallifrey",
            "current_status": "Active, but with limited intervention policies"
        },
        {
            "name": "TARDIS Temporal Grace",
            "type": "Concept",
            "description": "A supposed feature of the TARDIS that prevents weapons from functioning within it, linked to its dimensional transcendence.",
            "origin": "Time Lord technology",
            "current_status": "Questionable, as later stories contradict its effectiveness"
        }
    ],
    "technobabble": [
        "If the coordinates for Kastria are mis-set the Doctor says that symbolic resonance will occur in the trachoid time crystal, and that no further landings will be possible.",
        "The extreme cold of Kastria might have affected the TARDIS's thermocouplings, which the Doctor tries to repair with an astro rectifier, a multi-quantiscope and a Ganymede driver.",
        "The Doctor decides that he doesn't need the mergin nut or the Zeus plugs."
    ],
    "roots": [
        "The Beast with Five Fingers",
        "The Mummy's Hand",
        "Carry on Screaming (?!)",
        "Dr Terror's House of Horrors",
        "Blood from the Mummy's Tomb",
        "The obliteration module echoes the Martians' craft in George Pal's version of War of the Worlds"
    ],
    "links": [
        "When the Doctor hypnotises Sarah she says, 'That's not fair. Not agai-' in reference to 'Terror of the Zygons' and/or 'The Masque of Mandragora'.",
        "Sarah says that she will pass on the Doctor's love to Harry and the Brigadier."
    ],
    "locations": [
        {
            "name": "Outer Dome Six",
            "type": "Location",
            "description": "A location on the planet Kastria",
            "origin": "Kastria",
            "current_status": "Abandoned"
        },
        {
            "name": "Nunton experimental nuclear complex",
            "type": "Location",
            "description": "A nuclear facility on Earth where part of the story takes place",
            "origin": "Earth",
            "current_status": "Active during the story"
        }
    ],
    "future_history": null,
    "untold_adventures": null,
    "qv": [
        "The Doctor's Doctorate",
        "'The Moonbase'"
    ],
    "additional_notes": "Sarah whistles 'Daddy Wouldn't Buy Me a Bow-Wow' at the end. Sarah's clothes make her look 'just like Andy Pandy'. The Doctor carries an expanding cane in his pocket. Sarah seems to live in Hillview Road, South Croydon.",
    "bottom_line": "Underrated by sad people who think that even Philip Hinchcliffe must have produced one duff story per season, 'The Hand of Fear' is engaging and well-acted. Lis Sladen puts in her best performance (she makes a great villain), but Judith Paris steals the show as (the female) Eldrad. It all goes a bit pear-shaped in the final episode, with Stephen Thorne doing his best Brian Blessed impersonation and Eldrad eventually tripping over the Doctor's scarf."
}