{
    "title": "The Power of Kroll",
    "air_date": "23 December 1978",
    "num_episodes": 4,
    "episode_titles": [
        "Part One",
        "Part Two",
        "Part Three",
        "Part Four"
    ],
    "episode_duration": 25,
    "writers": [
        "Robert Holmes"
    ],
    "directors": [
        "Norman Stewart"
    ],
    "media_format": "Color",
    "dialogue_triumphs": [],
    "dialogue_disasters": [
        "Ranquin to the Doctor: 'Your mind is bent.'",
        "Ranquin's threat to Romana: 'You will wish you had died on the Stone of Blood.'",
        "The first line of episode three: 'It hasn't moved for 15 minutes.'"
    ],
    "goofs": [
        "Neil McCarthy fumbles 'Swampies' problems' in episode three.",
        "Glyn Owen's delivery is very laid back, and Tom Baker's replies usually bear little relation to Mary Tamm's cues.",
        "'Constellation' is once again used to mean 'solar system'.",
        "The Doctor's reed flute playing doesn't match the music.",
        "The Swampies' history book has an inlaid leather cover, which seems too advanced for their primitive society.",
        "The wall of the rocket silo wobbles at the tap of a hammer.",
        "Rain pouring through a broken window doesn't make the characters wet.",
        "The Doctor's galoshes appear and disappear throughout the story.",
        "The Doctor casually drops a cup of drink into his pocket."
    ],
    "continuity_notes": [
        {
            "name": "Key to Time",
            "type": "Object",
            "description": "A powerful artifact split into six segments. The fifth segment allows one to see the future according to Swampie lore.",
            "origin": null,
            "current_status": "The fifth segment is currently part of Kroll, having been swallowed and causing its mutation and growth."
        },
        {
            "name": "The Doctor",
            "type": "Character",
            "description": "Time Lord protagonist, currently in his fourth incarnation.",
            "origin": "Gallifrey",
            "current_status": "Searching for the segments of the Key to Time. Demonstrates various abilities and quirks throughout the story."
        },
        {
            "name": "Kroll",
            "type": "Character",
            "description": "A giant squid that has mutated and grown to 200 feet after swallowing the fifth segment of the Key to Time.",
            "origin": "Third moon of Delta Magna",
            "current_status": "Worshipped as a god by the Swampies, posing a threat to the refinery and its inhabitants."
        }
    ],
    "technobabble": [
        "The Doctor knows a lot about refinery technology."
    ],
    "roots": [
        "King Kong",
        "North American aboriginals",
        "Irish nationalism ('The sons of Erin')"
    ],
    "links": [
        "Marco Polo",
        "Terror of the Zygons",
        "The Caves of Androzani",
        "The Creature from the Pit",
        "Pyramids of Mars"
    ],
    "locations": [
        {
            "name": "Third moon of Delta Magna",
            "type": "Location",
            "description": "A moon settled centuries ago by natives of Delta Magna who had been evicted from the Earth colony.",
            "origin": null,
            "current_status": "Has a thin atmosphere and tiny gravity, though neither is evident in the story. Home to the Swampies and site of a refinery operation."
        }
    ],
    "future_history": "Earth colonies are described as 'all so insular' by the Doctor. The Sons of Earth movement believes all life originated on Earth and wants to return humanity there, though Earth is in a bad state and unfit for settlement. Humanity would 'starve' there according to Rohm Dutt.",
    "untold_adventures": [
        "The Doctor implies that he has met opera singer Dame Nellie Melba (1861-1931)."
    ],
    "qv": [
        "The Doctor's Age, 'Pyramids of Mars'"
    ],
    "additional_notes": "Fashion Victims: The Swampies are actors painted green, with green dreadlocks, forced to wander about East Anglia in bare feet.",
    "bottom_line": "The plot is very slow and resembles 'The Caves of Androzani'. It lacks the usual humor of the era and is poorly acted, with the exceptions of Philip Madoc and John Abineri. The unconvincing portrayal of Kroll, especially its tentacles, is a major weakness. However, Ranquin praying to a limp tentacle in a pipe achieves a kind of kitsch grandeur."
}