{
    "title": "The Ribos Operation",
    "air_date": "2 September 1978",
    "num_episodes": 4,
    "episode_titles": [
        "Part One",
        "Part Two",
        "Part Three",
        "Part Four"
    ],
    "episode_duration": 25,
    "writers": [
        "Robert Holmes"
    ],
    "directors": [
        "George Spenton-Foster"
    ],
    "media_format": "Color",
    "dialogue_triumphs": [
        "Unstoffe on 'scringe stone': 'You hangs a bit of that around your neck and you won't never suffer from the scringes no matter 'ow cold it be!'",
        "What will happen to the Doctor if he refuses the mission? 'Nothing… Ever.'"
    ],
    "dialogue_disasters": null,
    "goofs": [
        "How can the coordinates of the segment change while the TARDIS is in the vortex (i.e. outside space and time)?",
        "Why do the trained soldiers stop when the Doctor tells them rather than obey the Graff's orders?",
        "How can the Doctor walk out of the catacombs after they have been sealed?"
    ],
    "continuity_notes": [
        {
            "name": "Key to Time",
            "type": "Object",
            "description": "A perfect cube which maintains the equilibrium of time itself. When assembled from six scattered segments, it creates a power too dangerous for any one being to possess.",
            "origin": null,
            "current_status": "Scattered and hidden across the universe"
        },
        {
            "name": "White Guardian",
            "type": "Character",
            "description": "A higher Eternal being of immense power, tasked with maintaining the balance of the universe.",
            "origin": null,
            "current_status": "Has chosen the Doctor to reassemble the Key to Time"
        },
        {
            "name": "Black Guardian",
            "type": "Character",
            "description": "The counterpart to the White Guardian, representing darkness and chaos.",
            "origin": null,
            "current_status": "Mentioned as a warning to the Doctor"
        },
        {
            "name": "Romanadvoratreludar",
            "type": "Character",
            "description": "The Doctor's new assistant, a Time Lord who recently graduated from the Academy with a 'Triple-first'.",
            "origin": "Gallifrey",
            "current_status": "Assigned to assist the Doctor in his mission"
        },
        {
            "name": "K-9",
            "type": "Character",
            "description": "The Doctor's robotic dog companion",
            "origin": null,
            "current_status": "Traveling with the Doctor"
        }
    ],
    "technobabble": [
        "Jethryk is a valuable rare element without which space warp 'would be impossible'."
    ],
    "roots": [
        "Cymbeline (lodging the loot in a safe place overnight)",
        "Eisenstein's Ivan the Terrible (design)",
        "Ursula Le Guin's The Left Hand of Darkness",
        "Galileo's persecution by the Catholic Church (Binro)",
        "The Italian Job",
        "Star Trek's Harry Mudd"
    ],
    "links": [
        "The Doctor says of the Lord President, 'I should have thrown him to the Sontarans when I had the chance' [it seems that someone we met in 'The Invasion of Time' has assumed the presidency]."
    ],
    "locations": [
        {
            "name": "Ribos",
            "type": "Location",
            "description": "A planet in the constellation of Skytha, with two 32-year long seasons called 'Sun Time' and 'Ice Time'.",
            "origin": null,
            "current_status": "Main setting of the episode"
        },
        {
            "name": "Cyrrhenis Minima",
            "type": "Location",
            "description": "A planet with space coordinates 4180, located 116 parsecs from Ribos.",
            "origin": null,
            "current_status": null
        }
    ],
    "future_history": "The episode is set in the future, but no specific time period is mentioned.",
    "untold_adventures": [
        "The Doctor says he was trained in sleight-of-hand by Mescalin."
    ],
    "qv": [
        "Constellations, 'Mission to the Unknown'",
        "The Doctor's Age, 'Pyramids of Mars'"
    ],
    "additional_notes": "The episode introduces the concept of the Key to Time, which becomes the overarching plot for the entire season.",
    "bottom_line": "A lovely story, 'The Ribos Operation' features another great Robert Holmes double-act (Garron and Unstoffe) and some amusing tension between the Doctor and his new assistant."
}