{
    "title": "The Creature from the Pit",
    "air_date": "27 October 1979",
    "num_episodes": 4,
    "episode_titles": [
        "Part One",
        "Part Two",
        "Part Three",
        "Part Four"
    ],
    "episode_duration": 25,
    "writers": [
        "David Fisher"
    ],
    "directors": [
        "Christopher Barry"
    ],
    "media_format": "Color",
    "dialogue_triumphs": [
        "Organon introduces himself: 'Astrologer extraordinary. Seer to princes and emperors. The future foretold, the past explained, the present… apologised for.'"
    ],
    "dialogue_disasters": [
        "Doctor: 'Why do you call it the Place of Death?' Karela: 'Because anyone found here is automatically condemned to death.'"
    ],
    "goofs": [
        "Torvin, stunned by K-9, turns before falling, as if looking for somewhere comfortable to land.",
        "The guard who goes to attack K-9 and Romana doesn't fare much better, as he stops and curls up before K-9's blast hits him.",
        "The Doctor doesn't need a book on Tibetan as he already knows the language ('Planet of the Spiders')."
    ],
    "continuity_notes": [
        {
            "name": "TARDIS",
            "type": "Object",
            "description": "The Doctor's time and space machine",
            "origin": "Gallifrey",
            "current_status": "Functional, with various items stored inside including a ball of string, jaw bone of an ass, and Mark III Emergency Transceiver"
        },
        {
            "name": "K-9",
            "type": "Character",
            "description": "The Doctor's robotic dog companion",
            "origin": "Year 5000",
            "current_status": "Active, reading Peter Rabbit with the Doctor"
        },
        {
            "name": "The Doctor",
            "type": "Character",
            "description": "Time Lord protagonist",
            "origin": "Gallifrey",
            "current_status": "Exploring Chloris, claims to have 90 lives (facetiously)"
        },
        {
            "name": "Romana",
            "type": "Character",
            "description": "Time Lady companion of the Doctor",
            "origin": "Gallifrey",
            "current_status": "Traveling with the Doctor, familiar with Beatrix Potter's works"
        },
        {
            "name": "Erato",
            "type": "Character",
            "description": "Ambassador from the planet Tythonus",
            "origin": "Tythonus",
            "current_status": "Trapped in the Pit for 15 years, starved"
        }
    ],
    "technobabble": [
        "All the stuff about Erato spinning aluminium shells around neutron stars (which would increase its gravity)"
    ],
    "roots": [
        "Snow White and the Seven Dwarfs",
        "Star Trek ('The Devil in the Dark')"
    ],
    "links": [
        "The Horns of Nimon",
        "Planet of the Spiders",
        "The Power of Kroll"
    ],
    "locations": [
        {
            "name": "Chloris",
            "type": "Location",
            "description": "Primitive planet rich in plant life but with little metal",
            "origin": null,
            "current_status": "Under partial rule of Lady Adrasta, who has a monopoly on metal"
        },
        {
            "name": "Tythonus",
            "type": "Location",
            "description": "Advanced world rich in metal but rapidly depleting its vegetation",
            "origin": null,
            "current_status": "Home planet of the Tythonians, including Erato"
        }
    ],
    "future_history": null,
    "untold_adventures": [
        "The Doctor helping Theseus and Ariadne out of the Minotaur's maze",
        "An adventure where the TARDIS tractor beam was used 12 years ago"
    ],
    "qv": [
        "Season 6(b), 'The War Games'",
        "The Doctor's Age, 'Pyramids of Mars'"
    ],
    "additional_notes": "The story features double entendres related to the creature and the Doctor's oral communication with it. Tythonians measure time in ninods, with 26 ninods equal to one hour and seven minutes. The Doctor's lucky number is 74,384,338.",
    "bottom_line": "Appreciation of this story depends on what you think of Douglas Adams-esque humour in Doctor Who. It has been claimed by 'Creature from the Pit' apologists that the story is a conscious spoof of bad science fiction. On the other hand, it could just be bad science fiction."
}