{
    "title": "The Sun Makers",
    "air_date": "26 November 1977",
    "num_episodes": 4,
    "episode_titles": [
        "Part One",
        "Part Two",
        "Part Three",
        "Part Four"
    ],
    "episode_duration": 25,
    "writers": [
        "Robert Holmes"
    ],
    "directors": [
        "Pennant Roberts"
    ],
    "media_format": "Color",
    "dialogue_triumphs": [
        "The Collector anticipating Leela's execution: 'This is the moment when I get a real feeling of job satisfaction!'"
    ],
    "dialogue_disasters": null,
    "goofs": [
        "When the Gatherer is to be thrown off the roof by an angry mob, his exclamation and facial expression suggest someone who's watched too many Kenneth Williams films.",
        "The Collector's computer makes various silly 'Boing!' noises.",
        "You can see car park insignia on the roof-top."
    ],
    "continuity_notes": [
        {
            "name": "The Company",
            "type": "Organization",
            "description": "A powerful corporation based on the planet Usurius, known for exploiting human populations across the solar system.",
            "origin": "Usurius",
            "current_status": "Controlling Pluto and its human inhabitants through economic exploitation and chemical suppression."
        },
        {
            "name": "Sonic Screwdriver",
            "type": "Object",
            "description": "The Doctor's multi-purpose tool, capable of various functions including opening locks.",
            "origin": null,
            "current_status": "Used to open the Company safe."
        },
        {
            "name": "Usurians",
            "type": "Character",
            "description": "Alien species listed as poisonous fungi in Professor Thripsted's Flora and Fauna of the Universe.",
            "origin": "Usurius",
            "current_status": "Controlling the Company and exploiting humans on Pluto."
        },
        {
            "name": "Gallifrey",
            "type": "Location",
            "description": "The Doctor's home planet.",
            "origin": null,
            "current_status": "The Usurians have a file on Gallifrey, suggesting knowledge of Time Lords."
        }
    ],
    "technobabble": [
        "Dianane: a deadly poison gas (to which Usurians are immune)",
        "Balarium: a muscle neutraliser, which also affects speech",
        "Pentocyleinicmethylhydrane (PCM): an anxiety-inducing agent"
    ],
    "roots": [
        "'The Space Merchants'",
        "Cartier's 1984",
        "Brave New World",
        "The Iron Sun",
        "Robin Hood",
        "Isaac Asimov's 'Nightfall'",
        "Metropolis",
        "Das Kapital",
        "Spassky vs Fisher chess game of 1972",
        "BBC TV logo"
    ],
    "links": null,
    "locations": [
        {
            "name": "Megropolis 3",
            "type": "Location",
            "description": "One of six megacities on Pluto, controlled by the Company.",
            "origin": "Pluto",
            "current_status": "Active city with oppressed population, including miners known as Ajacks."
        },
        {
            "name": "Pluto",
            "type": "Location",
            "description": "Outermost planet in the solar system, terraformed and colonized by humans under the Company's control.",
            "origin": "Solar System",
            "current_status": "Inhabited by humans, controlled by the Company, with six megacities and fusion satellites."
        },
        {
            "name": "Mars",
            "type": "Location",
            "description": "Planet previously inhabited by humans after Earth's resources were depleted.",
            "origin": "Solar System",
            "current_status": "Abandoned after resources were exhausted."
        },
        {
            "name": "Earth",
            "type": "Location",
            "description": "Original home of humanity, abandoned due to resource depletion.",
            "origin": "Solar System",
            "current_status": "Abandoned, but potentially regenerating for future human recolonization."
        }
    ],
    "future_history": "The Company came to Earth when its natural resources were almost gone and shifted the population to Mars, after their technicians made it habitable. Once Mars too had been exhausted the operation moved to Pluto, missing out the four intervening planets which the Collector describes as being 'not economically viable'. Pluto was believed to be the outermost body in the solar system until the discovery of Cassius. Pluto has six megropolises (each with its own in-station fusion satellite). The miners in Megropolis 3 are known as Ajacks. School is called Preparation Centre and money units are talmars. PCM is pumped into the air to keep the population subservient.",
    "untold_adventures": [
        "The Doctor says the Droge of Gabrielides offered a whole star system for his head.",
        "The Company holds records on the Doctor's activities: he has a long history of 'violence and economic subversion'."
    ],
    "qv": null,
    "additional_notes": "The Doctor misquotes Das Kapital ('What've we got to lose?' 'Only your claims!'). The Doctor and K-9's chess game derives from Spassky vs Fisher in 1972.",
    "bottom_line": "A clever script is balanced by a straightforward plot, although the subtlety of some of the jokes will be lost on a younger audience. The Doctor's political asides ('Probably too many economists in the government!') have improved with age, however."
}