{
    "title": "The Stones of Blood",
    "air_date": "28 October 1978",
    "num_episodes": 4,
    "episode_titles": [
        "Part One",
        "Part Two",
        "Part Three",
        "Part Four"
    ],
    "episode_duration": 25,
    "writers": [
        "David Fisher"
    ],
    "directors": [
        "Darrol Blake"
    ],
    "media_format": "Color",
    "dialogue_triumphs": [
        "Romana: 'What's it say?' Doctor: 'I don't know, I can't read the script.'"
    ],
    "dialogue_disasters": null,
    "goofs": [
        "How does de Vries control the ravens, and what is their function?",
        "At the start of the story there are three Ogri. One falls off a cliff, but later there are still three.",
        "If Cessair has escaped from the prison ship, why does she stay on Earth? What's her plan?"
    ],
    "continuity_notes": [
        {
            "name": "White Guardian",
            "type": "Character",
            "description": "Powerful being who sent the Doctor and Romana on their mission, rather than the President of the Time Lords.",
            "origin": null,
            "current_status": "Guiding the Doctor's quest"
        },
        {
            "name": "Third Segment of the Key to Time",
            "type": "Object",
            "description": "A powerful artifact with abilities of transmutation, transformation, and establishing hyperspacial and temporal coordinates.",
            "origin": null,
            "current_status": "Sought by the Doctor and Romana"
        },
        {
            "name": "Cessair of Diplos",
            "type": "Character",
            "description": "Criminal from Diplos who evaded justice and has been living on Earth for 4000 years, adopting different guises.",
            "origin": "Diplos",
            "current_status": "Hiding on Earth, controlling the stone circle"
        },
        {
            "name": "Ogri",
            "type": "Character",
            "description": "Silicon-based life-forms from the planet Ogros, deficient in globulin.",
            "origin": "Ogros",
            "current_status": "Aiding Cessair on Earth"
        },
        {
            "name": "Megara",
            "type": "Character",
            "description": "Justice machines that pursued Cessair of Diplos.",
            "origin": null,
            "current_status": "Seeking to bring Cessair to justice"
        }
    ],
    "technobabble": [
        "Type 40 TARDISes are fitted with molecular stabilisers: after an attack by an Ogri K-9's circuits are regenerated by connecting this stabiliser to his circuit frequency modulator.",
        "Mending the hyperspace 'gun', amongst other things, involves linking the alpha circuit to the sine interphase."
    ],
    "roots": [
        "Arthurian myths",
        "Ravens (Ovid onwards)",
        "The Hound of the Baskervilles (missing portrait)",
        "Celtic/British mythology (Gog and Magog)",
        "Einstein's special theory of relativity",
        "Brief mentions of Tacitus and John Aubrey",
        "Oblique reference to Polonius in Hamlet"
    ],
    "links": [
        "There seems to be a Wirrn ('The Ark in Space') and a (weird) Kraal android skeleton ('The Android Invasion') in the ship in hyperspace."
    ],
    "locations": [
        {
            "name": "The Nine Travellers",
            "type": "Location",
            "description": "A stone circle on Boscombe Moor, near Boscawen, Damnonium (Cornwall)",
            "origin": "Earth",
            "current_status": "Site of main story events"
        },
        {
            "name": "Diplos",
            "type": "Location",
            "description": "A G-class planet in the Tau Ceti system, home of Cessair",
            "origin": "Tau Ceti system",
            "current_status": null
        },
        {
            "name": "Ogros",
            "type": "Location",
            "description": "Planet covered with amino acid swamps, home of the Ogri",
            "origin": "Tau Ceti system",
            "current_status": null
        }
    ],
    "future_history": null,
    "untold_adventures": [
        "The Doctor has met Einstein."
    ],
    "qv": null,
    "additional_notes": "Cessair is allergic to citric acid. The Doctor mentions a Galactic Federation that appointed a justice machine, which, finding the Federation to be in contempt of court, blew up the entire galaxy.",
    "bottom_line": "The first two episodes are delightfully Hammeresque, but the last half of the story, largely centred on the ship in hyperspace and the Doctor's defence of himself against the Megara, is woeful. There's a weird robot-thing with eyelashes and red lips stuck next to Romana in her cell, and the Doctor just so happens to carry a barrister's wig with him. Ultimately the story disappoints as whole acres of motivation and background are glossed over."
}