{
    "title": "The Brain of Morbius",
    "air_date": "3 January 1976",
    "num_episodes": 4,
    "episode_titles": [
        "Part One",
        "Part Two",
        "Part Three",
        "Part Four"
    ],
    "episode_duration": 25,
    "writers": [
        "Robin Bland (a pseudonym for Terrance Dicks, Robert Holmes)"
    ],
    "directors": [
        "Christopher Barry"
    ],
    "media_format": "Color",
    "dialogue_triumphs": [
        "'I am still here. I can see nothing, feel nothing. You have locked me into hell for an eternity… Trapped like this, like a sponge beneath the sea. Yet even a sponge has more life than I. Can you understand a thousandth of my agony? I, Morbius, who once led the High Council of the Time Lords, reduced to this – to the condition where I envy a vegetable.'",
        "The Doctor on the elixir: 'The impossible dream of a thousand alchemists, dripping like tea from an urn.'"
    ],
    "dialogue_disasters": null,
    "goofs": [
        "Morbius's globe-head falls apart when he tumbles over the cliff edge, and the camera bounces.",
        "Why doesn't Solon just put the brain into the Doctor's head?"
    ],
    "continuity_notes": [
        {
            "name": "The Doctor",
            "type": "Character",
            "description": "The protagonist Time Lord, born on Gallifrey within a few billion miles of Karn.",
            "origin": "Gallifrey",
            "current_status": "Investigating events on Karn"
        },
        {
            "name": "Morbius",
            "type": "Character",
            "description": "Former leader of the High Council of Time Lords, now reduced to a disembodied brain.",
            "origin": "Gallifrey",
            "current_status": "Seeking a new body"
        },
        {
            "name": "The Sisterhood",
            "type": "Organization",
            "description": "Guardians of the Sacred Flame or Flame of Life on Karn, equal to Time Lords in mental prowess.",
            "origin": "Karn",
            "current_status": "Protecting the elixir of life"
        },
        {
            "name": "Elixir of Life",
            "type": "Object",
            "description": "A substance produced by the Sacred Flame on Karn, capable of granting eternal life.",
            "origin": "Karn",
            "current_status": "Guarded by the Sisterhood"
        },
        {
            "name": "TARDIS",
            "type": "Object",
            "description": "The Doctor's time and space travel machine, currently experiencing calibration issues.",
            "origin": "Gallifrey",
            "current_status": "Malfunctioning"
        }
    ],
    "technobabble": [
        "The TARDIS calibrators are on the blink.",
        "Solon specialises in microsurgical techniques in tissue transplants."
    ],
    "roots": [
        "Frankenstein films",
        "The Hunchback of Notre Dame",
        "Terrance Dicks's Seven Keys to Doomsday",
        "H. Rider Haggard's She",
        "The Island of Dr Moreau",
        "Donovan's Brain",
        "They Saved Hitler's Brain",
        "The Old Dark House",
        "The Rocky Horror Picture Show",
        "Forbidden Planet"
    ],
    "links": [
        "Sarah thinks the Doctor is asking her to crawl through the ventilation system in episode four (as in 'The Ark in Space')."
    ],
    "locations": [
        {
            "name": "Karn",
            "type": "Location",
            "description": "A planet in a solar system with five planets, home to the Sisterhood and the Sacred Flame.",
            "origin": null,
            "current_status": "Site of the story's events, far in the future"
        }
    ],
    "future_history": "Karn's civilization, along with many others, was destroyed by Morbius in his quest for the elixir of life.",
    "untold_adventures": [
        "The Doctor's involvement in or knowledge of Morbius's capture and trial"
    ],
    "qv": [
        "The Location of Gallifrey, 'Terror of the Autons'",
        "The Doctor's Age, 'Pyramids of Mars'"
    ],
    "additional_notes": "The episode features a controversial scene showing faces that might indicate the Doctor had more than three previous bodies, contradicting other stories.",
    "bottom_line": "A superb exploration of gothic themes. Philip Madoc's portrayal of Solon is crucial to the story's success, and the pseudonymous epithet 'bland' is not at all deserved."
}