{
  "metadata": {
    "title": "Arc of Infinity",
    "series": "Doctor Who",
    "season": "20",
    "episode_number": 1,
    "release_date": "1983-01-03",
    "writer": "Johnny Byrne",
    "director": "Ron Jones",
    "producer": "John Nathan-Turner",
    "main_actors": [
      "Peter Davison",
      "Janet Fielding",
      "Sarah Sutton"
    ],
    "time_reference": "January 1983"
  },
  "cast_crew": [
    {
      "cast": {
        "name": "Peter Davison",
        "role": "The Doctor"
      },
      "crew": {
        "name": "Ron Jones",
        "role": "Director"
      }
    },
    {
      "cast": {
        "name": "Janet Fielding",
        "role": "Tegan"
      },
      "crew": {
        "name": "John Nathan-Turner",
        "role": "Producer"
      }
    },
    {
      "cast": {
        "name": "Sarah Sutton",
        "role": "Nyssa"
      },
      "crew": {
        "name": "Johnny Byrne",
        "role": "Writer"
      }
    }
  ],
  "home_media": [
    {
      "releases": {
        "media_type": "DVD",
        "date": "2007-08-06",
        "special_features": [
          "Commentary by Peter Davison, Janet Fielding, Sarah Sutton and Colin Baker",
          "Anti-Matter from Amsterdam - Presented by Sophie Aldred",
          "The Omega Factor - Writers and actors look at the character and motivation of the renegade Time Lord, Omega",
          "Deleted Scenes",
          "Under Arc Lights - Behind-the-scenes action from the studio recording sessions",
          "CGI Effects",
          "Continuities - Original BBC1 continuity announcements for the story",
          "Photo Gallery",
          "Isolated Music",
          "Radio Times Billings (PDF DVD-ROM)",
          "1983 Doctor Who annual (PDF DVD-ROM)",
          "Production Subtitles",
          "Coming Soon Trailer"
        ]
      }
    }
  ],
  "story_notes": [
    {
      "notes": [
        "The story had the working titles of The Time of Neman and The Time of Omega.",
        "Peter Davison also played Omega in part four when Omega's body becomes a replica of the Doctor's, but was credited on-screen only as \"The Doctor\".",
        "To keep the return of Omega a surprise, Ian Collier was billed in the end credits as \"The Renegade\" for parts one and two, with the billing becoming \"Omega\" for parts three and four.",
        "The original storyline involved the Doctor suffering nightmares about his regeneration, which were actually a precursor to the arrival of an entity called the Avatar, who takes on the Doctor's form and goes to Amsterdam.",
        "Colin Baker was originally considered for the role of the Castellan.",
        "Eric Saward thought it was contrived that Tegan was brought back, while Peter Davison thought it was a \"ludicrous coincidence\".",
        "The Ergon was envisaged as an assemblage of bones, inspired by the eponymous creature in Alien, but the effect did not come off as intended.",
        "Part of the decision to film in Amsterdam was that the BBC had recently shot Triangle there.",
        "New regular costumes for Nyssa and Tegan are seen for the first time in this story."
      ]
    }
  ],
  "worldbuilding": {
    "in_universe_mythology": [
      "Omega, an ancient Time Lord made of pure anti-matter, once defeated by the Doctor"
    ],
    "real_world_cultural_references": [
      "Frankenstein",
      "The Bride of Frankenstein"
    ],
    "individuals": [
      "Tegan",
      "Jerricho",
      "Maxil",
      "Borusa"
    ],
    "items": [
      "Arc of Infinity",
      "Ergon",
      "Matter converter"
    ],
    "locations": [
      "Amsterdam",
      "Gallifrey"
    ]
  },
  "ratings": {
    "ratings_millions": [
      {
        "part": "1",
        "viewers": 7.2
      },
      {
        "part": "2",
        "viewers": 7.3
      },
      {
        "part": "3",
        "viewers": 6.9
      },
      {
        "part": "4",
        "viewers": 7.2
      }
    ]
  },
  "continuity": {
    "continuity_notes": [
      "Borusa has now ascended to the role of Lord President.",
      "Leela has married Andred, for whom she had left the Fourth Doctor.",
      "The Doctor again enters the the Matrix.",
      "A traitor is found to be at work on Gallifrey - not for the first time, nor the last.",
      "Tegan later described the Ergon as \"looking suspiciously like a plucked chicken\".",
      "The Doctor would take on Maxil's appearance during his next regeneration."
    ]
  },
  "plot": [
    {
      "plot_summary": "Omega, an ancient Time Lord made of pure anti-matter, once defeated by the Doctor, is plotting to cross over into this dimension by bonding with the Doctor. Meanwhile, the disappearance of a man in Amsterdam piques the curiosity of his cousin, Tegan, who previously left the Doctor at Heathrow Airport and now finds herself at Omega's mercy. Fearing total destruction from the collision of matter and antimatter, the Time Lords recall the Doctor to Gallifrey to undertake the only viable solution: executing him!"
    },
    {
      "plot_summary": "On Gallifrey, a Time Lord is at work, stealing the biodata extract of another Time Lord and killing a technician named Talor who stumbles across the crime. The traitor provides the bio-data to a creature composed of anti-matter and uses the bio-data to invade the TARDIS and then the Fifth Doctor's metabolism. The Doctor's companion, Nyssa, helps him recover. The creature is shielded in this attempt by the Arc of Infinity, a curious curve between the dimensions containing quad magnetism which can shield anti-matter. The Doctor decides to head to Gallifrey to track down the supplier of his bio-data, conscious that, unless the creature trying to cross universes is stopped, its incursion could cause a fatal chain reaction to the universe. Meanwhile, in Amsterdam, Netherlands, backpackers Robin Stuart and Colin Frazer decide to crash at the crypt of the Frankendael mansion. During the night, Colin hears something and investigates; he finds a curious birdlike creature, the Ergon, which hypnotises him. A terrified Robin runs away. The High Council of the Time Lords is also taking the matter seriously and has decreed that the Doctor's TARDIS should be recalled. The Chancellery Guard under the over-zealous Commander Maxil seizes the Doctor and Nyssa. When the Doctor resists arrest, Maxil shoots him..."
    },
    {
      "plot_summary": "The Doctor has been stunned to ensure his delivery to the High Council. When he is brought before the High Council, the new Lord President, Borusa, is inscrutable while Chancellor Thalia and Cardinal Zorac are openly hostile; only his old friend Councillor Hedin seems pleased to see the Doctor back on Gallifrey. The President stresses the gravity of the situation since the creature poses such a threat to the universe, and the High Council has had no alternative but to issue a Warrant of Termination on the Doctor to ensure the creature can no longer bond with him. Fortunately, an old friend, Damon, who is another technician in the records section, provides the Doctor with the proof he needs that a member of the High Council stole his bio-data extract. Meanwhile, the Doctor's former companion, Tegan Jovanka, arrives in Amsterdam looking for her cousin Colin. Instead, she is greeted by Robin, who tells her that Colin has disappeared. When neither of them can persuade the police to take an interest, they decide to investigate the crypt themselves. Back on Gallifrey, the Doctor is soon taken for execution, despite Nyssa's attempts to save him, and placed in a dispersal chamber. The sentence is carried out..."
    },
    {
      "plot_summary": "The supposed death of the Doctor, however, has not solved the situation. Unbeknownst to the High Council, his mind has been taken into the Time Lord living repository of knowledge, the Matrix, while his body is hidden behind a force shield in the termination cubicle. The creature is a renegade Time Lord, who demands an opportunity to return to the Universe it once inhabited. The truth of the aborted execution is discovered by the wily Castellan, who, while questioning Nyssa and Damon about their involvement, tells them that the Doctor is alive. The Castellan summons and then tells the High Council. In the crypt, Tegan and Robin are attacked by the Ergon's weapon, a matter converter, and transported into a hidden TARDIS belonging to the renegade. Their minds are scanned, revealing to the creature that Tegan knows the Doctor. The renegade uses Tegan as bait to force the Doctor to obey him, also releasing Colin from his slavery as a reward. The Doctor is returned to normal space on Gallifrey where he makes for the High Council Chamber. Lord President Borusa has fallen under suspicion of being a traitor because the Castellan has revealed it was his codes that were used to transmit the bio-data. The truth, however, is that Hedin is the traitor. He is in awe of his master - the mighty Omega, first of the Time Lords and pioneer of time travel. Hedin wishes to release Omega from his exile in a universe of anti-matter, not realising the great Time Lord has been driven mad by his years of solitary confinement. The Castellan kills Hedin, but this does not prevent Omega using the Arc of Infinity to seize total control of the Matrix and, therefore, the organisation of Gallifrey..."
    },
    {
      "plot_summary": "Fortunately, the Doctor and Nyssa manage to slip away and return to the TARDIS. They use the scant knowledge provided by Tegan to determine that Omega has established his base in Amsterdam on Earth, and head there immediately, desperately trying to find the Frankendael crypt she described. After a lengthy hunt, they find the lair defended by the Ergon, and Nyssa disposes of it with its own matter converter. They reach Omega's TARDIS at the point at which both the ship is destroyed and Omega makes full transference to Earth using the Arc of Infinity. When Omega peels his decayed mask away, he reveals that he now has the same face as the Doctor. Omega heads off into Amsterdam with the Doctor, Tegan and Nyssa in hot pursuit. Within a short time, the Doctor's prediction of an unstable transfer begins to come true: Omega's flesh decays and it is clear his new body is not permanent. When the Doctor, Tegan and Nyssa catch up with him, it is a painful task for the Doctor to use the Ergon's matter converter on Omega, expelling him back to his own universe of anti-matter. The Time Lord High Council on Gallifrey detects the end of the threat. Later, once Tegan has checked on her cousin's progress in hospital, she decides to rejoin the TARDIS crew, this time as a willing traveller."
    }
  ]
}