{
  "metadata": {
    "title": "Earthshock",
    "series": "Doctor Who",
    "season": "19",
    "episode_number": 6,
    "release_date": "1982-03-08",
    "release_end_date": "1982-03-16",
    "writer": "Eric Saward",
    "director": "Peter Grimwade",
    "producer": "John Nathan-Turner",
    "main_actors": [
      "Peter Davison",
      "Matthew Waterhouse",
      "Janet Fielding",
      "Sarah Sutton"
    ],
    "time_reference": "2526"
  },
  "cast_crew": [
    {
      "cast": {
        "name": "Peter Davison",
        "role": "The Doctor"
      },
      "crew": {
        "name": "Eric Saward",
        "role": "Writer"
      }
    },
    {
      "cast": {
        "name": "Matthew Waterhouse",
        "role": "Adric"
      },
      "crew": {
        "name": "Peter Grimwade",
        "role": "Director"
      }
    },
    {
      "cast": {
        "name": "Janet Fielding",
        "role": "Tegan"
      },
      "crew": {
        "name": "John Nathan-Turner",
        "role": "Producer"
      }
    }
  ],
  "home_media": [
    {
      "releases": {
        "media_type": "DVD",
        "date": "2003-08-18",
        "special_features": [
          "Commentary by Peter Davison, Janet Fielding, Sarah Sutton, and Matthew Waterhouse",
          "Putting the 'Shock' into Earthshock - A brand-new documentary, exclusive to this DVD, charting the development and creation of this story, and the unique effect it had on viewers",
          "CGI Effects - An option to view this story with newly created, state-of-the-art special effects",
          "Location Film Sequences - Presented in full and containing shots and dialogue cut from the finished show",
          "Did You See? - A 1982 edition of the BBC2 review programme taking a look back at some of Doctor Who's most memorable monsters",
          "40th Anniversary Celebration - A montage of clips from previous Doctor Who stories set to Orbital's rendition of the Doctor Who theme",
          "Episode 5 - Parodic claymation animated short showing what really happened to Adric after the freighter crash",
          "Music-only Option - Allows the viewer to listen to Malcolm Clarke's specially-composed score on an isolated music track",
          "Production Subtitles",
          "Photo Gallery",
          "Easter Egg: The Real McCoy comedy sketch featuring overdubbed footage from Part Four"
        ]
      }
    }
  ],
  "story_notes": [
    {
      "notes": [
        "This story had the working title Sentinel.",
        "Killing off Adric makes some sense story-wise. The Doctor would never purposely return to E-Space, so that would leave Adric indefinitely stuck on the TARDIS; given Adric doesn't have a place in N-Space to call home, like the rest of the companions.",
        "Producer John Nathan-Turner was keen to keep the return of the Cybermen a surprise, and therefore ensured that this aspect was given no advance publicity — even going so far as to arrange for the studio observation galleries to be closed for the duration of recording and turning down Radio Times when they offered to feature the Cybermen in a cover photograph and article to mark the start of the story, much to Sarah Sutton's disappointment.",
        "The Cyber-Leader and Cyber-Lieutenant were also referred to as simply \"Leader\" and \"Lieutenant\" in the combined Radio Times cast for parts one/two.",
        "This is the first Cybermen story which neither of their creators, Kit Pedler and Gerry Davis, had involvement with.",
        "Adric's appearance in part two of Time-Flight is solely so he would be credited in the following week's issue of Radio Times, which would be published on the day Earthshock part four aired — therefore hiding his death here.",
        "This is one of the few serials in which the ending credits have been changed from the regular credits. Adric's star-shaped badge for mathematical excellence is shown broken in pieces while the credits roll in silence.",
        "It's also the first time a serial has used scrolling credits since TV: The War Games and the only story in the JN-T era to do so.",
        "This story features a very rare occasion where the Doctor not only uses a weapon, but also kills with it.",
        "The multiple rows of marching Cybermen in part four was actually a single row duplicated and placed side by side using photographic editing.",
        "One of the android costumes would later be repainted silver and used as the costume for the Raston Warrior Robot in The Five Doctors."
      ]
    }
  ],
  "worldbuilding": {
    "in_universe_mythology": [
      "Adric considers returning to Terradon, in E-Space."
    ],
    "real_world_cultural_references": [],
    "individuals": [
      "Khan was part of Kyle's team.",
      "Seaton is one of the troopers."
    ],
    "items": [
      "The Doctor grinds Adric's gold-edged star into the Cyber-Leader's chest."
    ],
    "locations": [
      "The freighter was stopped in Sector 16 before departing for Earth."
    ]
  },
  "ratings": {
    "ratings_millions": [
      {
        "part": "1",
        "viewers": 9.9
      },
      {
        "part": "2",
        "viewers": 8.8
      },
      {
        "part": "3",
        "viewers": 9.8
      },
      {
        "part": "4",
        "viewers": 9.6
      }
    ]
  },
  "continuity": {
    "continuity_notes": [
      "Adric mentions that Romana is still in E-Space, and could help him if he returned.",
      "Adric also states that he would not return to Alzarius, but rather to Terradon.",
      "The Doctor uses Adric's gold star badge to asphyxiate the Cyber-Leader.",
      "The Cybermen watch scenes from other encounters with the First Doctor, the Second Doctor, and the Fourth Doctor.",
      "The alien computer the Cybermen used and the fate of the freighter and Adric are explored further in AUDIO: The Boy That Time Forgot.",
      "In an alternate timeline, the Doctor was able to save Adric.",
      "The Fifth Doctor is reading Black Orchid before his argument with Adric."
    ]
  },
  "plot": [
    {
      "plot_summary": "A conference to unite military powers against the Cybermen is taking place and the Cybermen plot to destroy the Earth by crashing a space freighter into it. The Doctor must stop them, whatever the cost..."
    },
    {
      "plot_summary": "Lieutenant Scott and his team investigate the disappearance of a scientific expedition in a cave system. They encounter the Doctor, Adric, Tegan, and Nyssa, and accuse them of being responsible for the deaths. It's soon revealed that the expedition was killed by android servants of the Cybermen, who are planning to crash a freighter loaded with Cybermen into the Earth, destroying it."
    },
    {
      "plot_summary": "The Doctor and Adric board the freighter and discover the Cybermen's plan. They try to stop the freighter from crashing into Earth, but are captured by the Cybermen. The Cyber-Leader reveals that the freighter is powered by antimatter and will destroy the planet on impact."
    },
    {
      "plot_summary": "The Doctor and his companions try to stop the freighter from crashing into Earth, but are unable to prevent it from going back in time and colliding with the planet, causing the extinction of the dinosaurs. Adric dies on board the freighter as it crashes, with the Doctor, Nyssa, and Tegan powerless to save him."
    }
  ]
}