{
  "metadata": {
    "title": "Four to Doomsday",
    "series": "Doctor Who",
    "season": "19",
    "episode_number": 2,
    "release_date": "18 - 26 January 1982",
    "writer": "Terence Dudley",
    "director": "John Black",
    "producer": "John Nathan-Turner",
    "main_actors": [
      "Peter Davison",
      "Janet Fielding",
      "Sarah Sutton",
      "Matthew Waterhouse"
    ],
    "time_reference": "1981"
  },
  "cast_crew": [
    {
      "cast": {
        "name": "Peter Davison",
        "role": "The Doctor"
      },
      "crew": {
        "name": "John Black",
        "role": "Director"
      }
    },
    {
      "cast": {
        "name": "Janet Fielding",
        "role": "Tegan"
      },
      "crew": {
        "name": "Terence Dudley",
        "role": "Writer"
      }
    },
    {
      "cast": {
        "name": "Sarah Sutton",
        "role": "Nyssa"
      },
      "crew": {
        "name": "John Nathan-Turner",
        "role": "Producer"
      }
    },
    {
      "cast": {
        "name": "Matthew Waterhouse",
        "role": "Adric"
      },
      "crew": {
        "name": "Philip Locke",
        "role": "Voice of Control"
      }
    },
    {
      "cast": {
        "name": "Stratford Johns",
        "role": "Monarch"
      },
      "crew": {
        "name": "Yat Wong",
        "role": "Chinaman"
      }
    }
  ],
  "home_media": [
    {
      "releases": {
        "media_type": "DVD",
        "date": "15 September 2008",
        "special_features": [
          "Commentary by Peter Davison, Janet Fielding, Sarah Sutton, Matthew Waterhouse and John Black",
          "Studio Recording - Peter Davison's first day in studio as the Doctor",
          "Saturday Night at the Mill - Peter Davison's appearance on the Saturday night magazine programme",
          "Theme Music Video - A brand new mix of Peter Howell's version of the theme music",
          "Radio Times Billings",
          "Photo Gallery",
          "Production Information",
          "Coming Soon Trailer - The War Machines"
        ]
      }
    },
    {
      "releases": {
        "media_type": "VHS",
        "date": "2001",
        "special_features": []
      }
    }
  ],
  "story_notes": [
    {
      "notes": [
        "This was the first Fifth Doctor story to be filmed.",
        "The working title for this story was Day of Wrath.",
        "This is the first Doctor Who television story since The Monster of Peladon not to feature the Fourth Doctor in any capacity.",
        "This is the first Doctor Who television story since Meglos to not be part of a wider story arc.",
        "Nyssa's sudden fainting spell at the end of the story was a throwback to the style of serial transition often employed during the First Doctor era.",
        "Part one establishes the date of Logopolis and the opening scenes of Castrovalva.",
        "The Aboriginal character's dialogue was originally scripted as plausible-sounding gibberish, but Janet Fielding requested that the writer consult the BBC's language department to rewrite the dialogue in an actual Aboriginal language.",
        "Stratford Johns was supposed to wear a more encumbering mask, but he refused, fearing that the mask would hamper his performance.",
        "Several reference books, including The Television Companion, describe Monarch's fate as shrinking out of existence, but in the televised story Monarch has visibly stopped shrinking by the time the Doctor covers him up with a helmet."
      ]
    }
  ],
  "worldbuilding": {
    "in_universe_mythology": [
      "Urbanka",
      "Eye of Harmony",
      "Rassilon"
    ],
    "real_world_cultural_references": [
      "Francis Drake",
      "Principia Mathematica"
    ],
    "individuals": [
      "Monarch",
      "Persuasion",
      "Enlightenment",
      "Bigon",
      "Lin Futu",
      "Kurkutji",
      "Villagra"
    ],
    "items": [
      "Monopticon",
      "Sonic screwdriver",
      "Cricket ball"
    ],
    "locations": [
      "Monarch's ship",
      "Gallifrey",
      "Alzarius",
      "Traken"
    ]
  },
  "ratings": {
    "ratings_millions": [
      {
        "part": "1",
        "viewers": 8.4
      },
      {
        "part": "2",
        "viewers": 8.8
      },
      {
        "part": "3",
        "viewers": 8.9
      },
      {
        "part": "4",
        "viewers": 9.4
      }
    ]
  },
  "continuity": {
    "continuity_notes": [
      "The Fourth Doctor previously displayed an ability to survive exposure to a vacuum in space.",
      "Nyssa's collapse leads to her spending several days resting in the TARDIS while the others have another adventure without her.",
      "The Doctor unsuccessfully attempts to return Tegan to Heathrow Airport to catch the flight she was attempting to reach when she first entered the TARDIS.",
      "The Doctor recalls his first meeting with Adric on Alzarius and Nyssa on Traken.",
      "Adric refers to the river fruits.",
      "Nyssa refers to the Master killing her father Tremas."
    ]
  },
  "plot": [
    {
      "plot_summary": "The Fifth Doctor, Nyssa, Tegan and Adric arrive on a spaceship which is headed for Earth. On board they meet natives of Earth from various different eras, and also three Urbankans: Monarch, Persuasion and Enlightenment. The Urbankans have visited Earth, each time getting speedier in their journeys. This time, they have left their homeworld after erratic solar activity, storing three billion of their species on slides aboard their craft. It seems the current journey is their last and they wish to settle on Earth, which they are due to reach in four days. However, the Urbankans do not plan on a peaceful co-existence with humans. Instead, they will use a toxin that the Urbankans produced from their own bodies during the \"flesh time\" before they were converted to androids, which causes organic matter to shrink away to nothing. It will be unleashed before the Urbankans disembark. The Doctor sets about overthrowing Monarch and, with the help of the human androids led by a restored Bigon, a revolution begins. The Doctor retrieves a sample of the Urbankan toxin, intending to analyse it and turn it against its creator, but when an armed Monarch confronts the Doctor, he's forced to use the entire sample against Monarch, who is reduced to just inches tall."
    }
  ]
}