{
  "metadata": {
    "title": "Mawdryn Undead",
    "series": "Doctor Who",
    "season": "20",
    "episode_number": 3,
    "release_date": "1 February - 9 February 1983",
    "writer": "Peter Grimwade",
    "director": "Peter Moffatt",
    "producer": "John Nathan-Turner",
    "main_actors": [
      "Peter Davison",
      "Janet Fielding",
      "Sarah Sutton",
      "Mark Strickson",
      "Nicholas Courtney"
    ],
    "time_reference": "1983 and 1977"
  },
  "cast_crew": [
    {
      "cast": {
        "name": "Peter Davison",
        "role": "The Doctor"
      },
      "crew": {
        "name": "Peter Grimwade",
        "role": "Writer"
      }
    },
    {
      "cast": {
        "name": "Janet Fielding",
        "role": "Tegan Jovanka"
      },
      "crew": {
        "name": "Peter Moffatt",
        "role": "Director"
      }
    },
    {
      "cast": {
        "name": "Sarah Sutton",
        "role": "Nyssa"
      },
      "crew": {
        "name": "John Nathan-Turner",
        "role": "Producer"
      }
    }
  ],
  "home_media": [
    {
      "releases": {
        "media_type": "DVD",
        "date": "10 August 2009",
        "special_features": [
          "Commentary by Peter Davison, Mark Strickson, Nicholas Courtney, and Script Editor Eric Saward",
          "Who Wants to Live Forever? - Cast and crew look back at the making of this story",
          "Liberty Hall - A new drama in which a journalist travels to Brendon School to interview Brigadier Lethbridge-Stewart",
          "Deleted and Extended Scenes",
          "Film Trims - Taken from the location filming, including clapperboards and cast and crew setting up and performing various scenes",
          "Out-takes",
          "New CGI effects - The option to watch the story with many of the original video effects sequences replaced by new CGI",
          "Continuity - Original BBC-1 continuity announcements",
          "Studio floorplans (DVD-ROM - PC/Mac)",
          "CGI Storyboards (DVD-ROM - PC/Mac)",
          "Radio Times Listings (DVD-ROM - PC/Mac)",
          "Isolated Music Score",
          "Production Information",
          "Subtitles",
          "Photo Gallery",
          "Coming Soon Trailer - The Twin Dilemma",
          "Easter Eggs: TARDIS Information File, Studio floorplans"
        ]
      }
    }
  ],
  "story_notes": [
    {
      "notes": [
        "Every story during Season 20 included a story element from the Doctor's past.",
        "The original intent was for the character of Ian Chesterton to return, hence the school setting, but William Russell was unavailable.",
        "Peter Grimwade based the public school setting on his own upbringing at Truro School.",
        "Nicholas Courtney was baffled by the script.",
        "Peter Davison thought there were an awful lot of holes in the plot and was amazed that the audience didn't notice.",
        "Mark Strickson claimed that the communication crystal was attached to a car battery to make it bright enough to be seen on camera and each scene with it had to be fourteen seconds long otherwise it got too hot to hold.",
        "Peter Grimwade originally wanted the events to take place several centuries apart, but was encouraged to bring them closer together.",
        "David Collings was cast as Mawdryn due to his resemblance to Peter Davison.",
        "Peter Grimwade included the flashback scene based on the success of similar scenes in Logopolis and Earthshock."
      ]
    }
  ],
  "worldbuilding": {
    "in_universe_mythology": [
      "The Blinovitch Limitation Effect"
    ],
    "real_world_cultural_references": [
      "The Queen's Silver Jubilee"
    ],
    "individuals": [
      "Harry Sullivan",
      "Jo Grant",
      "Sarah Jane Smith",
      "Liz Shaw",
      "Sergeant Benton",
      "Powell",
      "Charlie Gibbs"
    ],
    "items": [
      "Zero Room",
      "Metamorphic symbiosis regenerator"
    ],
    "locations": [
      "Brendon Public School",
      "Mawdryn's ship"
    ]
  },
  "ratings": {
    "ratings_millions": [
      {
        "part": "1",
        "viewers": 6.5
      },
      {
        "part": "2",
        "viewers": 7.5
      },
      {
        "part": "3",
        "viewers": 7.4
      },
      {
        "part": "4",
        "viewers": 7.7
      }
    ]
  },
  "continuity": {
    "continuity_notes": [
      "The Black Guardian swore revenge on the Doctor during his fourth incarnation and continues to use Turlough in pursuit of this revenge.",
      "Tegan is still unsure if she is finally free of the Mara.",
      "It is explicitly stated that the Doctor is currently in his fifth incarnation.",
      "The Doctor says, \"If I reverse the polarity of the neutron flow...\", as sometimes said by the Third Doctor.",
      "When remembering his time with the Doctor, the older Brigadier recalls encounters with various enemies from the Doctor's past."
    ]
  },
  "plot": [
    {
      "plot_summary": "A warp ellipse draws the TARDIS off course. The Fifth Doctor's companions are separated from him not in space, but in time, and he has to deal with a treacherous schoolboy named Turlough. But why does the Doctor's old friend, the Brigadier, not remember him at all? The Doctor travels to Earth to get rid of the transmat interference trapping the TARDIS, and Turlough, responding to the Black Guardian's exhortations, prepares to attack the Doctor. The interference device explodes, knocking the Doctor backwards and forcing the rock out of Turlough's hands. The Doctor meets the Brigadier at the school, but is puzzled when his old comrade-in-arms does not remember him. In 1977, Tegan and Nyssa encounter the transmat capsule and bring the figure of Mawdryn, who is pretending to be the Doctor, back to the TARDIS. The Doctor, Turlough and the present-day Brigadier use a TARDIS homing device on the damaged transmat to bring themselves to the ship, splitting up soon after to search for Tegan and Nyssa. Under the Black Guardian's instruction, Turlough opens a secret room, revealing several humanoids suffering from the same malady as Mawdryn. Mawdryn fools the present-day Brigadier into using a stolen Time Lord device to stabilise his condition. The Doctor explains that he can only regenerate twelve times, and that, as he has already done so four times, helping the mutants die would consume all eight of his remaining regenerations. The Doctor is about to sacrifice himself when the two Brigadiers meet and touch hands, causing a discharge of temporal energy at precisely the right instant to act as a substitute power source. Tegan and Nyssa are cured, the alien scientists end their undead existence and the Doctor remains a Time Lord. The younger Brigadier, however, will not remember his time with the Doctor until they meet again in 1983."
    }
  ]
}