{
  "metadata": {
    "title": "Planet of Fire",
    "series": "Doctor Who",
    "season": "21",
    "episode_number": 134,
    "release_date": "23 February - 2 March 1984",
    "writer": "Peter Grimwade",
    "director": "Fiona Cumming",
    "producer": "John Nathan-Turner",
    "main_actors": [
      "Peter Davison",
      "Nicola Bryant",
      "Mark Strickson"
    ],
    "time_reference": "circa 1984"
  },
  "cast_crew": [
    {
      "cast": {
        "name": "Peter Davison",
        "role": "The Doctor"
      },
      "crew": {
        "name": "Fiona Cumming",
        "role": "Director"
      }
    },
    {
      "cast": {
        "name": "Nicola Bryant",
        "role": "Peri Brown"
      },
      "crew": {
        "name": "Peter Grimwade",
        "role": "Writer"
      }
    },
    {
      "cast": {
        "name": "Mark Strickson",
        "role": "Turlough"
      },
      "crew": {
        "name": "John Nathan-Turner",
        "role": "Producer"
      }
    }
  ],
  "home_media": [
    {
      "releases": {
        "media_type": "DVD",
        "date": "14 June 2010",
        "details": "Part of the Kamelion Tales box set",
        "special_features": [
          "Commentary",
          "The Flames of Sarn",
          "Return to the Planet of Fire",
          "Designs of Sarn",
          "Deleted and Extended Scenes",
          "BBC1 Continuity",
          "Isolated Score",
          "Radio Times Billings",
          "Production Information Subtitles",
          "Photo Gallery",
          "Coming Soon Trailer",
          "Feature Length Version",
          "Remembering Anthony Ainley",
          "Calling the Shots",
          "Factoids"
        ]
      }
    }
  ],
  "story_notes": [
    {
      "notes": [
        "This story had the working title of Planet of Fear.",
        "Kamelion appears for the first time since The King's Demons the previous season.",
        "This is the only televised Fifth Doctor story not to visually contain Tegan Jovanka.",
        "This was the final serial to feature a male companion until the series revival in 2005.",
        "The combined Radio Times cast for parts one/two incorrectly credits Nicola Bryant as 'Perpugillian Brown' and Gerald Flood as 'Voice of Kamelior'.",
        "The Master's final line before apparently being killed is directed squarely at the Doctor: 'Won't you show mercy to your own ...'.",
        "Peter Grimwade was furious at the casting of Dallas Adams as Prof. Foster.",
        "The script originally contained commentary on issues of religious zealotry, something that was toned down by Eric Saward.",
        "Filming the scene where Turlough rescues Peri was bizarrely disrupted by a German naturist.",
        "John Nathan-Turner denied Peter Grimwade's request to accompany the crew to Lanzarote, as he felt writers were not needed."
      ]
    }
  ],
  "worldbuilding": {
    "in_universe_mythology": [
      "Logar",
      "The Time of Fire"
    ],
    "real_world_cultural_references": [
      "Poseidon",
      "Hephaestus",
      "Kouros",
      "Praxiteles",
      "Cro-Magnon",
      "Albert Einstein",
      "Eros",
      "Elton John"
    ],
    "individuals": [
      "Peri Brown",
      "Turlough",
      "The Master",
      "Kamelion"
    ],
    "items": [
      "Numismaton Gas",
      "Tissue Compression Eliminator"
    ],
    "locations": [
      "Sarn",
      "Trion",
      "Lanzarote",
      "Brendon Public School"
    ]
  },
  "ratings": {
    "ratings_millions": [
      {
        "part": "1",
        "viewers": 7.4
      },
      {
        "part": "2",
        "viewers": 6.1
      },
      {
        "part": "3",
        "viewers": 7.4
      },
      {
        "part": "4",
        "viewers": 7.0
      }
    ]
  },
  "continuity": {
    "continuity_notes": [
      "The Doctor speaks of the Daleks and the departure of Tegan.",
      "Kamelion reappears.",
      "Turlough's origins are explained."
    ]
  },
  "plot": [
    {
      "plot_summary": "A strange signal from Earth draws the TARDIS to the island of Lanzarote, where Turlough rescues a young American girl, Peri, from drowning. Among her possessions is an artefact bearing an alien symbol - the same triangular mark that Turlough has branded into his arm. The mystery deepens when Kamelion falls under the control of a powerful mind, and the TARDIS travels to the volcanic world of Sarn. As Turlough is forced to face his past, the Fifth Doctor must stop his oldest enemy from harnessing the revitalising powers of Numismaton gas."
    },
    {
      "plot_summary": "On the desolate volcanic planet Sarn, chief elder Timanov counsels the young Chosen One Malkon on how to act in the wake of increased seismic activity, heralding the imminent volcanic catastrophe known as the Time of Fire. Meanwhile, the Fifth Doctor, Turlough and Peri arrive on Sarn, where they encounter the Master, who is trying to harness the revitalising powers of Numismaton gas. The Doctor must stop the Master and save the citizens of Sarn from the impending volcanic eruption."
    },
    {
      "plot_summary": "Turlough discovers that Malkon may be his long-lost younger brother, and the Doctor finds himself at the mercy of Timanov and the Master. The Master demands the return of the TARDIS's comparator, which the Doctor doesn't have, as his new allies are pushed toward the mouth of the Cave of Fire. Turlough uses a Trion relic to remotely disable the sacrificial flame, and releases the Doctor and the unbelievers from the cave."
    },
    {
      "plot_summary": "The Doctor struggles to figure out why the Master is on Sarn, and how to rescue the citizens from the impending volcanic eruption. Peri accidentally knocks the Master's control box over, allowing him to escape. The Doctor sends Amyand back to the ruins wearing a protective suit. Kamelion, now freed from the Master's control, begs for destruction, and the Doctor complies. The Master is restored to full height by the Numismaton gas, but the Doctor's fiddling with the controls cuts off the gas, leaving the Master to burn in the naked flames. Turlough bids the Doctor goodbye as he is summoned by a Trion rescue ship, while Peri asks to travel with the Doctor for the remaining three months of her vacation."
    }
  ]
}