{
  "metadata": {
    "title": "The Awakening",
    "series": "Doctor Who",
    "season": "21",
    "episode_number": 2,
    "release_date": "19 - 20 January 1984",
    "writer": "Eric Pringle",
    "director": "Michael Owen Morris",
    "producer": "John Nathan-Turner",
    "main_actors": [
      "Peter Davison",
      "Janet Fielding",
      "Mark Strickson"
    ],
    "time_reference": "1984"
  },
  "cast_crew": [
    {
      "cast": {
        "name": "Peter Davison",
        "role": "The Doctor"
      },
      "crew": {
        "name": "Eric Pringle",
        "role": "Writer"
      }
    },
    {
      "cast": {
        "name": "Janet Fielding",
        "role": "Tegan"
      },
      "crew": {
        "name": "Michael Owen Morris",
        "role": "Director"
      }
    },
    {
      "cast": {
        "name": "Mark Strickson",
        "role": "Turlough"
      },
      "crew": {
        "name": "John Nathan-Turner",
        "role": "Producer"
      }
    }
  ],
  "home_media": [
    {
      "releases": {
        "media_type": "DVD",
        "date": "20 June 2011",
        "special_features": [
          "Commentary by director Michael Owen Morris and script editor Eric Saward, moderated by Toby Hadoke",
          "Return to Little Hodcombe - Michael Owen Morris, actors Janet Fielding (Tegan) and Keith Jayne (Will Chandler) and script editor Eric Saward return to the three villages featured in The Awakening",
          "Making the Malus - Visual effects designer Tony Harding and model maker Richard Gregory are reunited with the Malus prop they built for the story",
          "Now and Then -A trip to the villages of Martin, Shapwick and Tarrant Monkton to compare the locations used in the story with how they appear today",
          "From the Cutting Room Floor - Extended and deleted scenes and outtakes",
          "The Golden Egg Awards - Peter Davison is on hand to collect a trophy from host Noel Edmonds",
          "Radio Times listings (DVD-ROM)",
          "Production information subtitles",
          "Photo gallery",
          "Coming Soon Trailer - Paradise Towers"
        ]
      }
    }
  ],
  "story_notes": [
    {
      "notes": [
        "This story had the working titles of War Game and Poltergeist.",
        "A scene involving Tegan and the Doctor's robotic companion Kamelion in a corridor in the TARDIS in part one was filmed for this serial, but edited out before transmission due to the episode overrunning.",
        "Script editor Eric Saward implemented several elements from his own story The Visitation, such as tinclavic and Raaga, thereby making The Awakening a loose sequel to The Visitation.",
        "Will Chandler was considered for a new companion, but Eric Saward and John Nathan-Turner felt viewers might become tired of him.",
        "Compared with his long odyssey to return Tegan to Heathrow Airport in the early 1980s, the Fifth Doctor is apparently much better at landing in her grandfather's village. Part one suggests he got it right on the first go.",
        "The story also exists in the BBC Archives as the 50-minute compilation repeat broadcast on Friday 20 July 1984. It is fortunate indeed that the compilation version was made and still exists on 625 line PAL colour videotape to this day, as the master 625 line PAL videotape of part one was accidentally badly scratched during a duplication session in 1987 and is now no longer broadcastable.",
        "The Radio Times programme listings for the original transmissions of parts one and two featured no synopses. However, that for the 50-minute compilation version bore the following item: \"What evil sleeps in the church of a quiet country village?\""
      ]
    }
  ],
  "worldbuilding": {
    "in_universe_mythology": [
      "Tinclavic is mined by Terileptils on the planet Raaga for the almost exclusive use of the inhabitants of Hakol in the star system of Rifta.",
      "The Malus, the occupant of a Hakol computer-controlled reconnaissance probe, came to Earth in 1643 as the spearhead of an invasion fleet which never followed."
    ],
    "real_world_cultural_references": [
      "The exchange \"You speak treason? / Fluently\" is from The Adventure of Robin Hood."
    ],
    "individuals": [
      "The Doctor",
      "Tegan",
      "Turlough",
      "Jane Hampden",
      "Sir George Hutchinson",
      "Colonel Wolsey",
      "Joseph Willow",
      "Will Chandler",
      "Andrew Verney"
    ],
    "items": [
      "Tinclavic"
    ],
    "locations": [
      "Little Hodcombe",
      "Hakol",
      "Raaga"
    ]
  },
  "ratings": {
    "ratings_millions": [
      {
        "part": "Part one",
        "viewers": 7.9
      },
      {
        "part": "Part two",
        "viewers": 6.6
      }
    ]
  },
  "continuity": {
    "continuity_notes": [
      "In the attempt to return Will to 1643, the TARDIS materialised on a planet of extremely intelligent, war-like walking reptilians, whose king wanted to execute the Doctor.",
      "The Malus, and its companion probe craft hinted at in the dialogue of the story, are reintroduced later in The Hollow Men and Last of the Gaderene.",
      "While in Little Hodcome, the Doctor received the Reborn Master's distress call in Hexford in 2016.",
      "Jane Hampden was Mikey's third-year teacher at Little Hodcombe Primary School."
    ]
  },
  "plot": [
    {
      "plot_summary": "The Fifth Doctor, Tegan and Turlough arrive in Little Hodcombe, a small English village, looking forward to spending some time with Tegan's grandfather. They soon discover that all is not well - Tegan's grandfather is missing and the locals are re-enacting English Civil War battles from 1643. With the past mixed up with the present, can the Doctor stop the games before an evil entity hidden in the village church awakens?"
    },
    {
      "plot_summary": "The Doctor, Tegan and Turlough investigate the village and discover an alien entity called the Malus, which is using the villagers' reenactments to feed on their psychic energy. The Doctor tries to stop the games, but Sir George Hutchinson refuses to listen. The Malus creates corporeal projections of Roundheads to attack the Doctor and his allies. In the end, the Doctor is able to defeat the Malus by blocking the psychic energy feeding it, causing the church to collapse. The Doctor then takes Will Chandler, a 17th century peasant who got pulled into the future, back to his own time."
    }
  ]
}