{
  "metadata": {
    "title": "The Visitation",
    "series": "Doctor Who",
    "season": "19",
    "episode_number": 4,
    "release_date": "15 February - 23 February 1982",
    "writer": "Eric Saward",
    "director": "Peter Moffatt",
    "producer": "John Nathan-Turner",
    "main_actors": [
      "Peter Davison",
      "Janet Fielding",
      "Matthew Waterhouse",
      "Sarah Sutton"
    ],
    "time_reference": "London, August - September 1666"
  },
  "cast_crew": [
    {
      "cast": {
        "name": "Peter Davison",
        "role": "The Doctor"
      },
      "crew": {
        "name": "Eric Saward",
        "role": "Writer"
      }
    },
    {
      "cast": {
        "name": "Janet Fielding",
        "role": "Tegan"
      },
      "crew": {
        "name": "Peter Moffatt",
        "role": "Director"
      }
    },
    {
      "cast": {
        "name": "Matthew Waterhouse",
        "role": "Adric"
      },
      "crew": {
        "name": "John Nathan-Turner",
        "role": "Producer"
      }
    }
  ],
  "home_media": [
    {
      "releases": {
        "media_type": "DVD",
        "date": "19 January 2004",
        "special_features": [
          "Audio Commentary",
          "Directing Who - Interview with Peter Moffatt",
          "Writing a Final Visitation - Writer Eric Saward talks about the origins of his first script for Doctor Who",
          "Scoring The Visitation - Composer Paddy Kingsland discusses his score",
          "Film Trims - Additional shots and dialogue that were cut before transmission",
          "Music-only Option",
          "Photo Gallery",
          "Production Subtitles",
          "Continuity announcements (Easter Egg)"
        ]
      }
    },
    {
      "releases": {
        "media_type": "DVD",
        "date": "6 May 2013",
        "details": "Special Edition",
        "special_features": [
          "Commentary with Peter Davison, Janet Fielding, Sarah Sutton, Matthew Waterhouse and director Peter Moffatt",
          "Grim Tales - Brand-new 45-minute documentary",
          "The Television Centre of the Universe - Part One - Peter Davison, Mark Strickson and Janet Fielding return to BBC Television Centre and meet up with old friends and colleagues",
          "Doctor Forever - The Apocalypse Element - Examining the world of Doctor Who on audio. Including interviews with Colin Baker, Russell T Davies, Mark Gatiss and many others",
          "Film Trims - Shots and sequences cut from the finished programme",
          "Directing Who - Peter Moffatt",
          "Writing A Final Visitation",
          "Scoring The Visitation - Interview with composer Paddy Kingsland",
          "Subtitle Production Notes",
          "Radio Times Listings and BBC Sales Sheet",
          "Photo Gallery",
          "Coming Soon Trailer - Inferno: Special Edition",
          "Isolated Music Score",
          "Continuity announcements (Easter Egg)"
        ]
      }
    },
    {
      "releases": {
        "media_type": "VHS",
        "date": "July 1994",
        "details": "Included with Black Orchid as part of a two tape set",
        "special_features": []
      }
    }
  ],
  "story_notes": [
    {
      "notes": [
        "The working titles for this story were The Invasion of the Plague Men and Plague Rats.",
        "This is the only story credited to Eric Saward that didn't feature a recurring villain, apart from a mention to the Mara.",
        "The opening sequence in the TARDIS follows on directly from Kinda.",
        "Radio Times credits John Savident (The Squire) as \"Squire John\", and Michael Melia (Terileptil) as \"Terileptil Leader\".",
        "The Terileptil masks, produced by freelance firm Imagineering, marks the first use of animatronics in the series.",
        "Eric Saward attributes the name 'Terileptil' to the words \"territorial reptiles\" in Doctor Who: The Making of a Television Series.",
        "One part of the Terileptil's laboratory re-uses a Hymetusite crystal from The Horns of Nimon.",
        "Director Peter Moffatt strongly disliked Paddy Kingsland's incidental music for this serial, saying it was replete with \"turgid chords\". However, Kingsland called Moffatt his \"favourite director to work with\".",
        "Eric Saward disliked Michael Robbins' performance as Richard Mace, largely because he kept changing his lines. Robbins, for his part, is said to have hated working on this story.",
        "Peter Davison named this serial as a favourite. Matthew Waterhouse recalled Davison entering the rehearsal room shaking the script with excitement.",
        "The Terileptils, and the pioneering animatronic masks used to bring them to life, were intended to return. Those plans fell through. One mask did end up being reused in modified form on a delegate from Posikar in The Trial of a Time Lord.",
        "The story was inspired by the work of a former girlfriend of Eric Saward's, who had been studying the architecture which arose in the wake of the Great Fire of London.",
        "Ian Bannen, Brian Blessed, John Carson, Ronald Fraser, Donald Houston, William Lucas, Glyn Owen and Donald Pleasence were considered for Richard Mace.",
        "Peter Davison was late for the first rehearsal because the family cat had taken a live mole into the house and he had to return it safely to the garden.",
        "Filming at Black Park took place on a Heathrow Airport flight path and the noise of approaching aircraft regularly disrupted recording. An air traffic controller's strike put an end to these disturbances.",
        "Peter Davison drove himself to the location in his Volkswagen Scirocco.",
        "Eric Saward originally submitted the script for Season 18. John Nathan-Turner felt the narrative was too similar to The Talons of Weng-Chiang and that Richard Mace verged on the kind of whimsy he wanted to discourage."
      ]
    }
  ],
  "worldbuilding": {
    "in_universe_mythology": [
      "Terileptil mythology"
    ],
    "real_world_cultural_references": [
      "Great Fire of London"
    ],
    "individuals": [
      "The Squire",
      "Charles",
      "Ralph",
      "Elizabeth",
      "Richard Mace",
      "Terileptil leader"
    ],
    "items": [
      "Terileptil bracelets",
      "Terileptil android",
      "Sonic screwdriver",
      "Soliton gas",
      "Terileptil control device",
      "Plague rats"
    ],
    "locations": [
      "London",
      "Pudding Lane",
      "Terileptil ship",
      "Terileptil laboratory"
    ]
  },
  "ratings": {
    "ratings_millions": [
      {
        "part": "Part one",
        "viewers": 9.1
      },
      {
        "part": "Part two",
        "viewers": 9.3
      },
      {
        "part": "Part three",
        "viewers": 9.9
      },
      {
        "part": "Part four",
        "viewers": 10.1
      }
    ]
  },
  "continuity": {
    "continuity_notes": [
      "When the Doctor is about to be beheaded by the scytheman, he groans, \"Not again.\" He is alluding to nearly having been beheaded by Monarch's androids.",
      "The Fourth Doctor previously indicated that he was wrongly accused of having started the Great Fire.",
      "The First Doctor was accidentally involved in the burning of Rome.",
      "During a visit to 1666, the Fourth Doctor and Sarah Jane Smith were nearly run over by an oddly dressed figure in a heavily loaded cart. Unbeknownst to either of them, this was, in fact, the Terileptil leader who was being pursued by the Fifth Doctor.",
      "The Doctor's involvement in the fire remained a source of embarrassment for him in his sixth incarnation.",
      "During the Doctor's first incarnation, the TARDIS had materialised in London, specifically outside the burning house of George Mortimer, shortly after the Great Fire began. The First Doctor rescued George, his wife Helen and their children Ida and Alan, and took them on a trip to the Andromeda Galaxy in the far future.",
      "The Renegade Time Lord Iris Wildthyme would later claim to have been present for the Great Fire.",
      "In November 1688, King James II told the Second Doctor, Jamie McCrimmon and Zoe Heriot that the English Catholics were blamed for starting the Great Fire during the reign of his elder brother Charles II.",
      "The Doctor references and encounters the Terileptils again.",
      "The Master destroyed their home planet of Terileptus in The Dark Path.",
      "Adric claims Alzarians recover faster than humans."
    ]
  },
  "plot": [
    {
      "plot_summary": "The Fifth Doctor tries to take Tegan back to Heathrow Airport but the TARDIS arrives in the 17th century instead of the 20th. The time travellers find a space capsule has crash-landed nearby and that its alien occupants, three Terileptil prison escapees, intend to wipe out all indigenous life on Earth by releasing rats infected with an enhanced strain of the great plague. The creatures are also using a sophisticated android to strike terror into the local villagers. Aided by itinerant thespian Richard Mace, the Doctor tries to unravel the evil plot. The Doctor disables the Terileptil's control bracelets and stops their plan, but the overheating of one of their weapons causes an explosion that starts the Great Fire of London."
    }
  ]
}