{
  "metadata": {
    "title": "Dragonfire",
    "series": "Doctor Who",
    "season": "24",
    "episode_number": 4,
    "release_date": "23 November - 7 December 1987",
    "writer": "Ian Briggs",
    "director": "Chris Clough",
    "producer": "John Nathan-Turner",
    "main_actors": [
      "Sylvester McCoy",
      "Bonnie Langford",
      "Sophie Aldred",
      "Tony Selby"
    ],
    "time_reference": "c. 2,000,000"
  },
  "cast_crew": [
    {
      "cast": {
        "name": "Sylvester McCoy",
        "role": "The Doctor"
      },
      "crew": {
        "name": "Ian Briggs",
        "role": "Writer"
      }
    },
    {
      "cast": {
        "name": "Bonnie Langford",
        "role": "Mel"
      },
      "crew": {
        "name": "Chris Clough",
        "role": "Director"
      }
    },
    {
      "cast": {
        "name": "Sophie Aldred",
        "role": "Ace"
      },
      "crew": {
        "name": "John Nathan-Turner",
        "role": "Producer"
      }
    }
  ],
  "home_media": [
    {
      "releases": {
        "media_type": "DVD",
        "date": "7 May 2012",
        "details": "Ace Adventures box set",
        "special_features": [
          "Commentary",
          "Behind-the-scenes featurettes",
          "Deleted and extended scenes",
          "Isolated music score"
        ]
      }
    }
  ],
  "story_notes": [
    {
      "notes": [
        "This was the final story of Season 24 and marked the departure of companion Melanie Bush.",
        "It featured the debut of Sophie Aldred as the new companion Ace.",
        "The story includes several references to the Alien franchise, including the appearance of the 'dragon' and the way it is hunted by soldiers.",
        "Kane's death scene was filmed using a wax bust of the actor's face, which was melted down in front of a recording camera."
      ]
    }
  ],
  "worldbuilding": {
    "in_universe_mythology": [
      "Kane's backstory as part of the Kane-Xana criminal gang"
    ],
    "real_world_cultural_references": [
      "Kane is named after Citizen Kane, with Xana named after his estate Xanadu",
      "Bazin is named after French critic André Bazin",
      "McLuhan is named after Canadian media theorist Herbert Marshall McLuhan"
    ],
    "individuals": [
      "The Doctor",
      "Mel",
      "Ace",
      "Sabalom Glitz",
      "Kane",
      "Xana"
    ],
    "items": [
      "The 'Dragonfire' crystal",
      "Ace's nitro-9 explosive"
    ],
    "locations": [
      "Iceworld",
      "Svartos",
      "The ice caverns"
    ]
  },
  "ratings": {
    "ratings_millions": [
      {
        "part": "1",
        "viewers": 5.5
      },
      {
        "part": "2",
        "viewers": 5.0
      },
      {
        "part": "3",
        "viewers": 4.7
      }
    ]
  },
  "continuity": {
    "continuity_notes": [
      "This is the first story where a new companion joins the Doctor at the end of a season.",
      "The Doctor's wistful speech to Mel about her leaving is based on the audition speech Sylvester McCoy was given for the role.",
      "Ace's backstory of arriving on Iceworld via a time storm is expanded upon in later stories."
    ]
  },
  "plot": [
    {
      "plot_summary": "The TARDIS arrives on the space trading colony of Iceworld, where the Doctor and Mel encounter their old acquaintance Sabalom Glitz. Glitz is searching for a treasure guarded by a 'dragon' in the icy caverns below Iceworld. They also meet a new companion, a young woman named Ace, who has recently arrived on Iceworld via a time storm. \n\nIceworld is controlled by the callous Kane, who has a cryogenic chamber where he freezes his employees and supporters. Glitz is in debt to Kane, who is using him to search for the treasure. The 'dragon' is revealed to be an advanced biped creature with laser-firing eyes, guarding a valuable crystal inside its head - the 'Dragonfire' that Kane needs to escape his exile on Iceworld.\n\nAfter a series of confrontations, the Doctor is able to retrieve the crystal and stop Kane from using it to activate Iceworld as a spacecraft and escape. Kane is ultimately destroyed when exposed to sunlight. Glitz claims Iceworld as his own ship, and Mel decides to stay with him, leaving the Doctor to take Ace back to her home in Perivale."
    }
  ]
}