{
  "metadata": {
    "title": "Paradise Towers",
    "series": "Doctor Who",
    "season": "24",
    "episode_number": 2,
    "release_date": "5 - 26 October 1987",
    "writer": "Stephen Wyatt",
    "director": "Nicholas Mallett",
    "producer": "John Nathan-Turner",
    "main_actors": [
      "Sylvester McCoy",
      "Bonnie Langford"
    ],
    "time_reference": "circa 22nd century"
  },
  "cast_crew": [
    {
      "cast": {
        "name": "Bonnie Langford",
        "role": "Mel"
      },
      "crew": {
        "name": "Astra Sheridan",
        "role": "Yellow Kang"
      }
    }
  ],
  "home_media": [
    {
      "releases": {
        "media_type": "DVD",
        "date": "July 2011",
        "special_features": [
          "Commentary by Judy Cornwell (Maddy), Stephen Wyatt (Writer), Dick Mills (Special Sounds Designer) and moderated by Mark Ayres",
          "Horror on the High Rise - Cast and crew look back on the making of this story",
          "Casting Sylvester Girls! Girls! Girls! - The Eighties - With Sophie Aldred, Janet Fielding and Sarah Sutton, and introduced by Peter Purves",
          "Deleted and Extended Scenes",
          "Alternative Soundtrack - Option to view this story with an unused music score",
          "Photo gallery",
          "Production Information",
          "Subtitles",
          "Trailers and continuity announcements",
          "Coming soon trailer - The Sun Makers",
          "Radio Times Listings (DVD-ROM - PC/Mac)"
        ]
      }
    }
  ],
  "story_notes": [
    {
      "notes": [
        "This story may have had a working title of Paradise Tower, but this may simply be a misprint on the commissioning documents for the story.",
        "Ronald Lacey, T. P. McKenna, Denis Quilley and Ian Richardson were considered for the role of the Chief Caretaker.",
        "Phillip Jackson and Roger Daltry were considered for the Deputy Chief Caretaker.",
        "Frances Cuka was considered for Maddy.",
        "Edward Hardwicke was cast as the Deputy but dropped out and was replaced by Clive Merrison.",
        "The music score for this story was originally made by freelance composer David Snell. John Nathan-Turner rejected the music after it was completed, deeming it too repetitive. Keff McCulloch provided the replacement score inside of a week despite working on Time and the Rani and Delta and the Bannermen at the same time.",
        "The Blue Kang Leader was unnamed on-screen but was given the name Drinking Fountain in Stephen Wyatt's novelisation. This was not derived from any information given in the televised version.",
        "In successive drafts of the script, the planet on which Paradise Towers was located was referred to as \"Kroagnon\", and then as \"Griphos\". The world was eventually left unnamed on-screen, but there does exist a possibility that it could be Earth.",
        "While the Doctor does carry an umbrella as part of his attire in this story, the first appearance of his trademark Question Mark umbrella is the next serial, Delta and the Bannermen.",
        "The script was written before Sylvester McCoy was cast. Stephen Wyatt was given McCoy's audition tape as a guide to his Doctor's characterization. He'd seen McCoy onstage and agreed with John Nathan-Turner that he should echo Patrick Troughton.",
        "Richard Briers' performance has attracted considerable criticism. In the DVD special features, it is mentioned that both John Nathan-Turner and Andrew Cartmel were unhappy with his performance during the recording, and Briers admits he ignored directions to tone it down.",
        "Pex was meant to be a huge musclebound man, but it didn't quite pan out that way, as Andrew Cartmel recalls.",
        "Some of the barrels used as set dressing in the Kangs' lair still have the faded or painted-over remains of the Weyland-Yutani logo visible on them — they're one of many old Alien and Aliens props used throughout the Eighties.",
        "Following the Hungerford Massacre, complaints from the public regarding violence in entertainment prompted Michael Grade to ask for the serial to be re-edited for overseas sale. In particular, several trims were made to sequences in Tilda and Tabby's flat which made conspicuous use of knives."
      ]
    }
  ],
  "worldbuilding": {
    "in_universe_mythology": [
      "Kroagnon, the \"Great Architect\""
    ],
    "real_world_cultural_references": [
      "The story was heavily inspired by J.G. Ballard's novel High Rise."
    ],
    "individuals": [
      "Caretaker 345/12, subsection 3",
      "Caretaker 579/14, subsection 8",
      "Caretaker 97/2, subsection 9"
    ],
    "items": [
      "Fire Escape",
      "Bin Liner",
      "Drinking Fountain",
      "Robotic Self activating Megapodic Mark 7Z Cleaners",
      "Antique telephone"
    ],
    "locations": [
      "Paradise Towers",
      "Fountain of Happiness Square",
      "Potassium Street",
      "Sodium Street, corridor 75",
      "Floor 173",
      "Floor 174",
      "Floor 245",
      "Floor 304",
      "Miracle City",
      "Golden Dream Park",
      "Bridge of Perpetual Motion"
    ]
  },
  "ratings": {
    "ratings_millions": [
      {
        "part": "Part one",
        "viewers": 4.5
      },
      {
        "part": "Part two",
        "viewers": 5.2
      },
      {
        "part": "Part three",
        "viewers": 5.0
      },
      {
        "part": "Part four",
        "viewers": 5.0
      }
    ]
  },
  "continuity": {
    "continuity_notes": [
      "The Doctor is again called an \"Old One\" by locals, as he was in The Mysterious Planet.",
      "The TARDIS is graffitied again in Aliens of London.",
      "The TARDIS pool last appeared in The Invasion of Time. It was later recreated by the Doctor or the TARDIS itself sometime between this episode and The Eleventh Hour, and was used by River Song in Day of the Moon. However, it was again ejected in The Doctor's Wife. In Journey to the Centre of the TARDIS, there is a new swimming pool again.",
      "In Lucifer Rising, Bishop had to deal with \"the messy consequences of the Kroagnon affair\" (either Miracle City or Paradise Towers) prior to the events of the novel."
    ]
  },
  "plot": [
    {
      "plot_summary": "The Doctor and Mel arrive at Paradise Towers, a residential complex that has fallen into disrepair. They encounter the Kangs, teenage girl gangs who have divided the complex between them. The Kangs are being terrorized by the Cleaners, robot servants that have turned murderous. The Doctor discovers that the complex was designed by an architect named Kroagnon, who has taken over the body of the Chief Caretaker. Kroagnon plans to destroy the inhabitants of Paradise Towers. The Doctor works with the Kangs, Rezzies (middle-aged residents), and Caretakers to defeat Kroagnon and the Cleaners. In the end, Pex sacrifices himself to stop Kroagnon, and the Doctor and Mel depart, leaving the residents to rebuild their community."
    }
  ]
}