{
  "metadata": {
    "title": "The Greatest Show in the Galaxy",
    "series": "Doctor Who",
    "season": "25",
    "episode_number": 4,
    "release_date": "14 December 1988",
    "release_end_date": "4 January 1989",
    "writer": "Stephen Wyatt",
    "director": "Alan Wareing",
    "producer": "John Nathan-Turner",
    "main_actors": [
      "Sylvester McCoy",
      "Sophie Aldred"
    ],
    "time_reference": "35th century"
  },
  "cast_crew": [
    {
      "cast": {
        "name": "Sylvester McCoy",
        "role": "The Doctor"
      },
      "crew": {
        "name": "Alan Wareing",
        "role": "Director"
      }
    },
    {
      "cast": {
        "name": "Sophie Aldred",
        "role": "Ace"
      },
      "crew": {
        "name": "John Nathan-Turner",
        "role": "Producer"
      }
    },
    {
      "cast": {
        "name": "T.P. McKenna",
        "role": "Captain Cook"
      },
      "crew": {
        "name": "Stephen Wyatt",
        "role": "Writer"
      }
    }
  ],
  "home_media": [
    {
      "releases": {
        "media_type": "DVD",
        "date": "30 July 2012",
        "special_features": [
          "Commentary",
          "The Show Must Go On",
          "Deleted and Extended Scenes",
          "Lost in the Darkness: Model Effects",
          "Who's Who - The Psychic Circus",
          "Tomorrow's Times - The Seventh Doctor",
          "Victoria Wood - Doctor Who sketch"
        ]
      }
    }
  ],
  "story_notes": [
    {
      "notes": [
        "This was the debut performance for Jessica Martin as Mags the Werewolf.",
        "After the location filming had been completed, the studio sessions were cancelled because of asbestos contamination. At first it was thought that the serial would have to be abandoned, but eventually it was found possible to erect a tent in the car park at Elstree Studios and film there.",
        "This story was originally a three-parter but was expanded, at the request of the producers, to four episodes.",
        "Sylvester McCoy was coached in magic by Geoffrey Durham, otherwise known as The Great Soprendo, for the sleight-of-hand and other magic trick scenes.",
        "The rap song heard during the serial was the first original song commissioned for Doctor Who since \"The King's Song\" in The King's Demons."
      ]
    }
  ],
  "worldbuilding": {
    "in_universe_mythology": [
      "The Gods of Ragnarok"
    ],
    "real_world_cultural_references": [
      "The Circus of Doctor Lao"
    ],
    "individuals": [
      "Mags",
      "Captain Cook",
      "Nord",
      "Bellboy",
      "Flowerchild",
      "Deadbeat/Kingpin",
      "The Little Girl (God form)"
    ],
    "items": [
      "Flowerchild's earring",
      "Bellboy's remote control android",
      "The Gods of Ragnarok's eye medallion"
    ],
    "locations": [
      "Psychic Circus",
      "Segonax",
      "The Dark Circus"
    ]
  },
  "ratings": {
    "ratings_millions": [
      {
        "part": "1",
        "viewers": 5.0
      },
      {
        "part": "2",
        "viewers": 5.3
      },
      {
        "part": "3",
        "viewers": 4.8
      },
      {
        "part": "4",
        "viewers": 6.6
      }
    ]
  },
  "continuity": {
    "continuity_notes": [
      "Ace emerges from the TARDIS hallway at one point wearing the Fourth Doctor's multicolour scarf, as first seen in TV: Robot, and Melanie Bush's turquoise and white blouse from TV: Paradise Towers.",
      "The Fifth Doctor previously encountered werewolves in AUDIO: Loups-Garoux.",
      "Mags will later leave the Circus when her transformations will become too strong to be controlled. She will then join the Doctor on his travels in AUDIO: The Monsters of Gokroth, becoming one of his companions.",
      "Later, during AUDIO: The Psychic Circus, the Seventh Doctor will find out that The Master was behind the foundation of the Circus and its subjugation to the Gods of Ragnarok."
    ]
  },
  "plot": [
    {
      "plot_summary": "The Seventh Doctor and Ace head for the Psychic Circus on the planet Segonax, where they meet a disparate group of performers and visitors, including a self-centred explorer named Captain Cook, his companion Mags and a biker known as Nord. The circus itself is dominated by the sinister chief clown and his deadly troupe of robot clowns, who organise a talent contest in which all visitors take part. The audience consists of just a strange family — mother, father and daughter — who are in reality the Gods of Ragnarok, powerful creatures with an insatiable craving for entertainment who invariably destroy those who fail to please them. With Ace's help, the Doctor ends the gods' influence on Segonax and returns the circus to the control of its original owners."
    },
    {
      "plot_summary": "In part one, the Doctor and Ace travel to the Psychic Circus on the planet Segonax, where they meet a variety of characters including Captain Cook, Mags, Nord, Bellboy and Flowerchild. The chief clown is hunting down the performers who have escaped the circus. In part two, the Doctor enters the talent contest along with the other captives, while Ace evades the chief clown and meets Bellboy. In part three, Ace defeats the malfunctioning robot clowns and learns more about the circus's history, while the Doctor confronts the family who are revealed to be the Gods of Ragnarok. In part four, the Doctor battles the Gods of Ragnarok, who feed on entertainment, and with Ace's help is able to destroy their influence over the circus, allowing it to return to its original owners."
    }
  ]
}