{
    "title": "Revelation of the Daleks",
    "air_date": "23 March 1985",
    "num_episodes": 2,
    "episode_titles": [
        "Part One",
        "Part Two"
    ],
    "episode_duration": 25,
    "writers": [
        "Eric Saward"
    ],
    "directors": [
        "Graeme Harper"
    ],
    "media_format": "Color",
    "dialogue_triumphs": [
        "Vogel: 'I'm a past master at the double entry.'",
        "The Doctor to Peri: 'We go over the top.'",
        "A conversation that turns out to be about the Doctor's broken fob watch: 'I rarely use it, I shall learn to live without it.' 'I'll find you a new one.'"
    ],
    "dialogue_disasters": [
        "Grigory goes Trek: 'I'm a doctor, not a magician!'",
        "Peri on the DJ: 'I'm curious to know where he picked up his patter.'"
    ],
    "goofs": [
        "Davros's dialogue is often inaudible.",
        "Davros's chair is missing a bit of its base when hovering, leading to Orcini passing his leg through it.",
        "Why does Davros lure the Doctor across the galaxy to drop a polystyrene statue full of fake blood onto him?",
        "If she'd thought a moment, Peri would surely have realised that the Doctor couldn't possibly be killed on this visit, since the grave must already have had a body in it.",
        "When captured, how does the Doctor know that Davros is still alive?",
        "Tasambeker stabs Jobel without pushing the plunger on the syringe."
    ],
    "continuity_notes": [
        {
            "name": "Davros",
            "type": "Character",
            "description": "Creator of the Daleks, now with ambitions to be emperor. Can fire electric bolts from his hand and create convincing robotic or cloned heads of himself.",
            "origin": "Skaro",
            "current_status": "Loses his hand in this story, blood is green."
        },
        {
            "name": "Daleks",
            "type": "Character",
            "description": "Two factions: Davros's white and gold Daleks, and the Supreme Dalek's grey Daleks.",
            "origin": "Skaro",
            "current_status": "Imperial Daleks rebuilding after a military defeat, known and feared but not actively aggressive towards humanity."
        },
        {
            "name": "The Doctor",
            "type": "Character",
            "description": "Time Lord protagonist, still a vegetarian.",
            "origin": "Gallifrey",
            "current_status": "Makes nut rolls for Peri, shows compassion and 'Doctorish' behavior."
        },
        {
            "name": "Bastic-headed bullets",
            "type": "Object",
            "description": "Ammunition capable of destroying Daleks.",
            "origin": null,
            "current_status": "In use against Daleks."
        }
    ],
    "technobabble": null,
    "roots": [
        "Evelyn Waugh's The Loved One",
        "Soylent Green",
        "Callan (professional killer plus smelly sidekick)",
        "The Avengers ('Bizarre')",
        "American Graffiti",
        "Dark Star (DJ)"
    ],
    "links": [
        "Remembrance of the Daleks",
        "Resurrection of the Daleks",
        "Destiny of the Daleks",
        "Genesis of the Daleks",
        "Pyramids of Mars"
    ],
    "locations": [
        {
            "name": "Nekros",
            "type": "Location",
            "description": "Planet where the story takes place, known for its 'Staff of Life' flowers.",
            "origin": null,
            "current_status": "Setting for the current story, some time after 'Destiny of the Daleks' and 'Resurrection of the Daleks'."
        }
    ],
    "future_history": "The galaxy has been freed of famine, and is ruled by a male president called Vargos.",
    "untold_adventures": [
        "The Doctor's friendship with Arthur Stengos, the agronomist.",
        "Possible previous encounters with the Grand Order of Oberon."
    ],
    "qv": [
        "The Second Dalek History, 'Genesis of the Daleks'",
        "The Doctor's Age, 'Pyramids of Mars'"
    ],
    "additional_notes": "Fashion Victims: The blue cloaks look rather good, and even Peri's casual wear is subtle this time. But as for Jobel… Oh dear.",
    "bottom_line": "It looks wonderful and the plot is just about consistent and straightforward. The lack of involvement of the Doctor (and the Daleks!) is startling, showing that Eric Saward is once again more interested in telling mercenary stories, but at least this one's interesting and well played. William Gaunt scores hugely for playing against the pathetic and cynical nature of his lines, managing to make Orcini genuinely noble instead of merely a paper tiger. Alexei Sayle surprises by being sweet and subtle (and one of the few sentient life forms in the galaxy who doesn't want to molest Peri) and the Doctor finally gets to be Doctorish, with proper doses of compassion. Quite promising for the future, really."
}