{
    "title": "Timelash",
    "air_date": "9 March 1985",
    "num_episodes": 2,
    "episode_titles": [
        "Part One",
        "Part Two"
    ],
    "episode_duration": 25,
    "writers": [
        "Glen McCoy"
    ],
    "directors": [
        "Pennant Roberts"
    ],
    "media_format": "Color",
    "dialogue_triumphs": [
        "The waves of time wash us all clean."
    ],
    "dialogue_disasters": [
        "Avaunt thee, foul fanged fiend!"
    ],
    "goofs": [
        "In the power room, Maylin Renis, whilst adjusting some control dials, pulls one of them off and hurriedly replaces it.",
        "The Timelash is full of tinsel."
    ],
    "continuity_notes": [
        {
            "name": "Kontron tunnel",
            "type": "Object",
            "description": "A time corridor in space connecting Karfel to Earth in the 12th century near Inverness, Scotland.",
            "origin": "Karfel",
            "current_status": "Active and used in the story"
        },
        {
            "name": "Bendalypse warheads",
            "type": "Object",
            "description": "Gas weapons that kill anything with a central nervous system, but not effective against the reptilian Morlox.",
            "origin": null,
            "current_status": "Mentioned as a threat"
        },
        {
            "name": "Mustakozene-80",
            "type": "Object",
            "description": "A chemical that produces mutation on contact with human skin.",
            "origin": null,
            "current_status": "Mentioned as a dangerous substance"
        },
        {
            "name": "TARDIS",
            "type": "Object",
            "description": "The Doctor's time and space machine.",
            "origin": "Gallifrey",
            "current_status": "Equipped with color-coded seat belts"
        }
    ],
    "technobabble": [
        "You don't seem to realise the effect that time particles colliding within a multi-dimensional implosion field can have"
    ],
    "roots": [
        "H. G. Wells' works: The Time Machine (the Morlox, Vena), War of the Worlds (the Bandril/Karfel war), The Invisible Man (the Doctor experiments with crystals), The Island of Doctor Moreau (transformation of men into animals)",
        "Dune (Colin Baker's nod to the creator with the line 'To be perfectly frank, Herbert')",
        "Close Encounters of the Third Kind (android's line 'Yes indeed she was' in the same pitch as the communication music)"
    ],
    "links": [
        "Reference to 'Resurrection of the Daleks' when Peri asks about the Daleks' time corridor",
        "Peri recognizes a photograph of Jo Grant, suggesting the Doctor showed her pictures of previous companions"
    ],
    "locations": [
        {
            "name": "Karfel",
            "type": "Location",
            "description": "The main setting of the story, connected to Earth via the Kontron tunnel.",
            "origin": null,
            "current_status": "Location of primary events in the episode"
        },
        {
            "name": "Scotland, 1885",
            "type": "Location",
            "description": "Earth location connected to Karfel via the Kontron tunnel.",
            "origin": "Earth",
            "current_status": "Secondary setting in the story"
        }
    ],
    "future_history": null,
    "untold_adventures": [
        "An untelevised Third Doctor and Jo Grant adventure on Karfel where the Doctor saved the planet from an unspecified disaster and reported the scientist Magellan to the presidium for unethical experiments on the Morlox creatures"
    ],
    "qv": null,
    "additional_notes": "The episode features H. G. Wells as a character, giving him 'a story of his own' in the Doctor Who universe.",
    "bottom_line": "'Timelash', like all good Doctor Who, has a beginning, a middle and an end. Unfortunately it's also got another end tacked on, seemingly with little thought as to believability. Tacky sets and some dodgy acting add up to a mess, although it's nowhere near as bad as its reputation."
}