{
  "metadata": {
    "title": "The Mind Robber",
    "series": "Doctor Who",
    "season": "6",
    "episode_number": 2,
    "release_date": "14 September - 12 October 1968",
    "writer": "Peter Ling",
    "director": "David Maloney",
    "producer": "Peter Bryant",
    "main_actors": [
      "Patrick Troughton",
      "Frazer Hines",
      "Wendy Padbury"
    ],
    "time_reference": "Outside of normal time and space"
  },
  "cast_crew": [
    {
      "cast": {
        "name": "Patrick Troughton",
        "role": "Dr. Who"
      },
      "crew": {
        "name": "Peter Ling",
        "role": "Writer"
      }
    },
    {
      "cast": {
        "name": "Frazer Hines",
        "role": "Jamie McCrimmon"
      },
      "uncredited_cast": {
        "name": "Hamish Wilson",
        "role": "Jamie McCrimmon"
      },
      "crew": {
        "name": "David Maloney",
        "role": "Director"
      }
    },
    {
      "cast": {
        "name": "Wendy Padbury",
        "role": "Zoe Heriot"
      },
      "crew": {
        "name": "Peter Bryant",
        "role": "Producer"
      }
    }
  ],
  "home_media": [
    {
      "releases": {
        "media_type": "DVD",
        "date": "7 March 2005",
        "special_features": [
          "Commentary by Frazer Hines, Wendy Padbury, David Maloney and Hamish Wilson",
          "The Fact of Fiction: The Making of 'The Mind Robber'",
          "Highlander - The Jamie McCrimmon Story",
          "Basil Brush sketch from 1975",
          "Production Subtitles",
          "Easter Egg: Continuity announcements for 1992 repeat airing"
        ]
      }
    },
    {
      "releases": {
        "media_type": "VHS",
        "date": "May 1990",
        "special_features": []
      }
    }
  ],
  "story_notes": [
    {
      "notes": [
        "Working titles for this story were The Fact of Fiction and Man Power (also sometimes referred to as Manpower).",
        "The existing scripts for episodes one, two and three are titled Manpower, Another World and The Fact of Fiction respectively, even though individual episode titles were by this time no longer being used.",
        "Radio Times credits Bernard Horsfall as \"A Stranger\" for episodes two and three, and as \"Gulliver\" for episodes four and five.",
        "Christopher and David Reynolds' surname is spelt as \"Reynolds\" for episode two, and as \"Reynalds\" in episode five and for both episodes in Radio Times.",
        "Philip Ryan (Redcoat) is credited on-screen for episode three, but is uncredited in Radio Times.",
        "Episode one is the only episode in the series' history to have no writer's credit, either on-screen or in Radio Times.",
        "This story was planned as a four-part serial, but was increased to five after the previous adventure, The Dominators, was reduced from six to five episodes."
      ]
    }
  ],
  "worldbuilding": {
    "in_universe_mythology": [
      "Gulliver's Travels",
      "Rapunzel",
      "The Karkus",
      "Lemuel Gulliver",
      "The Minotaur"
    ],
    "real_world_cultural_references": [
      "Batman",
      "Edith Nesbitt's works",
      "Walter de la Mare's poem The Listeners"
    ],
    "individuals": [
      "The Master",
      "The Master Brain"
    ],
    "items": [
      "Anti-molecular ray disintegrator",
      "Sword",
      "Dictionary",
      "Wishing well",
      "Safe"
    ],
    "locations": [
      "Land of Fiction",
      "Walled citadel atop the largest cliff in the kingdom",
      "Forest of letters and words"
    ]
  },
  "ratings": {
    "ratings_millions": [
      {
        "part": "Episode 1",
        "viewers": 6.6
      },
      {
        "part": "Episode 2",
        "viewers": 6.5
      },
      {
        "part": "Episode 3",
        "viewers": 7.2
      },
      {
        "part": "Episode 4",
        "viewers": 7.3
      },
      {
        "part": "Episode 5",
        "viewers": 6.7
      }
    ]
  },
  "continuity": {
    "continuity_notes": [
      "The Doctor dematerialises the TARDIS to escape a volcanic eruption on Dulkis.",
      "The Doctor would later return to the land of fiction later in the same incarnation, as well as in their Sixth, Seventh, and Thirteenth incarnations.",
      "The Fourth Doctor would later return to the white void, and the Tenth would later briefly believe themselves to have returned there.",
      "The Third Doctor later meets the real Minotaur and also encounters the real maze.",
      "The Sixth Doctor reminds Jamie how his face changed in the Land of Fiction."
    ]
  },
  "plot": [
    {
      "plot_summary": "To escape from the volcanic eruption on Dulkis, the Second Doctor uses an emergency unit to move the TARDIS out of normal time and space. The travellers find themselves in an endless void where they are menaced by white robots. Having regained the safety of the TARDIS, they believe they have escaped — until the ship explodes. They find themselves in a land of fiction, where they are hunted by life-size clockwork soldiers and encounter characters like Rapunzel, the Karkus, and Swift's Lemuel Gulliver. This domain is presided over by a man known only as the Master — a prolific English writer from 1926 — who in turn is controlled by a Master Brain computer. The Doctor engages the Master in a battle of wills using fictional characters. Zoe and Jamie overload the Master Brain, freeing the Master. In the confusion, the White Robots destroy the computer, returning the travellers to reality."
    }
  ]
}