{
  "metadata": {
    "title": "The Invasion",
    "series": "Doctor Who",
    "season": "6",
    "episode_number": 3,
    "release_date": "2 November - 21 December 1968",
    "writer": "Derrick Sherwin",
    "director": "Douglas Camfield",
    "producer": "Peter Bryant",
    "main_actors": [
      "Patrick Troughton",
      "Frazer Hines",
      "Wendy Padbury"
    ],
    "time_reference": "circa 1979"
  },
  "cast_crew": [
    {
      "cast": {
        "name": "Patrick Troughton",
        "role": "Dr. Who"
      },
      "crew": {
        "name": "Douglas Camfield",
        "role": "Director"
      }
    },
    {
      "cast": {
        "name": "Frazer Hines",
        "role": "Jamie McCrimmon"
      },
      "crew": {
        "name": "Terrance Dicks",
        "role": "Script Editor"
      }
    },
    {
      "cast": {
        "name": "Wendy Padbury",
        "role": "Zoe Heriot"
      },
      "crew": {
        "name": "Peter Bryant",
        "role": "Producer"
      }
    }
  ],
  "home_media": [
    {
      "releases": {
        "media_type": "DVD",
        "date": "6 November 2006",
        "special_features": [
          "Commentary on the animated episode one by James Goss, Steve Maher and Mark Ayres",
          "Commentary on episodes two to eight by Frazer Hines, Wendy Padbury, Nicholas Courtney and Chris D'Oyly John",
          "Flash Frames - A featurette about the creation of the animated episodes one and four, including interviews with the animation team at Cosgrove Hall",
          "Love Off-Air - An affectionate tribute to the people dedicated enough to capture the soundtracks of Doctor Who in the 1960s, enabling the recreated episodes on this DVD",
          "Trailers - Two animated trailers",
          "Character Design - Showcasing Steve Maher's character design drawings and animation tests",
          "Evolution of The Invasion - Cast and crew recall the making of The Invasion, featuring contributions from Padbury, Hines, Courtney and D'Oyly John, plus Kevin Stoney (Vaughn), Sally Faulkner (Isobel), Peter Halliday (Packer), Edward Burnham (Watkins), Ian Fairbairn (Gregory) and Terrance Dicks (script editor)",
          "VHS Links - Nicholas Courtney's links from the 1993 video release of The Invasion",
          "Photo Gallery - Includes music by Don Harper and John Baker as well as special sound by Brian Hodgson",
          "Production Subtitles"
        ]
      }
    }
  ],
  "story_notes": [
    {
      "notes": [
        "This story had a working title of Return of the Cybermen, which was later changed to The Invasion to keep the Cybermen's reappearance a surprise until episode four.",
        "It was originally conceived as a four-part story and got expanded to eight when the next story, The Dreamspinner, fell through.",
        "Episodes one and four are currently missing from the BBC film archive. However, the two missing episodes were animated for the DVD release in 2006.",
        "This story marked the debut of Terrance Dicks as script editor and his first credited contribution to the series.",
        "This story is also placed 'some months' before Spearhead from Space, according to dialogue in that story.",
        "It cost £24,796, being the second most expensive serial at the time, after The Daleks' Master Plan, which cost £31,596.",
        "While the Cybermen would continue to change their appearance on the series, this story set the basic design for them, first developed for this story by Bobi Bartlett, through the 1980s."
      ]
    }
  ],
  "worldbuilding": {
    "in_universe_mythology": [
      "The Cybermen have a spaceship hidden behind the far side of the Moon."
    ],
    "real_world_cultural_references": [
      "Kilroy Was Here can be seen written in the lift shaft.",
      "Isobel plays Teddy Bears' Picnic on her gramophone."
    ],
    "individuals": [
      "Tobias Vaughn",
      "Brigadier Lethbridge-Stewart",
      "Corporal (later Sergeant) John Benton",
      "Professor Travers",
      "Professor Watkins",
      "Isobel",
      "Gordon Jones"
    ],
    "items": [
      "The visual stabiliser circuit controls the TARDIS's outward appearance; if the circuit is removed, the TARDIS is rendered invisible.",
      "The Doctor uses his recorder as a telescope."
    ],
    "locations": [
      "London",
      "International Electromatic Headquarters",
      "Henlow Downs",
      "Churchill College, Cambridge"
    ]
  },
  "ratings": {
    "ratings_millions": [
      {
        "part": "Episode one",
        "viewers": 7.3
      },
      {
        "part": "Episode two",
        "viewers": 7.1
      },
      {
        "part": "Episode three",
        "viewers": 7.1
      },
      {
        "part": "Episode four",
        "viewers": 6.4
      },
      {
        "part": "Episode five",
        "viewers": 6.7
      },
      {
        "part": "Episode six",
        "viewers": 6.5
      },
      {
        "part": "Episode seven",
        "viewers": 7.2
      },
      {
        "part": "Episode eight",
        "viewers": 7.0
      }
    ]
  },
  "continuity": {
    "continuity_notes": [
      "Dialogue places this story four years after the events of The Web of Fear.",
      "This story is also placed 'some months' before Spearhead from Space, according to dialogue in that story."
    ]
  },
  "plot": [
    {
      "plot_summary": "The Doctor, Jamie and Zoe return to Earth and meet up with an old friend, former Colonel and now Brigadier, Lethbridge-Stewart - now in charge of the newly formed UNIT who are investigating electronics manufacturer International Electromatics. IE's managing director, Tobias Vaughn, is working with the Cybermen. He is planning to transmit a hypnotic signal through IE's products, leaving the Earth paralysed and allowing the Cybermen to emerge from the London sewers and take over..."
    },
    {
      "plot_summary": "The Doctor and Jamie discover that Vaughn is working with the Cybermen, who are using his company's products to broadcast a hypnotic signal that will paralyze humanity and allow the Cybermen to emerge from the sewers and invade. UNIT, led by the Brigadier, try to stop the Cybermen's plot, while the Doctor tries to find a way to disrupt the Cybermen's transmitter and defeat their invasion."
    },
    {
      "plot_summary": "The Doctor and his companions uncover a plot by electronics magnate Tobias Vaughn to work with the Cybermen and use his company's products to broadcast a hypnotic signal, allowing the Cybermen to emerge from the London sewers and take over. UNIT, led by the Brigadier, tries to stop the invasion, while the Doctor searches for a way to disrupt the Cybermen's transmitter and defeat their plans."
    },
    {
      "plot_summary": "The Doctor, Jamie and Zoe discover that Tobias Vaughn, the head of the International Electromatics company, is collaborating with the Cybermen. Vaughn plans to use IE's products to transmit a hypnotic signal that will paralyze humanity, allowing the Cybermen to emerge from the sewers and conquer the Earth. UNIT, led by the Brigadier, works to stop the Cybermen's invasion, while the Doctor searches for a way to disrupt their transmitter and defeat their plot."
    },
    {
      "plot_summary": "The Second Doctor, Jamie and Zoe arrive on Earth and team up with the newly formed United Nations Intelligence Taskforce (UNIT), led by the Brigadier, to investigate the activities of the International Electromatics company and its director, Tobias Vaughn. They uncover Vaughn's collaboration with the Cybermen, who plan to use IE's products to broadcast a mind-control signal and allow the Cybermen to emerge from the sewers and conquer the planet. The Doctor works to find a way to stop the Cybermen's invasion while UNIT battles to hold them off."
    },
    {
      "plot_summary": "The Doctor, Jamie and Zoe discover that the head of the International Electromatics company, Tobias Vaughn, is working with the Cybermen. Vaughn plans to use IE's products to transmit a hypnotic signal that will paralyze humanity, allowing the Cybermen to emerge from the London sewers and take over. UNIT, led by the Brigadier, tries to stop the Cybermen's invasion, while the Doctor searches for a way to disrupt their transmitter and defeat their plot."
    },
    {
      "plot_summary": "The Second Doctor, Jamie and Zoe return to Earth and team up with the newly formed United Nations Intelligence Taskforce (UNIT), led by the Brigadier, to investigate the activities of the International Electromatics company and its director, Tobias Vaughn. They uncover Vaughn's collaboration with the Cybermen, who plan to use IE's products to broadcast a mind-control signal and allow the Cybermen to emerge from the sewers and conquer the planet. The Doctor works to find a way to stop the Cybermen's invasion while UNIT battles to hold them off."
    },
    {
      "plot_summary": "The Doctor, Jamie and Zoe discover that Tobias Vaughn, the head of the International Electromatics company, is working with the Cybermen. Vaughn plans to use IE's products to transmit a hypnotic signal that will paralyze humanity, allowing the Cybermen to emerge from the London sewers and take over. UNIT, led by the Brigadier, tries to stop the Cybermen's invasion, while the Doctor searches for a way to disrupt their transmitter and defeat their plot."
    }
  ]
}