{
  "metadata": {
    "title": "The Highlanders",
    "series": "Doctor Who",
    "season": "4",
    "episode_number": 4,
    "release_date": "17 December 1966 - 7 January 1967",
    "writer": "Elwyn Jones, Gerry Davis",
    "director": "Hugh David",
    "producer": "Innes Lloyd",
    "main_actors": [
      "Patrick Troughton",
      "Michael Craze",
      "Anneke Wills",
      "Frazer Hines"
    ],
    "time_reference": "After the Battle of Culloden, 1746"
  },
  "cast_crew": [
    {
      "cast": {
        "name": "Patrick Troughton",
        "role": "The Doctor"
      },
      "crew": {
        "name": "Elwyn Jones",
        "role": "Writer"
      }
    },
    {
      "cast": {
        "name": "Michael Craze",
        "role": "Ben Jackson"
      },
      "crew": {
        "name": "Gerry Davis",
        "role": "Writer, Script Editor"
      }
    },
    {
      "cast": {
        "name": "Anneke Wills",
        "role": "Polly"
      },
      "crew": {
        "name": "Hugh David",
        "role": "Director"
      }
    },
    {
      "cast": {
        "name": "Frazer Hines",
        "role": "Jamie McCrimmon"
      },
      "crew": {
        "name": "Innes Lloyd",
        "role": "Producer"
      }
    }
  ],
  "home_media": [
    {},
    {},
    {},
    {}
  ],
  "story_notes": [
    {
      "notes": [
        "This story had the working title of Culloden.",
        "No episodes of this four-part story exist in the BBC Archives.",
        "The next 'pure historical' serial, Black Orchid, would not be broadcast until 1982.",
        "This is the last historical to use events from real history, as Orchid is entirely fictional.",
        "Episode 1 of this story is the first that cannot be watched 'moving' in any form, either surviving or animated, since The Smugglers Episode 4.",
        "Elwyn Jones, who was commissioned to write the story, in fact carried out no work on it, as he was busy working on Z-Cars and its spinoff Softly-Softly.",
        "Jamie was originally never meant to become a companion, but Frazer Hines was asked to join the show after filming was nearly complete.",
        "This is the only Doctor Who story written by Gerry Davis not to feature the Cybermen.",
        "Solicitor Grey is the only real-world historical person to appear in the story.",
        "Stuntman Peter Diamond accidentally nicked Frazer Hines' eyebrow with a sword while filming.",
        "This story was originally going to have its complete television soundtrack released as an extra on the 2020 special edition release of The Power of the Daleks, but it was ultimately excluded."
      ]
    }
  ],
  "worldbuilding": {
    "in_universe_mythology": [
      "Prince Charles Edward ('Bonnie Prince Charlie')"
    ],
    "real_world_cultural_references": [
      "Nell Gwyn",
      "Houdini"
    ],
    "individuals": [
      "Colin McLaren",
      "Alexander McLaren",
      "Kirsty McLaren",
      "Jamie McCrimmon",
      "Lieutenant Algernon Ffinch",
      "Solicitor Grey",
      "Cedric Perkins",
      "Willie Mackay",
      "Trask",
      "Colonel Attwood"
    ],
    "items": [
      "Prince's standard",
      "Spyglass",
      "Magnifying glass",
      "Matches"
    ],
    "locations": [
      "Culloden Moor",
      "Inverness",
      "Annabelle (ship)",
      "Sea Eagle (inn)",
      "France"
    ]
  },
  "ratings": {
    "ratings_millions": [
      {
        "part": "Episode 1",
        "viewers": 6.7
      },
      {
        "part": "Episode 2",
        "viewers": 6.8
      },
      {
        "part": "Episode 3",
        "viewers": 7.4
      },
      {
        "part": "Episode 4",
        "viewers": 7.3
      }
    ]
  },
  "continuity": {
    "continuity_notes": [
      "Polly is pleased that she does not have to dress up in boys' clothes, as she had to in her last adventure in the past.",
      "The Doctor, Jamie and their companion Zoe Heriot would later meet Bonnie Prince Charlie's paternal grandparents, King James II and Queen Mary of Modena, during the Glorious Revolution in November 1688.",
      "After Jamie was returned to his native time by the Time Lords with his memories of travelling with the Doctor suppressed, he and Kirsty married and had at least eight children.",
      "One of their distant descendants was a 21st century history student at the University of Edinburgh named Heather McCrimmon, who became a companion of the Tenth Doctor."
    ]
  },
  "plot": [
    {
      "plot_summary": "The time travellers arrive in Scotland just after the Battle of Culloden. The Second Doctor gains the trust of a small band of fleeing Jacobites by offering to tend to their wounded Laird, Colin McLaren. While Polly and the Laird's daughter, Kirsty, are away fetching water, he and the others are all captured by Redcoat troops commanded by Lieutenant Algernon Ffinch. Grey, a crooked solicitor who sells prisoners to slavery for transportation in the West Indies, secures the group into his custody. Polly and Kirsty blackmail Ffinch into helping, and the Doctor wins the day by smuggling arms to the Highlanders who are being held on board a stolen ship, the Annabelle. Grey and the ship's unscrupulous captain, Trask, are overpowered and the vessel is returned to its rightful owner, Willie Mackay, who agrees to take the rebels to safety in France. The Doctor, Polly and Ben return to the Doctor's TARDIS, where they are joined on their travels by the young piper Jamie McCrimmon."
    }
  ]
}