{
  "metadata": {
    "title": "The War Games",
    "series": "Doctor Who",
    "season": "6",
    "episode_number": 7,
    "release_date": "19 April - 21 June 1969",
    "writer": "Terrance Dicks, Malcolm Hulke",
    "director": "David Maloney",
    "producer": "Derrick Sherwin",
    "main_actors": [
      "Patrick Troughton",
      "Frazer Hines",
      "Wendy Padbury"
    ],
    "time_reference": "The Rassilon Era"
  },
  "cast_crew": [
    {
      "cast": {
        "name": "Patrick Troughton",
        "role": "Doctor Who"
      },
      "crew": {
        "name": "Terrance Dicks",
        "role": "Writer"
      }
    },
    {
      "cast": {
        "name": "Frazer Hines",
        "role": "Jamie McCrimmon"
      },
      "crew": {
        "name": "Malcolm Hulke",
        "role": "Writer"
      }
    },
    {
      "cast": {
        "name": "Wendy Padbury",
        "role": "Zoe Heriot"
      },
      "crew": {
        "name": "David Maloney",
        "role": "Director"
      }
    },
    {
      "cast": {
        "name": "Jane Sherwin",
        "role": "Lady Jennifer Buckingham"
      },
      "crew": {
        "name": "Derrick Sherwin",
        "role": "Producer"
      }
    }
  ],
  "home_media": [
    {
      "releases": {
        "media_type": "DVD",
        "date": "6 July 2009",
        "special_features": [
          "Commentary by Frazer Hines, Wendy Padbury, Philip Madoc, Jane Sherwin, Graham Weston, Terrance Dicks and Derrick Sherwin",
          "War Zone: The End of an Era - The making of The War Games",
          "Shades of Grey - A look back at the black and white era of Doctor Who",
          "Now and Then - The locations of The War Games, forty years on",
          "The Doctor's Composer - Dudley Simpson discusses his first five years on Doctor Who",
          "Sylvia James: In Conversation - Make-up designer Sylvia James talks about her work on Doctor Who",
          "Talking About Regeneration - The Doctor's many lives discussed",
          "Time Zones - Historians discuss the reality behind the various conflicts featured in The War Games",
          "Stripped for Action - A look at the comic strip adventures of the Second Doctor",
          "On Target - Malcolm Hulke - A profile of the popular Doctor Who author and his novelisations",
          "Devious - A 12-minute excerpt from the legendary unfinished fan film set between The War Games and Spearhead from Space"
        ]
      }
    }
  ],
  "story_notes": [
    {
      "notes": [
        "This was the longest Doctor Who story to survive the purging of the BBC's videotape archive and the only 10-part serial to survive intact from the black and white era.",
        "It was the first time in the history of Doctor Who that either a companion or an incarnation of the Doctor made their last regular appearance in the concluding episode of a season.",
        "It was also the first time that an incarnation of the Doctor and all his companions were written out of the program in the same story.",
        "Unlike most regeneration stories, the new lead actor and the Doctor's next incarnation did not appear in the final moments of the tenth part.",
        "This marks the first and so far only time in the show's history that a story featured the last regular appearance of one of the Doctor's incumbent incarnations without revealing the succeeding incarnation at the end."
      ]
    }
  ],
  "worldbuilding": {
    "in_universe_mythology": [
      "The Doctor recalls fighting the Quarks, Robot Yeti, Ice Warriors, Cybermen, and Daleks in the past."
    ],
    "real_world_cultural_references": [
      "The story features various time zones based on real world historical conflicts such as the Roman era, Greek era, Crimean War, World War I, Peninsular War, American Civil War, Mexican Civil War, English Civil War, Thirty-Years War, Boer War, and Russo-Japanese War."
    ],
    "individuals": [
      "Carstairs",
      "Jennifer",
      "The War Chief",
      "The First Time Lord",
      "The War Lord"
    ],
    "items": [
      "The Doctor's recorder",
      "The sonic screwdriver",
      "The SIDRAT time machine"
    ],
    "locations": [
      "War World",
      "Gallifrey"
    ]
  },
  "ratings": {
    "ratings_millions": [
      {
        "part": "Episode 1",
        "viewers": 5.5
      },
      {
        "part": "Episode 2",
        "viewers": 6.3
      },
      {
        "part": "Episode 3",
        "viewers": 5.1
      },
      {
        "part": "Episode 4",
        "viewers": 5.7
      },
      {
        "part": "Episode 5",
        "viewers": 5.1
      },
      {
        "part": "Episode 6",
        "viewers": 4.2
      },
      {
        "part": "Episode 7",
        "viewers": 4.9
      },
      {
        "part": "Episode 8",
        "viewers": 3.5
      },
      {
        "part": "Episode 9",
        "viewers": 4.1
      },
      {
        "part": "Episode 10",
        "viewers": 5.0
      }
    ]
  },
  "continuity": {
    "continuity_notes": [
      "This story featured the first appearance of the Time Lords and Gallifrey, the Doctor's home planet.",
      "It was the first story in which Derrick Sherwin was credited as producer.",
      "This story also led directly into the Sixth Doctor's first televised appearance in Spearhead from Space."
    ]
  },
  "plot": [
    {
      "plot_summary": "The Doctor, Jamie, and Zoe arrive on an unnamed planet, initially thinking they are in World War I, but soon realizing they are in one of many 'War Zones' overseen by the War Lords, who have kidnapped human soldiers to create an army to conquer the galaxy. The Doctor discovers that the War Chief is also a member of his own race, a Time Lord. The Doctor cannot solve the problem alone, and his days of wandering may be at an end. After being captured and put on trial, the Doctor contacts the Time Lords, who intervene and return the human soldiers to their original time periods. The Doctor is then forced to regenerate and is exiled to 20th century Earth, with his TARDIS abilities removed."
    }
  ]
}