{
  "metadata": {
    "title": "The Faceless Ones",
    "series": "Doctor Who",
    "season": "4",
    "episode_number": 8,
    "release_date": "8 April - 13 May 1967",
    "writer": "David Ellis, Malcolm Hulke",
    "director": "Gerry Mill",
    "producer": "Innes Lloyd",
    "main_actors": [
      "Patrick Troughton",
      "Michael Craze",
      "Anneke Wills",
      "Frazer Hines"
    ],
    "time_reference": "20 July 1966"
  },
  "cast_crew": [
    {
      "cast": {
        "name": "Patrick Troughton",
        "role": "Dr. Who"
      },
      "crew": {
        "name": "David Ellis",
        "role": "Writer"
      }
    },
    {
      "cast": {
        "name": "Michael Craze",
        "role": "Ben Jackson"
      },
      "crew": {
        "name": "Malcolm Hulke",
        "role": "Writer"
      }
    },
    {
      "cast": {
        "name": "Anneke Wills",
        "role": "Polly"
      },
      "crew": {
        "name": "Gerry Mill",
        "role": "Director"
      }
    },
    {
      "cast": {
        "name": "Frazer Hines",
        "role": "Jamie McCrimmon"
      },
      "crew": {
        "name": "Innes Lloyd",
        "role": "Producer"
      }
    }
  ],
  "home_media": [
    {
      "releases": {
        "media_type": "DVD",
        "date": "16 March 2020",
        "details": "Fully animated version",
        "special_features": [
          "Commentary",
          "Making of documentary",
          "Episode reconstructions",
          "Surviving footage",
          "Camera scripts"
        ]
      }
    },
    {
      "releases": {
        "media_type": "BLU_RAY",
        "date": "16 March 2020",
        "details": "Fully animated version",
        "special_features": [
          "Commentary",
          "Making of documentary",
          "Episode reconstructions",
          "Surviving footage",
          "Camera scripts"
        ]
      }
    },
    {}
  ],
  "story_notes": [
    {
      "notes": [
        "Only episodes one and three exist in the BBC Archives",
        "The original theme tune arrangement by Delia Derbyshire was replaced with a new arrangement",
        "The story was originally titled 'The Chameleons'",
        "Michael Craze's final performance as Ben Jackson",
        "Pauline Collins was offered a regular role as Samantha Briggs but declined",
        "Some production issues with the Chameleon satellite prop"
      ]
    }
  ],
  "worldbuilding": {
    "in_universe_mythology": [
      "Chameleons",
      "Chameleon satellite"
    ],
    "real_world_cultural_references": [
      "Gatwick Airport",
      "RAF",
      "Vogue magazine",
      "Chelsea FC",
      "Whiskey"
    ],
    "individuals": [
      "The Director",
      "Blade",
      "Spencer",
      "Nurse Pinto",
      "Samantha Briggs",
      "DI Crossland",
      "DI Gascoigne"
    ],
    "items": [
      "Paralysis pen",
      "Armbands",
      "Chameleon ray-gun"
    ],
    "locations": [
      "Gatwick Airport",
      "Chameleon satellite",
      "Medical Centre",
      "Chameleon Tours hangar"
    ]
  },
  "ratings": {
    "ratings_millions": [
      {
        "part": "Episode 1",
        "viewers": 8.0
      },
      {
        "part": "Episode 2",
        "viewers": 6.4
      },
      {
        "part": "Episode 3",
        "viewers": 7.9
      },
      {
        "part": "Episode 4",
        "viewers": 6.9
      },
      {
        "part": "Episode 5",
        "viewers": 7.1
      },
      {
        "part": "Episode 6",
        "viewers": 8.0
      }
    ]
  },
  "continuity": {
    "continuity_notes": [
      "Ben is glad to have not met the Cybermen again",
      "The Doctor pretends to be a medical doctor",
      "The story leads directly into The Evil of the Daleks"
    ]
  },
  "plot": [
    {
      "plot_summary": "The TARDIS lands at Gatwick Airport in July 1966, where a number of young people have mysteriously gone missing, including the Doctor's companions Ben and Polly. The Doctor, Jamie, and Samantha Briggs, the sister of one of the missing youths, investigate and uncover a plot by the Chameleons, a race of shape-shifting aliens, who are abducting the young people and taking them to an orbiting satellite. The Doctor and his companions work to thwart the Chameleons' plans and rescue the captives."
    },
    {
      "plot_summary": "In episode 1, the Doctor, Ben, Polly, and Jamie arrive at Gatwick Airport and become embroiled in the mystery of the missing youths. Polly witnesses the murder of a man by a Chameleon pilot, and the Doctor and his companions begin investigating the Chameleon Tours travel agency, which is a front for the alien abductions."
    },
    {
      "plot_summary": "In episode 2, the Doctor and his companions continue their investigation, uncovering more evidence of the Chameleons' activities. Jamie and Samantha Briggs try to infiltrate the Chameleon Tours operation, while the Doctor confronts the Commandant about the disappearances."
    },
    {
      "plot_summary": "In episode 3, the Doctor discovers the Chameleons' true nature and their plan to transport the abducted youths to their orbiting satellite. He tries to convince the Commandant of the threat, while Jamie and Samantha face danger from the Chameleons."
    },
    {
      "plot_summary": "In episode 4, the Doctor and his companions are captured by the Chameleons and taken to the satellite, where they learn the full extent of the aliens' plans. Jamie escapes and tries to find a way to rescue the Doctor and the other abductees."
    },
    {
      "plot_summary": "In episode 5, the Doctor confronts the Chameleons' leader, the Director, and tries to negotiate the release of the captives. Meanwhile, Jamie discovers the miniaturized humans being held aboard the satellite."
    },
    {
      "plot_summary": "In episode 6, the Doctor and his companions devise a plan to stop the Chameleons and rescue the abducted youths. After a climactic showdown, the Doctor is able to thwart the Chameleons' plans and return the captives to Earth, but Ben and Polly decide to stay behind, while Jamie is saddened to see them go."
    }
  ]
}