{
  "metadata": {
    "title": "The Space Pirates",
    "series": "Doctor Who",
    "season": "6",
    "episode_number": 49,
    "release_date": "8 March - 12 April 1969",
    "writer": "Robert Holmes",
    "director": "Michael Hart",
    "producer": "Peter Bryant",
    "main_actors": [
      "Patrick Troughton",
      "Frazer Hines",
      "Wendy Padbury"
    ],
    "time_reference": "circa 22nd century"
  },
  "cast_crew": [
    {
      "cast": {
        "name": "Patrick Troughton",
        "role": "The Doctor"
      },
      "crew": {
        "name": "Robert Holmes",
        "role": "Writer"
      }
    },
    {
      "cast": {
        "name": "Frazer Hines",
        "role": "Jamie McCrimmon"
      },
      "crew": {
        "name": "Michael Hart",
        "role": "Director"
      }
    },
    {
      "cast": {
        "name": "Wendy Padbury",
        "role": "Zoe Heriot"
      },
      "crew": {
        "name": "Peter Bryant",
        "role": "Producer"
      }
    },
    {
      "cast": {
        "name": "Brian Peck",
        "role": "Dervish"
      },
      "crew": {
        "name": "Derrick Sherwin",
        "role": "Script Editor"
      }
    },
    {
      "cast": {
        "name": "Dudley Foster",
        "role": "Caven"
      },
      "crew": {
        "name": "Dudley Simpson",
        "role": "Music"
      }
    },
    {
      "cast": {
        "name": "Jack May",
        "role": "General Hermack"
      },
      "crew": {
        "name": "John Nathan-Turner",
        "role": "Floor Assistant"
      }
    }
  ],
  "home_media": [
    {},
    {}
  ],
  "story_notes": [
    {
      "notes": [
        "Only episode two of this six-part story exists in the BBC Archives as a 35mm black & white film telerecording.",
        "This is the most recent story from which episodes are still missing in their entirety.",
        "Episode six was effectively the series' first double banked episode.",
        "This was the last serial to be produced by Peter Bryant.",
        "This was the first story on which John Nathan-Turner was employed by the Doctor Who production office, albeit in the minor and uncredited role of floor assistant."
      ]
    }
  ],
  "worldbuilding": {
    "in_universe_mythology": [
      "Argonite is the most expensive mineral in the world."
    ],
    "real_world_cultural_references": [
      "Clear allusions were evident to western character types as were being seen at the time in Britain on American imports like Gunsmoke."
    ],
    "individuals": [
      "Suledin",
      "Muller"
    ],
    "items": [
      "Drawing pins",
      "Stethoscope",
      "Tuning fork",
      "Thermal lances",
      "Canisters",
      "Detonator"
    ],
    "locations": [
      "Space Beacon Alpha 4",
      "V-41",
      "LIZ 79",
      "Ta",
      "Lobos",
      "Pliny System"
    ]
  },
  "ratings": {
    "ratings_millions": [
      {
        "part": "1",
        "viewers": 5.8
      },
      {
        "part": "2",
        "viewers": 6.8
      },
      {
        "part": "3",
        "viewers": 6.4
      },
      {
        "part": "4",
        "viewers": 5.8
      },
      {
        "part": "5",
        "viewers": 5.5
      },
      {
        "part": "6",
        "viewers": 5.3
      }
    ]
  },
  "continuity": {
    "continuity_notes": [
      "Jamie mentions Caven, the Space Corps, Hermack, Madeleine and Dom Issigri to the Sixth Doctor, who mentions Ta.",
      "The Issigri Mining Company eventually became the Interplanetary Mining Corporation."
    ]
  },
  "plot": [
    {
      "plot_summary": "The TARDIS materialises in Earth's future on a space beacon just before it is attacked by pirates. The travellers find themselves trapped in a sealed section of the beacon. It is blown apart and flown to where the pirates will plunder it of the precious mineral argonite. They witness a conflict between the pirates and the Interstellar Space Corps, led by General Hermack and Major Warne. The ISC are convinced that the pirates' mastermind is an innocent yet eccentric space mining pioneer named Milo Clancey, while their true leader is a man named Caven. Caven has a secret base on the planet Ta. He is assisted by Madeleine Issigri, daughter of Clancey's ex-partner Dom, who — unknown to her — is now his captive. When Madeleine discovers Caven's full treachery, she helps to bring him to justice. The time travellers are given a lift back to the TARDIS by Clancey in his rickety old ship, the LIZ 79."
    },
    {
      "plot_summary": "The Doctor, Jamie and Zoe are trapped in a segment of the damaged space beacon. They are rescued by the eccentric prospector Milo Clancey, who helps them evade the pirates and get back to the TARDIS."
    },
    {
      "plot_summary": "The Doctor and his companions learn that the pirates, led by the treacherous Caven, have a secret base on the planet Ta. They team up with Clancey to try to stop Caven's plans."
    },
    {
      "plot_summary": "The Doctor, Jamie and Zoe are captured by Caven's men and locked in the study of Madeleine Issigri's father, Dom, who has been held captive for years. They manage to escape and warn Madeleine of Caven's true nature."
    },
    {
      "plot_summary": "Caven rigs Clancey's ship with a remote control device and a bomb, intending to destroy it and the Doctor and his companions. However, the Doctor is able to disarm the bomb just in time."
    },
    {
      "plot_summary": "The Doctor manages to defuse Caven's bomb just seconds before it is set to detonate, destroying Caven's base. The pirates are defeated and the time travellers are able to return to the TARDIS."
    }
  ]
}