{
  "metadata": {
    "title": "The Enemy of the World",
    "series": "Doctor Who",
    "season": "5",
    "episode_number": 4,
    "release_date": "23 December 1967",
    "release_end_date": "27 January 1968",
    "writer": "David Whitaker",
    "director": "Barry Letts",
    "producer": "Innes Lloyd",
    "main_actors": [
      "Patrick Troughton",
      "Frazer Hines",
      "Deborah Watling"
    ],
    "time_reference": "2018"
  },
  "cast_crew": [
    {
      "cast": {
        "name": "Patrick Troughton",
        "role": "Dr. Who/Salamander"
      },
      "crew": {
        "name": "David Whitaker",
        "role": "Writer"
      }
    },
    {
      "cast": {
        "name": "Frazer Hines",
        "role": "Jamie McCrimmon"
      },
      "crew": {
        "name": "Barry Letts",
        "role": "Director"
      }
    },
    {
      "cast": {
        "name": "Deborah Watling",
        "role": "Victoria Waterfield"
      },
      "crew": {
        "name": "Innes Lloyd",
        "role": "Producer"
      }
    }
  ],
  "home_media": [
    {
      "releases": {
        "media_type": "DVD",
        "date": "25 November 2013",
        "special_features": [
          "Audio Commentary",
          "Documentaries",
          "Restoration Footage",
          "Tributes",
          "PDF Materials"
        ]
      }
    }
  ],
  "story_notes": [
    {
      "notes": [
        "The Doctor impersonates the character Salamander, who is a doppelganger of the Second Doctor.",
        "This is the only story of Season 5 that does not feature a monster.",
        "The story was the last to be produced under the aegis of Doctor Who creator Sydney Newman.",
        "All but episode three of the serial were missing from the BBC archives until 2013, when the remaining episodes were recovered."
      ]
    }
  ],
  "worldbuilding": {
    "in_universe_mythology": [
      "The World Zone Authority runs the world, divided into large zones known as the United Zones."
    ],
    "real_world_cultural_references": [
      "Salamander refers to the Canadian wheat plains.",
      "Salamander was born in Merida, the state capital of Yucatan, Mexico.",
      "Salamander uses the Spanish word 'brujo' meaning 'sorcerer'."
    ],
    "individuals": [
      "Salamander",
      "Giles Kent",
      "Alexander Denes",
      "Donald Bruce"
    ],
    "items": [
      "The Mark Seven Sun Catcher, an orbital satellite that concentrates the sun's rays",
      "Salamander's security device"
    ],
    "locations": [
      "Australia",
      "Hungary",
      "Central European Zone",
      "Australasian Zone",
      "Kanowa research station",
      "Cape Arid",
      "Presidential Palace"
    ]
  },
  "ratings": {
    "ratings_millions": [
      {
        "part": "1",
        "viewers": 6.8
      },
      {
        "part": "2",
        "viewers": 7.6
      },
      {
        "part": "3",
        "viewers": 7.1
      },
      {
        "part": "4",
        "viewers": 7.8
      },
      {
        "part": "5",
        "viewers": 6.9
      },
      {
        "part": "6",
        "viewers": 8.3
      }
    ]
  },
  "continuity": {
    "continuity_notes": [
      "The end of this story leads into the beginning of The Web of Fear.",
      "This marks the second time that a doppelganger of the Doctor has been featured, following William Hartnell's double performance in The Massacre."
    ]
  },
  "plot": [
    {
      "plot_summary": "The Doctor, Jamie and Victoria arrive on a beach in Australia in 2018 and are mistaken for the scientist and politician Salamander, who is planning to take over the world. The Doctor agrees to impersonate Salamander to infiltrate his operation and expose his schemes."
    },
    {
      "plot_summary": "The Doctor, posing as Salamander, works with Giles Kent and Astrid to gather evidence of Salamander's manipulation of natural disasters and his plans for world domination. Meanwhile, Jamie and Victoria go undercover at Salamander's headquarters in the Central European Zone."
    },
    {
      "plot_summary": "Salamander has been engineering natural disasters to increase his power and eliminate his rivals. He tricks one of his scientists, Fedorin, into drinking poisoned wine. The Doctor's impersonation is nearly exposed when he is confronted by Salamander's deputy, Benik."
    },
    {
      "plot_summary": "The Doctor's impersonation of Salamander is tested as he tries to convince Bruce, the security chief, of Salamander's true nature. Meanwhile, Astrid and Giles work to rescue Jamie and Victoria, who have been captured at Salamander's headquarters."
    },
    {
      "plot_summary": "Salamander is revealed to have an underground colony where he has been keeping a group of scientists trapped, claiming the surface is uninhabitable. The Doctor confronts Salamander, leading to a chase through the caves. Giles tries to shoot Salamander but is thwarted."
    },
    {
      "plot_summary": "The Doctor confronts Salamander, who tries to escape in the TARDIS. A struggle ensues, and Salamander is blown out into the time vortex. The Doctor, Jamie and Victoria are able to return safely to the TARDIS."
    }
  ]
}