{
  "metadata": {
    "title": "The Dominators",
    "series": "Doctor Who",
    "season": "6",
    "episode_number": 1,
    "release_date": "10 August - 7 September 1968",
    "writer": "Norman Ashby",
    "director": "Morris Barry",
    "producer": "Peter Bryant",
    "main_actors": [
      "Patrick Troughton",
      "Frazer Hines",
      "Wendy Padbury"
    ],
    "time_reference": "Island of Death, Dulkis"
  },
  "cast_crew": [
    {
      "cast": {
        "name": "Patrick Troughton",
        "role": "Dr. Who"
      },
      "crew": {
        "name": "Morris Barry",
        "role": "Director"
      }
    },
    {
      "cast": {
        "name": "Frazer Hines",
        "role": "Jamie McCrimmon"
      },
      "crew": {
        "name": "Peter Bryant",
        "role": "Producer"
      }
    },
    {
      "cast": {
        "name": "Wendy Padbury",
        "role": "Zoe Heriot"
      },
      "crew": {
        "name": "Norman Ashby",
        "role": "Writer"
      }
    }
  ],
  "home_media": [
    {
      "releases": {
        "media_type": "DVD",
        "date": "12 July 2010",
        "special_features": [
          "Commentary by Frazer Hines, Wendy Padbury, Giles Block, Arthur Cox and Sylvia James",
          "Recharge and Equalise - Cast and crew look back on The Dominators",
          "Tomorrow's Times – The Second Doctor",
          "Radio Times Billings",
          "Production Information",
          "Subtitles",
          "Photo Gallery",
          "Coming Soon Trailer - Revenge of the Cybermen & Silver Nemesis",
          "Scottish Falsetto Sock Puppet Theatre (Catalogue Doctor Who)"
        ]
      }
    },
    {
      "releases": {
        "media_type": "VHS",
        "date": "September 1990",
        "details": "Episodes 4 and 5 in incomplete form",
        "special_features": []
      }
    },
    {}
  ],
  "story_notes": [
    {
      "notes": [
        "Originally a six-part story, edited down to five episodes",
        "Derrick Sherwin re-wrote the script with Terrance Dicks",
        "Haisman and Lincoln requested the pseudonym 'Norman Ashby'",
        "Episode 3 was recorded on 35mm black-and-white film",
        "Quark voices provided by Sheila Grant",
        "Jelly babies debut in Doctor Who",
        "Quarks were created to be the next merchandisable monster after the Daleks"
      ]
    }
  ],
  "worldbuilding": {
    "in_universe_mythology": [
      "Daleks",
      "Cybermen"
    ],
    "real_world_cultural_references": [
      "Latin-derived character names",
      "Quarks named after subatomic particles"
    ],
    "individuals": [
      "Rago",
      "Toba",
      "Cully",
      "Senex",
      "Balan",
      "Kando",
      "Teel"
    ],
    "items": [
      "Laser weapons",
      "Seed device"
    ],
    "locations": [
      "Island of Death",
      "Dulkis",
      "Dominator spaceship"
    ]
  },
  "ratings": {
    "ratings_millions": [
      {
        "part": "1",
        "viewers": 6.1
      },
      {
        "part": "2",
        "viewers": 5.9
      },
      {
        "part": "3",
        "viewers": 5.4
      },
      {
        "part": "4",
        "viewers": 7.5
      },
      {
        "part": "5",
        "viewers": 5.9
      }
    ]
  },
  "continuity": {
    "continuity_notes": [
      "The Doctor cites this story as an example of his fight against evil when on trial before the Time Lords in The War Games",
      "The Quarks later appeared in TV Comic and the Lethbridge-Stewart book series"
    ]
  },
  "plot": [
    {
      "plot_summary": "The Second Doctor, Jamie and Zoe land on the planet Dulkis, where two Dominators and their robot servants the Quarks have arrived to drain the planet's resources. The pacifist Dulcians are reluctant to resist, but the Doctor and his companions try to inspire them to stand up to the invaders. After various tests and confrontations, the Doctor manages to sabotage the Dominators' plan to destroy the planet, causing their ship to explode."
    },
    {
      "plot_summary": "The Dominators, Navigator Rago and Probationer Toba, land on the Island of Death on Dulkis and begin drilling into the planet's core to extract radioactive material to refuel their ship. When the Doctor, Jamie and Zoe arrive, they discover the Dominators and their robot servants the Quarks. The pacifist Dulcians, including Cully, Balan, Kando and Teel, are reluctant to resist the invasion. The Doctor and his companions try to stop the Dominators' plans, leading to a battle of wits and confrontations with the Quarks. Eventually the Doctor manages to sabotage the Dominators' plan by placing the seed device on their ship, causing it to explode just as it is taking off, saving Dulkis from destruction."
    },
    {
      "plot_summary": "The Dominators plan to drop a radioactive seed into Dulkis' core to refuel their ship. The Doctor, Jamie and Zoe try to inspire the pacifist Dulcians to resist the invasion, but they are reluctant. The Dominators capture the Doctor and Jamie, subjecting them to intelligence tests. Cully and Zoe attempt to gather evidence of the Dominators' presence. The Doctor discovers the Dominators' plan to drill into the planet's core and detonate a seed device to create a volcano. In the climax, the Doctor manages to place the seed device on the Dominators' ship, causing it to explode as it takes off, saving Dulkis."
    },
    {
      "plot_summary": "The Dominators, Rago and Toba, land on the Island of Death on Dulkis and begin drilling into the planet's core to extract radioactive material. The Doctor, Jamie and Zoe arrive and try to convince the pacifist Dulcians to resist the invasion, but they are reluctant. The Dominators capture the Doctor and Jamie, subjecting them to intelligence tests. Cully and Zoe gather evidence of the Dominators' presence. The Doctor discovers their plan to detonate a seed device in the planet's core, creating a volcano. In the finale, the Doctor manages to sabotage the Dominators' ship, causing it to explode as it takes off, saving Dulkis from destruction."
    },
    {
      "plot_summary": "The Dominators, Rago and Toba, land on the Island of Death on Dulkis and begin drilling into the planet's core to extract radioactive material to refuel their ship. The Doctor, Jamie and Zoe arrive and try to convince the pacifist Dulcians to resist the invasion. The Dominators capture the Doctor and Jamie, subjecting them to intelligence tests. Cully and Zoe gather evidence of the Dominators' presence. The Doctor discovers their plan to detonate a seed device in the planet's core, creating a volcano. In the climax, the Doctor manages to place the seed device on the Dominators' ship, causing it to explode as it takes off, saving Dulkis."
    }
  ]
}