{
  "metadata": {
    "title": "The Seeds of Death",
    "series": "Doctor Who",
    "season": "6",
    "episode_number": 5,
    "release_date": "25 January - 1 March 1969",
    "writer": "Brian Hayles",
    "director": "Michael Ferguson",
    "producer": "Peter Bryant",
    "main_actors": [
      "Patrick Troughton",
      "Frazer Hines",
      "Wendy Padbury"
    ],
    "time_reference": "c. 2086"
  },
  "cast_crew": [
    {
      "cast": {
        "name": "Patrick Troughton",
        "role": "Dr. Who"
      },
      "crew": {
        "name": "Michael Ferguson",
        "role": "Director"
      }
    },
    {
      "cast": {
        "name": "Frazer Hines",
        "role": "Jamie McCrimmon"
      },
      "crew": {
        "name": "Terrance Dicks",
        "role": "Script Editor"
      }
    },
    {
      "cast": {
        "name": "Wendy Padbury",
        "role": "Zoe Heriot"
      },
      "crew": {
        "name": "Peter Bryant",
        "role": "Producer"
      }
    },
    {
      "cast": {
        "name": "Alan Bennion",
        "role": "Slaar"
      },
      "crew": {
        "name": "Ron Grainer",
        "role": "Title Music"
      }
    },
    {
      "cast": {
        "name": "Louise Pajo",
        "role": "Gia Kelly"
      },
      "crew": {
        "name": "Dudley Simpson",
        "role": "Incidental Music"
      }
    },
    {
      "cast": {
        "name": "Terry Scully",
        "role": "Fewsham"
      },
      "crew": {
        "name": "Bill King",
        "role": "Visual Effects Designed by"
      }
    },
    {
      "cast": {
        "name": "Philip Ray",
        "role": "Eldred"
      },
      "crew": {
        "name": "Bobi Bartlett",
        "role": "Costumes"
      }
    },
    {
      "cast": {
        "name": "Ronald Leigh-Hunt",
        "role": "Radnor"
      },
      "crew": {
        "name": "Sylvia James",
        "role": "Make-Up"
      }
    }
  ],
  "home_media": [
    {
      "releases": {
        "media_type": "VHS",
        "date": "July 1985",
        "special_features": []
      }
    },
    {
      "releases": {
        "media_type": "VHS",
        "date": "July 1987",
        "special_features": []
      }
    },
    {
      "releases": {
        "media_type": "DVD",
        "date": "17 February 2003",
        "special_features": [
          "Commentary by actors Frazer Hines and Wendy Padbury, director Michael Ferguson and script editor Terrance Dicks",
          "Sssowing the Ssseedsss - Featurette on the Ice Warriors, featuring Alan Bennion, Sonny Caldinez, Bernard Bresslaw, and Sylvia James",
          "The Last Daleks - Original 8mm footage of the filming of the lost classic The Evil of the Daleks, with commentary by Michaeljohn Harris and Peter Day",
          "New Zealand Censor Clips - Newly discovered footage from the missing episodes of The Web of Fear and The Wheel in Space",
          "TARDIS Cam No.6",
          "Photo Gallery",
          "Production Subtitles",
          "Easter Egg (Footage from commentary)"
        ]
      }
    },
    {
      "releases": {
        "media_type": "DVD",
        "date": "28 March 2011",
        "details": "As part of the Revisitations 2 box set",
        "special_features": [
          "Commentary by Frazer Hines (Jamie), Wendy Padbury (Zoe), Director Michael Ferguson and Script Editor Terrance Dicks",
          "Lords of the Red Planet - A look back at the creation of the Ice Warriors, and their re-appearance in The Seeds of Death, with Wendy Padbury, Frazer Hines, Michael Ferguson, Terrance Dicks, Costume Designer Bobi Bartlett and TV Historian Richard Bignell",
          "Sssowing the Ssseedsss - Ice Warrior Sonny Caldinez, Ice Lord Alan Bennion and make-up designer Sylvia James recall their experiences of bringing the Martians to life",
          "Monster Masterclass - Michael Ferguson talks about his experiences directing some of Doctor Who's most famous monster stories",
          "Monsters Who Came Back for More! - Nicholas Briggs and Peter Ware take a look at the reasons why monsters often return for further adventures",
          "TARDIS Cam 6",
          "Radio Times listings (DVD-ROM)",
          "Production information subtitles",
          "Photo gallery",
          "Coming Soon trailer - Planet of the Spiders",
          "Easter Eggs: Off-air audio recording of a 1969 BBC trailer for the serial, and a video clip from the commentary recording session for episode six"
        ]
      }
    }
  ],
  "story_notes": [
    {
      "notes": [
        "The working title for this story was The Lords of the Red Planet.",
        "After the opening titles a specially filmed model sequence was used as a background for the story title and episode number, showing a scene of the Earth and Moon.",
        "This is the only story to feature footage of an Ice Warrior on location, where in episode four an Ice Warrior was filmed on Hampstead Heath in London.",
        "Brian Hayles' scripts differed from his story breakdown in several respects.",
        "Patrick Troughton does not appear in episode four as he was on holiday during the week it was recorded.",
        "The footage of the rocket in episode five is stock material of Mariner 4, a mission launched in 1964 to map the surface of Mars.",
        "The footage of the rocket launch in episode six is also library footage, from a Soviet launch in 1948 of a R-1 missile, a short-range copy of the German V-2.",
        "A subplot in episodes three and four in which Kelly was mind-controlled by the Ice Warriors was removed.",
        "Episode five exists in its original broadcast format due to it being preserved as a 35mm film negative.",
        "It was originally planned to have four standard Ice Warrior costumes available, but this was reduced to three in order to cut costs."
      ]
    }
  ],
  "worldbuilding": {
    "in_universe_mythology": [
      "Ice Warriors"
    ],
    "real_world_cultural_references": [
      "Leonardo da Vinci"
    ],
    "individuals": [
      "Slaar",
      "Gia Kelly",
      "Osgood",
      "Fewsham",
      "Phipps",
      "Locke",
      "Harvey",
      "Professor Daniel Eldred",
      "Julian Radnor",
      "Brent",
      "Sir James Gregson"
    ],
    "items": [
      "T-Mat",
      "Rocket ZA685"
    ],
    "locations": [
      "London",
      "Moon",
      "Space museum",
      "T-Mat control centre",
      "Moonbase",
      "Weather Control Station"
    ]
  },
  "ratings": {
    "ratings_millions": [
      {
        "part": "Episode one",
        "viewers": 6.6
      },
      {
        "part": "Episode two",
        "viewers": 6.8
      },
      {
        "part": "Episode three",
        "viewers": 7.5
      },
      {
        "part": "Episode four",
        "viewers": 7.1
      },
      {
        "part": "Episode five",
        "viewers": 7.6
      },
      {
        "part": "Episode six",
        "viewers": 7.7
      }
    ]
  },
  "continuity": {
    "continuity_notes": [
      "The Doctor and Jamie have previously met Ice Warriors.",
      "T-Mat is mentioned in later stories as causing the end of 'the First Great and Bountiful Space Race'."
    ]
  },
  "plot": [
    {
      "plot_summary": "The TARDIS lands in a space museum on Earth in the late 21st century, where the Second Doctor, Jamie and Zoe learn that contact has been lost between Earth and the Moon. In this era, instant travel — T-Mat — has revolutionised the Earth. The Doctor and his companions travel to the Moon in an old-style rocket and reach the Moonbase, control centre for T-Mat, only to find a squad of Ice Warriors have commandeered the base and plan to use the T-Mat network to their advantage."
    },
    {
      "plot_summary": "The Ice Warriors, led by Slaar, have taken over the Moonbase and plan to use the T-Mat system to spread deadly spores to Earth. The Doctor, Jamie and Zoe try to stop the invasion, with the help of Fewsham and Gia Kelly at the T-Mat control centre on Earth. After a race against time, the Doctor is able to sabotage the Ice Warriors' plans and defeat them."
    }
  ]
}