{
    "Series": "'In The Shadow Of Two Gunmen Part 2'",
    "Episode": {
        "Number": "2.2",
        "Title": "In The Shadow Of Two Gunmen part 2",
        "Original Airdate": "October 4, 1999, 10:00 P.M. EST",
        "Credits": {
            "Directed By": "THOMAS SCHLAMME"
        },
        "Sections": [
            {
                "Section": "Teaser",
                "Scenes": [
                    {
                        "Scene Heading": "FADE IN: EXT. OUTSIDE A DINER - NIGHT",
                        "Description": "TUESDAY, 3:28 AM Somewhere in the middle of not much obviously, the camera pans down from the hanging sign of the diner: 'The Dixie Pig Bar-B-Q.' We hear a news reporter on T.V. inside.",
                        "Dialogues": [
                            {
                                "Character": "T.V. REPORTER",
                                "Line": "...that there will be a press conference at the White House at 7:30  Eastern, that's about four hours from now. Deputy Chief of Staff Joshua Lyman is currently undergoing extensive surgery...",
                                "Descriptor": "VO"
                            }
                        ]
                    },
                    {
                        "Scene Heading": "CUT TO: INT. THE DIXIE PIG BAR-B-Q - CONTINUOUS",
                        "Description": "The signal skinhead -- sans grey baseball cap, but still without hair, is smoking a cigarette, watching the news.",
                        "Dialogues": [
                            {
                                "Character": "T.V. REPORTER",
                                "Line": "...to repair a collapsed lung, and remove a bullet that remains lodged in his thoracic region. Now, for an update on his condition, let's go live to Lynn Blakely, who's standing by at George Washington Hospital. She's got the latest for us. The camera pans from the T.V. screen down skinhead's head as he turns to watch a blonde woman walk in. The camera moves to his hand as he takes the cigarette out of his mouth and crushes it in his eggs. We see a swastika, etched on his hand.",
                                "Descriptor": "VO"
                            },
                            {
                                "Character": "T.V. REPORTER",
                                "Line": "Wait, we're not going to Lynn just yet. Now, I'm being told that authorities are reporting another gunshot victim, a woman who...",
                                "Descriptor": "VO"
                            }
                        ]
                    },
                    {
                        "Scene Heading": "CUT TO: EXT. OUTSIDE THE DINER - CONTINUOUS",
                        "Description": "Skinhead is now walking outside, lighting another cigarette. And then all hell breaks loose -- suddenly, a helicopter light comes on above him, pointing straight at him, while just being surrounded by four police cars.",
                        "Dialogues": [
                            {
                                "Character": "POLICEMAN 1",
                                "Line": "Let me see those hands!"
                            },
                            {
                                "Character": "POLICEMAN 2",
                                "Line": "Hold it right there!"
                            },
                            {
                                "Character": "POLICEMAN 3",
                                "Line": "Get down. Get down on the ground! The camera pulls away, as the bewildered skinhead -- who still has his unlit cigarette in his mouth -- looks around in shock at the gun toting, screaming policemen, just as Secret Service Agents pull up and join in. He puts his hands up and gets down on the ground, surrounded by agents with really big guns."
                            }
                        ]
                    },
                    {
                        "Scene Heading": "SMASH CUT TO: MAIN TITLES.",
                        "Description": "",
                        "Dialogues": [
                            {
                                "Character": "END TEASER",
                                "Line": "* * *"
                            }
                        ]
                    }
                ]
            },
            {
                "Section": "Act One",
                "Scenes": [
                    {
                        "Scene Heading": "FADE IN: INT. THE WHITE HOUSE BRIEFING ROOM - DAY",
                        "Description": "C.J. is holding the 7:30 Press Conference.",
                        "Dialogues": [
                            {
                                "Character": "C.J.",
                                "Line": "We're confirming now that a suspect is in custody, and is being questioned by federal law enforcement. At this time, we cannot, we are not releasing any information whatsoever about the suspect."
                            },
                            {
                                "Character": "STEVE",
                                "Line": "Can you tell us anything, his name, where he's from, his ethnicity, if you guys suspect a motive?"
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Yes, Steve, I can tell you those things, because when I said that we weren't releasing any information whatsoever, I meant except than his name, his address, his ethnicity, and what we think his motives are. The reporters clamor for C.J."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "I am releasing the name of Stephanie Abbott, A-B-B-O-T-T, from Silver Spring, Maryland, who was in the crowd, and sustained an injury to the left femur, which is the thighbone. She begins flinching from the flashbulb lights."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "The President remains in stable condition in the recovery room, and is expected to return home Wednesday. Josh Lyman is in his sixth hour of surgery..."
                            }
                        ]
                    },
                    {
                        "Scene Heading": "CUT TO: INT. G.W. WAITING ROOM - DAY",
                        "Description": "C.J. is on the T.V. outside the waiting room. The camera pans into room itself, where Toby, Donna, Abbey, Charlie and Sam sit with a few secret service agents, including Gina, who's pacing.",
                        "Dialogues": [
                            {
                                "Character": "C.J.",
                                "Line": "...to repair a collapsed lung and a ruptured pulmonary artery. We very likely will not have an update on his condition until the procedure is complete, which they expect will be in the next 6 or 8 hours. We'll keep you updated in the next hour. Thank you very much.",
                                "Descriptor": "VO"
                            },
                            {
                                "Character": "SAM",
                                "Line": "[to Abbey] Ma'am, does the President know they've arrested a suspect?"
                            },
                            {
                                "Character": "ABBEY",
                                "Line": "Yes, I told him. He's pretty groggy after the anesthesia. An aide bursts in the room."
                            },
                            {
                                "Character": "AIDE",
                                "Line": "Sam, Toby, you've got a phone call in the other room. Sam and Toby get up and leave the room."
                            },
                            {
                                "Character": "ABBEY",
                                "Line": "[to Donna] Donna? Do you want to throw some water on your face?"
                            },
                            {
                                "Character": "DONNA",
                                "Line": "You know, I should ask. Is there anything I'm supposed to be doing right now?"
                            },
                            {
                                "Character": "ABBEY",
                                "Line": "No."
                            },
                            {
                                "Character": "DONNA",
                                "Line": "I mean, anything that Josh's office is supposed to be doing? Should I be making sure it's farmed out?"
                            },
                            {
                                "Character": "ABBEY",
                                "Line": "No, I'm sure it's being covered."
                            }
                        ]
                    },
                    {
                        "Scene Heading": "CUT TO: INT. COMMUNICATIONS OFFICE - CONTINUOUS",
                        "Description": "C.J. walks inside and into Toby's office.",
                        "Dialogues": [
                            {
                                "Character": "C.J.",
                                "Line": "[to Bonnie] You got them on the phone?"
                            },
                            {
                                "Character": "BONNIE",
                                "Line": "Yes."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "[into speakerphone] Guys?"
                            },
                            {
                                "Character": "SAM",
                                "Line": "Yeah, we're here.",
                                "Descriptor": "VO"
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Sam, I need you to come back to the White House and speak to Nancy McNally about a letter the President was supposed to sign. She'll know what you're talking about."
                            }
                        ]
                    },
                    {
                        "Scene Heading": "CUT TO: INT. G.W. HOSPITAL ROOM - CONTINUOUS",
                        "Description": "Sam and Toby are in a hospital room, listening.",
                        "Dialogues": [
                            {
                                "Character": "SAM",
                                "Line": "Yeah, all right."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "And Toby?"
                            },
                            {
                                "Character": "TOBY",
                                "Line": "Yeah?"
                            },
                            {
                                "Character": "C.J.",
                                "Line": "They're still asking about the tent."
                            },
                            {
                                "Character": "TOBY",
                                "Line": "Yeah."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "I'd be more comfortable with the \"no comment\" coming from the Secret Service, though..."
                            },
                            {
                                "Character": "SAM",
                                "Line": "[to Toby] What's this?"
                            },
                            {
                                "Character": "TOBY",
                                "Line": "They want to know why the President exited the building in the open air."
                            },
                            {
                                "Character": "SAM",
                                "Line": "[to C.J.] I'll talk to someone at Treasury."
                            },
                            {
                                "Character": "TOBY",
                                "Line": "I'll do it."
                            },
                            {
                                "Character": "SAM",
                                "Line": "No."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Well, someone."
                            },
                            {
                                "Character": "SAM",
                                "Line": "Toby, we were all in that meeting together."
                            },
                            {
                                "Character": "TOBY",
                                "Line": "Go back to the office."
                            },
                            {
                                "Character": "SAM",
                                "Line": "Okay. Okay. Sam exits the room and walks down the hall. MAN'S VOICE [VO] Can the ships pass inspection?"
                            }
                        ]
                    },
                    {
                        "Scene Heading": "CUT TO: INT. GAGE WHITNEY CONFERENCE ROOM - THREE YEARS EARLIER",
                        "Description": "",
                        "Dialogues": [
                            {
                                "Character": "GAGE WHITNEY PACE",
                                "Line": ""
                            },
                            {
                                "Character": "MIDTOWN MANHATTAN",
                                "Line": ""
                            },
                            {
                                "Character": "THREE YEARS EARLIER",
                                "Line": "The camera pans down a long conference table, resting finally on an over the shoulder shot of Sam."
                            },
                            {
                                "Character": "FEMALE LAWYER",
                                "Line": "The ships will be registered in Libya and Panama, so they won't be subject to the OPA, which wouldn't allow an American company to keep a tanker like this in service very long.",
                                "Descriptor": "VO"
                            },
                            {
                                "Character": "ASSOCIATE",
                                "Line": "I think 2017."
                            },
                            {
                                "Character": "FEMALE LAWYER",
                                "Line": "I think 2015, and we'll check that, but you get the idea."
                            },
                            {
                                "Character": "MR. GAGE",
                                "Line": "I think all that's left, then is to dot the tees."
                            },
                            {
                                "Character": "SAM",
                                "Line": "Actually. I have a thing. I have a thing I was going to mention, just a proposal to throw out there. When I was a congressional aide, we had an expression, 'no idea was too stupid to say out loud,' so here it is, bear me out. [beat] Instead of buying these ships? Don't buy these ships. Buy other ships. Better ships. That's my idea."
                            },
                            {
                                "Character": "MR. LOCH",
                                "Line": "[to Mr. Gage] What is he talking about?"
                            },
                            {
                                "Character": "MR. GAGE",
                                "Line": "That's a perfectly fair question. Sam, what the hell are you talking about?"
                            },
                            {
                                "Character": "SAM",
                                "Line": "And the good news is we have a no-penalty clause we can exercise if we pull out before the First of December."
                            },
                            {
                                "Character": "MR. CAMERON",
                                "Line": "But Sam, we want these ships. This is as little as we've ever paid for a fleet."
                            },
                            {
                                "Character": "SAM",
                                "Line": "Well, there's a reason why they don't cost a lot of money. They're 20-year old single hulled VLCCs that nobody wants. When they hit things, they will break. And they will hit things, because they don't have state of the art navigation systems. They don't have G3 tank gauging, or EM-5000 engine monitoring, the recommended staletronic, or electopneumotronic ballast."
                            },
                            {
                                "Character": "MR. GAGE",
                                "Line": "[chuckling] And yesterday, he didn't know the difference between a ship and a boat!"
                            },
                            {
                                "Character": "MR. LOCH",
                                "Line": "Sam, I thought you told us that you covered our liability."
                            },
                            {
                                "Character": "SAM",
                                "Line": "I did. Strictly speaking, I did. But there's a broader liability to think about. People drove past Exxon Stations after the Valdez."
                            },
                            {
                                "Character": "MR. CAMERON",
                                "Line": "We've got PR firms for PR problems."
                            },
                            {
                                "Character": "SAM",
                                "Line": "There's a Suez tanker ready to launch in the Koje Island shipyard in Korea. Chevron just dropped the option, and it's sitting there in its cradle. Let's go get it."
                            },
                            {
                                "Character": "MR. GAGE",
                                "Line": "Sam, can I talk you for a second? Sam follows Mr. Gage out, while still talking to the client."
                            },
                            {
                                "Character": "SAM",
                                "Line": "308,000 deadweight tons, carries 2.2 million gallons, and you can have it today for 46 million."
                            },
                            {
                                "Character": "MR. LOCH",
                                "Line": "46 million dollars?"
                            },
                            {
                                "Character": "SAM",
                                "Line": "That's a good price! They walk out to the HALLWAY."
                            },
                            {
                                "Character": "MR. GAGE",
                                "Line": "Sam, what are you doing?"
                            },
                            {
                                "Character": "SAM",
                                "Line": "I think I have an obligation."
                            },
                            {
                                "Character": "MR. GAGE",
                                "Line": "What are you doing?"
                            },
                            {
                                "Character": "SAM",
                                "Line": "Maybe they want to buy safer boats, but we never gave them the option."
                            },
                            {
                                "Character": "MR. GAGE",
                                "Line": "Are you trying to get fired?"
                            },
                            {
                                "Character": "SAM",
                                "Line": "Maybe they're really going to thank us for this suggestion."
                            },
                            {
                                "Character": "MR. GAGE",
                                "Line": "Knock it off, Sam!"
                            },
                            {
                                "Character": "SAM",
                                "Line": "Look..."
                            },
                            {
                                "Character": "MR. GAGE",
                                "Line": "Knock it off! He storms back inside the conference room."
                            }
                        ]
                    },
                    {
                        "Scene Heading": "CUT TO: EXT. MANHATTAN PAY PHONE - DAY",
                        "Description": "Josh is outside in the rain, back on the pay phone.",
                        "Dialogues": [
                            {
                                "Character": "JOSH",
                                "Line": "[into phone] Look, Operator, I'm looking for the number of a law firm in Manhattan. Here's the thing, I can't quite remember the name of the firm... no, wait, wait, wait! I just came back from New Hampshire, where I saw this guy and now I have to... look it's a very famous firm that handles Shearson, you must know... okay, you know what, I'm just going to - okay, bye. He hangs up the phone, runs to the curb -- Remembers! -- then turns back and runs the other way."
                            }
                        ]
                    },
                    {
                        "Scene Heading": "CUT TO: INT. THE CONFERENCE ROOM - CONTINUOUS",
                        "Description": "The conference room again.",
                        "Dialogues": [
                            {
                                "Character": "MR. CAMERON",
                                "Line": "That's amortized over--?"
                            },
                            {
                                "Character": "FEMALE LAWYER",
                                "Line": "15 years."
                            },
                            {
                                "Character": "MR. CAMERON",
                                "Line": "Pre-tax?"
                            },
                            {
                                "Character": "FEMALE LAWYER",
                                "Line": "Sam?"
                            },
                            {
                                "Character": "SAM",
                                "Line": "Hmm?"
                            },
                            {
                                "Character": "FEMALE LAWYER",
                                "Line": "15 million pre-tax amortization."
                            },
                            {
                                "Character": "SAM",
                                "Line": "[to clients, giving it one last shot] 11 million extra dollars. The female lawyer groans."
                            },
                            {
                                "Character": "MR. GAGE",
                                "Line": "Sam!"
                            },
                            {
                                "Character": "MR. LOCH",
                                "Line": "We're back to this."
                            },
                            {
                                "Character": "SAM",
                                "Line": "Money's going to be spent, Mr. Loch, you can spend it now, or you can spend it later, but it's cheaper to spend it now."
                            },
                            {
                                "Character": "MR. LOCH",
                                "Line": "Sam."
                            },
                            {
                                "Character": "SAM",
                                "Line": "And it's also the right thing to do. Spend 11 million extra dollars."
                            },
                            {
                                "Character": "MR. GAGE",
                                "Line": "Sam!"
                            },
                            {
                                "Character": "SAM",
                                "Line": "Spend it on a better boat."
                            },
                            {
                                "Character": "MR. GAGE",
                                "Line": "Damn it!"
                            },
                            {
                                "Character": "SAM",
                                "Line": "The Amoco Cadiz, 68 million gallons of crude oil off of Brittany, France. The Braer, a Liberian Tanker 26 million gallons off the Shetland Islands. I just pulled these off the internet last night! The Exxon Valdez. The Aegaen Sea. The Argo Merchant. Look it up!"
                            },
                            {
                                "Character": "MR. GAGE",
                                "Line": "I'm sure they're..."
                            },
                            {
                                "Character": "SAM",
                                "Line": "Spend an extra 11 million dollars!"
                            },
                            {
                                "Character": "MR. GAGE",
                                "Line": "Sam, that's enough!"
                            },
                            {
                                "Character": "SAM",
                                "Line": "You don't want to pay for it? Pass the expense on to us."
                            },
                            {
                                "Character": "FEMALE LAWYER",
                                "Line": "Sam! Past her, we can see a very wet Josh walking up the conference room doors."
                            },
                            {
                                "Character": "SAM",
                                "Line": "Half a penny at the tank. Here's five bucks. A thousand people are on me."
                            },
                            {
                                "Character": "MR. GAGE",
                                "Line": "Sam! Josh knocks on the window, causing Sam to look over to him. Josh is pretty much just standing there, looking really wet and vaguely... prophetic."
                            },
                            {
                                "Character": "MR. GAGE",
                                "Line": "Sam. Sam can't take his eyes off of Josh."
                            },
                            {
                                "Character": "FEMALE LAWYER",
                                "Line": "Sam, we're in the middle of a meeting."
                            },
                            {
                                "Character": "SAM",
                                "Line": "Yeah."
                            },
                            {
                                "Character": "MR. LOCH",
                                "Line": "Sam, we're not indifferent to the concerns of the environmentalists... Excuse me, Sam? Josh points to his non-poker-playing face."
                            },
                            {
                                "Character": "SAM",
                                "Line": "Yeah."
                            },
                            {
                                "Character": "MR. LOCH",
                                "Line": "It doesn't quite feel like I have your attention."
                            },
                            {
                                "Character": "SAM",
                                "Line": "Yeah. Josh is still pointing to his face, smiles and nods slowly, Sam laughs."
                            },
                            {
                                "Character": "SAM",
                                "Line": "Yeah! Yeah. He shuffles his papers, then pulling away from them."
                            },
                            {
                                "Character": "SAM",
                                "Line": "I'm not going to need that."
                            },
                            {
                                "Character": "MR. GAGE",
                                "Line": "Sam? Sam! Sam, please keep your seat! Sam, where are you going? Sam gets up from the table and walks to the door. Josh opens the door for him."
                            },
                            {
                                "Character": "SAM",
                                "Line": "[shouts back] New Hampshire!"
                            },
                            {
                                "Character": "FADE OUT.",
                                "Line": "* * *"
                            }
                        ]
                    }
                ]
            },
            {
                "Section": "Act Two",
                "Scenes": [
                    {
                        "Scene Heading": "FADE IN: INT. HALLWAY - DAY",
                        "Description": "TUESDAY, 3:55 AM C.J. is waiting in a corridor for Sam, who comes walking out a door.",
                        "Dialogues": [
                            {
                                "Character": "C.J.",
                                "Line": "Sam!"
                            },
                            {
                                "Character": "SAM",
                                "Line": "Yeah?"
                            },
                            {
                                "Character": "C.J.",
                                "Line": "I wanted to see if..."
                            },
                            {
                                "Character": "SAM",
                                "Line": "How's your head?"
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Oh, it's fine. I wanted to see if you talked to Nancy McNally."
                            },
                            {
                                "Character": "SAM",
                                "Line": "Yeah, and she talked to the Counsel's office, and they're going to work on a few things and see what we like, but I got to tell you we're not going to --"
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Sam, you didn't happen to notice, when the shooting started, you didn't happen to notice who pulled me to the ground, did you?"
                            },
                            {
                                "Character": "SAM",
                                "Line": "No."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "They pulled me down behind the police car, and my necklace came off..."
                            },
                            {
                                "Character": "SAM",
                                "Line": "No."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "You talked to Nancy McNally?"
                            },
                            {
                                "Character": "SAM",
                                "Line": "Yeah."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Okay. Sam goes off in one direction. Carol catches C.J. as she is going in the other direction."
                            },
                            {
                                "Character": "CAROL",
                                "Line": "Oh, C.J.!"
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Yeah."
                            },
                            {
                                "Character": "CAROL",
                                "Line": "You need to call back Debbie at the Today Show."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Why?"
                            },
                            {
                                "Character": "CAROL",
                                "Line": "We said you might be willing to do the morning shows when they go on the air at 7."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "No, that's not a good --"
                            },
                            {
                                "Character": "CAROL",
                                "Line": "They just wanted --"
                            },
                            {
                                "Character": "C.J.",
                                "Line": "No, I'm not doing any interviews just yet, I'm not doing it."
                            },
                            {
                                "Character": "CAROL",
                                "Line": "I'll take care of it."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Which one of our people?"
                            },
                            {
                                "Character": "CAROL",
                                "Line": "It was a mistake. I'll take care of it. C.J. keeps going, and runs into Danny."
                            },
                            {
                                "Character": "DANNY",
                                "Line": "C.J.?"
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Yeah."
                            },
                            {
                                "Character": "DANNY",
                                "Line": "I really don't want to be this guy."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Somebody around here thought I should do the morning shows."
                            },
                            {
                                "Character": "DANNY",
                                "Line": "I still don't have an answer."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Who was in charge?"
                            },
                            {
                                "Character": "DANNY",
                                "Line": "For the three and a half hours that the President was under anesthesia. They end up back at C.J.'S OFFICE."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Danny, it's a little complicated. There's something called the National Security Act of 1947. There's the 25th. Nancy McNally, the White House Counsel, Bill Hutchinson, they're all working on it right now."
                            },
                            {
                                "Character": "DANNY",
                                "Line": "Yeah, but they're going to tell me who's supposed to be in charge. I want to know who was in charge."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "And we are working on that information. [on Danny's look] We're working on it. Danny leaves the office. C.J. sits down, scratching her neck when the phone rings on her desk. C.J. reaches for it."
                            },
                            {
                                "Character": "QUICK CUT TO",
                                "Line": "INT. C.J.'S BEDROOM - THREE YEARS EARLIER C.J. reaches for the phone from her bed."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Hello? [sits up groggily] Yeah? [picks up watch on bedstand] Isobel, it's 6:30 in the morning! Yeah. She hangs up the phone and climbs out of bed."
                            }
                        ]
                    },
                    {
                        "Scene Heading": "CUT TO: EXT. BEAUTIFUL LOS ANGELES SKYLINE - DAY",
                        "Description": "",
                        "Dialogues": [
                            {
                                "Character": "TRITON",
                                "Line": "DAY PUBLIC RELATIONS BEVERLY HILLS, CALIFORNIA We hear an aide knocking on someone's door."
                            },
                            {
                                "Character": "AIDE",
                                "Line": "Excuse me. C.J.'s here.",
                                "Descriptor": "VO"
                            }
                        ]
                    },
                    {
                        "Scene Heading": "CUT TO: INT. PUBLIC RELATIONS OFFICE - CONTINUOUS",
                        "Description": "ROGER BECKER, in sunglasses and an unbelievably garish Hawaiian shirt, is pacing agitated in the corner behind the door. ISOBEL is at her desk.",
                        "Dialogues": [
                            {
                                "Character": "ISOBEL",
                                "Line": "Thank you. C.J. walks in and closes the door behind her."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Good morning, Isobel. Hi, Roger."
                            },
                            {
                                "Character": "ROGER BECKER",
                                "Line": "I asked her to be here 45 minutes ago."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "I'm sorry."
                            },
                            {
                                "Character": "ROGER",
                                "Line": "I said, I asked her to be here 45 minutes ago."
                            },
                            {
                                "Character": "ISOBEL",
                                "Line": "Roger..."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "It was 6:30 in the morning, Roger, I wasn't quite ready for work, but I am now. How can I help you? [sits]"
                            },
                            {
                                "Character": "ROGER",
                                "Line": "Are you aware that the Golden Globe Nominations were announced this morning? C.J. looks at Isobel for confirmation. Isobel shrugs."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "I wasn't. Am I up for something?"
                            },
                            {
                                "Character": "ISOBEL",
                                "Line": "C.J., Atlantis only got two nominations."
                            },
                            {
                                "Character": "ROGER",
                                "Line": "For the entire studio! Best Comedy Score, and Supporting Actor for the kid. That's what $20,000 a month bought us!"
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Roger, I think we put together a very aggressive campaign."
                            },
                            {
                                "Character": "ROGER",
                                "Line": "Two nominations!"
                            },
                            {
                                "Character": "C.J.",
                                "Line": "That's two nominations more than a lot of people got."
                            },
                            {
                                "Character": "ROGER",
                                "Line": "Are you aware that the new Premiere Magazine list is coming out Monday?"
                            },
                            {
                                "Character": "C.J.",
                                "Line": "The Hundred Most Powerful People in Hollywood."
                            },
                            {
                                "Character": "ROGER",
                                "Line": "Yeah."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Yes, I am, and I can tell you that you're on it, and uh, congratulations, and it must, you know, feel good being that powerful."
                            },
                            {
                                "Character": "ROGER",
                                "Line": "I went from third to ninth. I dropped to ninth! Do you know how that looks? Do you know how many people were ahead of me?"
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Eight?"
                            },
                            {
                                "Character": "ROGER",
                                "Line": "Lady, you're..."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "The movies were bad, Roger, all of them. Even the little kid was bad, but he was a little kid, he had a couple of scenes, big eyeglasses, lisp, he's going to the Golden Globes. You know why the New Coke marketing campaign failed? Because nobody liked New Coke. The movies were bad. If the movies were unknown, I could help you, but they weren't. They were just bad!"
                            },
                            {
                                "Character": "ISOBEL",
                                "Line": "Roger, would you excuse us for just a second, please? Isobel and C.J. step out into the HALLWAY."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Sorry I talked to him like that, but did he really think he had \"The Maltese Falcon\" out there?"
                            },
                            {
                                "Character": "ISOBEL",
                                "Line": "The thing is, C.J., he's big business for me."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "I'll apologize to him, Isobel. I'll find someone to make him Man of the Year. I'll ask around in Vegas."
                            },
                            {
                                "Character": "ISOBEL",
                                "Line": "He wants you fired. He thinks you're a smart mouth."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "He's going to pull his business unless you fire me?"
                            },
                            {
                                "Character": "ISOBEL",
                                "Line": "This was never what you wanted to be doing, C.J. You've always felt it was beneath you."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "It is beneath me!"
                            },
                            {
                                "Character": "ISOBEL",
                                "Line": ""
                            },
                            {
                                "Character": "C.J.",
                                "Line": ""
                            },
                            {
                                "Character": "C.J.",
                                "Line": "So take me off Film and Television, I don't know anything about it, anyway! We have plenty of accounts..."
                            },
                            {
                                "Character": "ISOBEL",
                                "Line": "I need to keep his business. I'm sorry."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "You're firing me?"
                            },
                            {
                                "Character": "ISOBEL",
                                "Line": "I'm sorry."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Out here in the hallway!?"
                            },
                            {
                                "Character": "ISOBEL",
                                "Line": ""
                            },
                            {
                                "Character": "C.J.",
                                "Line": ""
                            },
                            {
                                "Character": "C.J.",
                                "Line": "[to the room at large] I need someone to call me a cab!"
                            },
                            {
                                "Character": "ISOBEL",
                                "Line": "I'm sorry?"
                            },
                            {
                                "Character": "C.J.",
                                "Line": "I couldn't get my contacts in this morning, and I broke my glasses getting out of the car. I can't drive myself home. I need someone to call me a cab."
                            },
                            {
                                "Character": "ISOBEL",
                                "Line": "[to suit standing in lobby] Could you call a taxi for C.J., please? [to C.J.] I have to go back in. Isobel turns around and opens the door to her office, just as she does so, C.J. yells after her, with Roger plainly hearing--"
                            },
                            {
                                "Character": "C.J.",
                                "Line": "It was a bad movie, Isobel."
                            },
                            {
                                "Character": "ASSISTANT",
                                "Line": "Yes, I need a taxi to Beverly Hills, please.",
                                "Descriptor": "VO"
                            }
                        ]
                    },
                    {
                        "Scene Heading": "CUT TO: EXT. A STREET IN HOLLYWOOD HILLS - DAY",
                        "Description": "A taxi pulls up to C.J.'s house. C.J. gets out with a box of office stuff, pays the cabbie, noticing a strange car in her driveway. She walks to the back of the house and pushes open the gate.",
                        "Dialogues": []
                    },
                    {
                        "Scene Heading": "CUT TO: EXT. C.J.'S BACKYARD - CONTINUOUS",
                        "Description": "C.J. goes inside her backyard, where there's a nice pool with Mexican tile. Toby is sitting on the opposite side of the pool.",
                        "Dialogues": [
                            {
                                "Character": "C.J.",
                                "Line": "Hello?"
                            },
                            {
                                "Character": "TOBY",
                                "Line": "Hey, C.J."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Who is that?"
                            },
                            {
                                "Character": "TOBY",
                                "Line": "It's me. C.J. walks closer, following the edge of the pool. Toby waves his arms wildly."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Toby?"
                            },
                            {
                                "Character": "TOBY",
                                "Line": "Yeah."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "What the hell are you -- C.J. slips, missteps, and falls right into the pool. She surfaces, sputtering."
                            },
                            {
                                "Character": "TOBY",
                                "Line": "C.J., you fell into the pool, there."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "I can't see!"
                            },
                            {
                                "Character": "TOBY",
                                "Line": "Yeah, well, maybe, kind of, uh, try to feel your way to dry land?"
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Shut up! Toby puts his hands on his hips. C.J. looks down at herself and then up at him."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Avert your eyes!"
                            },
                            {
                                "Character": "TOBY",
                                "Line": "What?"
                            },
                            {
                                "Character": "C.J.",
                                "Line": "I'm climbing out of the pool, my clothes will be clingy, avert your eyes!"
                            },
                            {
                                "Character": "TOBY",
                                "Line": "[chuckling] C.J., I really didn't come here --"
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Avert your eyes!"
                            },
                            {
                                "Character": "TOBY",
                                "Line": "[cowed] Okay. He turns around. C.J. straggles out the pool, tries to cover herself with her wet clothes, but it's really no use."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Oh, turn around. He does, and C.J. walks up the stairs past him, and reaches into the house for a towel."
                            },
                            {
                                "Character": "TOBY",
                                "Line": "I tried calling you at your office. They said you were fired. Were you stealing things?"
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Roger Becker dropped from third most powerful person in Hollywood to ninth most powerful person in Hollywood."
                            },
                            {
                                "Character": "TOBY",
                                "Line": "Does he still make the playoffs, or is the cutoff line..."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "They take it seriously."
                            },
                            {
                                "Character": "TOBY",
                                "Line": "C.J., Jed Bartlet is very impressed with you. C.J. looks up at him, startled."
                            },
                            {
                                "Character": "TOBY",
                                "Line": "He likes the work that you did with that girl's group with the stupid name."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Emily's List?"
                            },
                            {
                                "Character": "TOBY",
                                "Line": "Yes."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "That girl's group with the stupid name?"
                            },
                            {
                                "Character": "TOBY",
                                "Line": "Yes."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Emily's List -- \"early money is like yeast\"."
                            },
                            {
                                "Character": "TOBY",
                                "Line": "Yeah."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "\"It helps raise the dough\"."
                            },
                            {
                                "Character": "TOBY",
                                "Line": "I get it."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "They raise money for women candidates. 'Early money is like yeast, it helps raise the dough.' For the candidates."
                            },
                            {
                                "Character": "TOBY",
                                "Line": "I really do get it."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Bartlet's impressed with me?"
                            },
                            {
                                "Character": "TOBY",
                                "Line": "Very impressed. And one of the big keys to his game plan is bringing you on as Press Secretary."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "He's never heard of me, has he?"
                            },
                            {
                                "Character": "TOBY",
                                "Line": "No."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Toby..."
                            },
                            {
                                "Character": "TOBY",
                                "Line": "I'm here on instructions from Leo McGarry."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "McGarry wants me."
                            },
                            {
                                "Character": "TOBY",
                                "Line": "Yes. Come join the campaign."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "How much does it pay?"
                            },
                            {
                                "Character": "TOBY",
                                "Line": "How much were you making before?"
                            },
                            {
                                "Character": "C.J.",
                                "Line": "$550,000 a year."
                            },
                            {
                                "Character": "TOBY",
                                "Line": "This pays $600 a week."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "So this would be less."
                            },
                            {
                                "Character": "TOBY",
                                "Line": "Yes."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Toby. Does he know I've only ever worked statewide? Does he know I've never worked on a national campaign before?"
                            },
                            {
                                "Character": "TOBY",
                                "Line": "Yes. It's Graduation Day."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "You really think I can do this?"
                            },
                            {
                                "Character": "TOBY",
                                "Line": "Yeah."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Is Jed Bartlet a good man?"
                            },
                            {
                                "Character": "TOBY",
                                "Line": "Yeah."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Toby."
                            },
                            {
                                "Character": "TOBY",
                                "Line": "Yes."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Then, let's go into the house so I can change my clothes and we can talk about it. C.J. starts walking, still wringing out her hair."
                            },
                            {
                                "Character": "TOBY",
                                "Line": "C.J.?"
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Yeah?"
                            },
                            {
                                "Character": "TOBY",
                                "Line": "House is over there."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Okay. C.J. turns around, and Toby watches her go."
                            }
                        ]
                    },
                    {
                        "Scene Heading": "CUT TO: INT. G.W. HOSPITAL ROOM - PRESENT",
                        "Description": "In Bartlet's hospital room, Ron Butterfield briefs Bartlet, Abbey and Zoey.",
                        "Dialogues": [
                            {
                                "Character": "RON",
                                "Line": "One of them was using 9 millimeter Baretta, the other had a 357 Desert Eagle."
                            },
                            {
                                "Character": "ABBEY",
                                "Line": "Ron's saying that these were the absolutely wrong weapons to use for a shooting of this kind. And that's why the injury count was as low as it was."
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "We don't know what the injury count is, yet."
                            },
                            {
                                "Character": "ABBEY",
                                "Line": "Yeah, but his point is -- The door opens. It's Charlie."
                            },
                            {
                                "Character": "CHARLIE",
                                "Line": "Excuse me, sir, I was told you wanted to see me?"
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "Yeah. Charlie, the guy the Secret Service has in custody is named Carl Leroy. He gives a statement in which he says that he and the two shooters were members of an organization called West Virginia White Pride."
                            },
                            {
                                "Character": "CHARLIE",
                                "Line": "They tried to kill the President 'cause Zoey and I are together?"
                            },
                            {
                                "Character": "ABBEY",
                                "Line": "No."
                            },
                            {
                                "Character": "CHARLIE",
                                "Line": "Then why did --?"
                            },
                            {
                                "Character": "RON",
                                "Line": "Charlie. The President wasn't the target. According to the statement, the President wasn't the target. Charlie tries hard to accept the fact."
                            },
                            {
                                "Character": "CHARLIE",
                                "Line": "Oh. Okay. Okay, well. Okay. Thank you, Mr. President. He exits."
                            },
                            {
                                "Character": "ZOEY",
                                "Line": "Dad, I'm going to --"
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "Go. Ron exits behind Zoey, closing the door."
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "[to Abbey] We don't know what the injury count is, yet."
                            },
                            {
                                "Character": "FADE OUT.",
                                "Line": "* * *"
                            }
                        ]
                    }
                ]
            },
            {
                "Section": "Act Three",
                "Scenes": [
                    {
                        "Scene Heading": "FADE IN: EXT. OVERVIEW OF THE WHITE HOUSE - DAY",
                        "Description": "TUESDAY, 6:15AM",
                        "Dialogues": []
                    },
                    {
                        "Scene Heading": "CUT TO: INT. LEO'S OFFICE - DAY",
                        "Description": "Margaret and Leo are inside. Leo is sitting in a chair looking over papers, while Margaret stands over him.",
                        "Dialogues": [
                            {
                                "Character": "MARGARET",
                                "Line": "He was supposed to sign a letter?"
                            },
                            {
                                "Character": "LEO",
                                "Line": "The President is going under general anesthesia, he usually signs a letter handing over executive powers to the Vice President."
                            },
                            {
                                "Character": "MARGARET",
                                "Line": "And the President didn't sign the letter."
                            },
                            {
                                "Character": "LEO",
                                "Line": "Nope. We blew that play."
                            },
                            {
                                "Character": "MARGARET",
                                "Line": "Is there going to be trouble?"
                            },
                            {
                                "Character": "LEO",
                                "Line": "We'll see. To be honest with you, I don't really care right now."
                            },
                            {
                                "Character": "MARGARET",
                                "Line": "Can I -- can I just say something for the future?"
                            },
                            {
                                "Character": "LEO",
                                "Line": "Yeah."
                            },
                            {
                                "Character": "MARGARET",
                                "Line": "I can sign the President's name. I have his signature down pretty good. Leo looks up at her for the first time."
                            },
                            {
                                "Character": "LEO",
                                "Line": "You can sign the President's name?"
                            },
                            {
                                "Character": "MARGARET",
                                "Line": "Yeah."
                            },
                            {
                                "Character": "LEO",
                                "Line": "On a document removing him from power and handing it to someone else."
                            },
                            {
                                "Character": "MARGARET",
                                "Line": "Yeah! [on Leo's look of disbelief] Or... do you think the White House Counsel would say that was a bad idea."
                            },
                            {
                                "Character": "LEO",
                                "Line": "I think the White House Counsel would say it was a coup d'etat!"
                            },
                            {
                                "Character": "MARGARET",
                                "Line": "Well. I'd probably end up doing some time for that."
                            },
                            {
                                "Character": "LEO",
                                "Line": "I would think. Margaret tries to beat a hasty retreat, as C.J. enters."
                            },
                            {
                                "Character": "LEO",
                                "Line": "And what the hell were you doing practicing the President's signature?"
                            },
                            {
                                "Character": "MARGARET",
                                "Line": "It was just for fun."
                            },
                            {
                                "Character": "LEO",
                                "Line": "We've got separation of powers, checks and balances, and Margaret vetoing things and sending them back to the Hill."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Leo, who thought it was a good idea for me to do the morning shows?"
                            },
                            {
                                "Character": "LEO",
                                "Line": "I did."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Why?"
                            },
                            {
                                "Character": "LEO",
                                "Line": "The President's not ready for cameras. If it's the Vice President, we're going to look like we don't have a President, and I'd like the White House to start climbing out from behind the bushes."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "I think it's a bad idea."
                            },
                            {
                                "Character": "LEO",
                                "Line": "Why?"
                            },
                            {
                                "Character": "C.J.",
                                "Line": "I just... First of all, I think it's inappropriate while Josh, you know, until --"
                            },
                            {
                                "Character": "LEO",
                                "Line": "What's wrong?"
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Nothing."
                            },
                            {
                                "Character": "LEO",
                                "Line": ""
                            },
                            {
                                "Character": "C.J.",
                                "Line": ""
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Nothing. I'd rather not do it, but obviously."
                            },
                            {
                                "Character": "LEO",
                                "Line": "Have Sam do it."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "[relieved] Okay. Listen, the letter."
                            },
                            {
                                "Character": "LEO",
                                "Line": "Yeah."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "The three and a half hours? I don't know how much longer I can dance around Danny, and it's going to be Danny times a hundred by lunchtime. Toby enters."
                            },
                            {
                                "Character": "LEO",
                                "Line": "Have him come see me."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Yeah?"
                            },
                            {
                                "Character": "LEO",
                                "Line": "Yeah."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Okay."
                            }
                        ]
                    },
                    {
                        "Scene Heading": "CUT TO: INT. HALLWAY - CONTINUOUS",
                        "Description": "Leo and Toby walk-and-talk down the corridors.",
                        "Dialogues": [
                            {
                                "Character": "LEO",
                                "Line": "She doesn't want to do the morning shows."
                            },
                            {
                                "Character": "TOBY",
                                "Line": "She says she's been getting a couple of questions about why the President exited in the open air. You remember the Secret Service usually constructs a tent or a canopy. I'm going to talk to Ron Butterfield."
                            },
                            {
                                "Character": "LEO",
                                "Line": "He's going to say the Secret Service doesn't comment on procedure."
                            },
                            {
                                "Character": "TOBY",
                                "Line": "I know. But maybe I can talk him out of it. I should try, anyway."
                            },
                            {
                                "Character": "LEO",
                                "Line": "You don't have to, Toby."
                            },
                            {
                                "Character": "TOBY",
                                "Line": "Yeah, I should, though. Toby watches Leo exit through the front door."
                            }
                        ]
                    },
                    {
                        "Scene Heading": "CUT TO: INT. BARTLET'S CAMPAIGN HEADQUARTERS - THREE YEARS EARLIER",
                        "Description": "It's a very busy day at the headquarters. As the camera pans over volunteers, we see Toby drinking coffee. It stops on Bartlet himself, leaning on a table on which a taped news program is also running.",
                        "Dialogues": [
                            {
                                "Character": "BARTLET CAMPAIGN HEADQUARTERS",
                                "Line": "MANCHESTER, NEW HAMPSHIRE"
                            },
                            {
                                "Character": "REPORTER",
                                "Line": "...won the non-binding straw poll, pulling in 48% of the vote, Senator William Willey of Washington State drew a poorer than expected 22% of the vote, but the story this morning is the 19% of the vote picked up by former New Hampshire Governor Jed Bartlet, who leapfrogged several democratic candidates to finish a surprising third. And we're going to go now to Governor Bartlet, who's standing by live... okay, I'm told we don't have the Governor at this moment, so we while we try -- C.J. clicks off the tape. Behind her, all facing Bartlet, are several campaign staffers, including Sam, Toby, Leo and Josh.",
                                "Descriptor": "VO"
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Okay, who can tell me what we did wrong there?"
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "I blew it. What's next?"
                            },
                            {
                                "Character": "C.J.",
                                "Line": "We didn't have the candidate. That's right. Anyone who answered \"we didn't have the candidate\" -"
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "What's... next?"
                            },
                            {
                                "Character": "JOSH",
                                "Line": "Toby wants to say something."
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "Which one is Toby?"
                            },
                            {
                                "Character": "TOBY",
                                "Line": "I am."
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "[to Josh] And which one are you?"
                            },
                            {
                                "Character": "JOSH",
                                "Line": "I'm Josh."
                            },
                            {
                                "Character": "LEO",
                                "Line": "[to Toby] What was it you wanted to say?"
                            },
                            {
                                "Character": "TOBY",
                                "Line": "Let's get out of New Hampshire."
                            },
                            {
                                "Character": "LEO",
                                "Line": "Why?"
                            },
                            {
                                "Character": "TOBY",
                                "Line": "Nothing to win here."
                            },
                            {
                                "Character": "SAM",
                                "Line": "He's right."
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "The New Hampshire primary isn't held in New Hampshire anymore?"
                            },
                            {
                                "Character": "TOBY",
                                "Line": "You can't win the New Hampshire primary."
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "I am going to win the New Hampshire primary."
                            },
                            {
                                "Character": "TOBY",
                                "Line": "Which is why you can't win it."
                            },
                            {
                                "Character": "JOSH",
                                "Line": "You're incredibly popular in this state."
                            },
                            {
                                "Character": "SAM",
                                "Line": "You're a democrat who was elected with 69 percent of the vote. That's unheard of."
                            },
                            {
                                "Character": "TOBY",
                                "Line": "There's no way that you can exceed expectations, all you can hope for is an \"as expected\", and there's always the possibility that you could embarrass yourself."
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "I appreciate that, thanks."
                            },
                            {
                                "Character": "JOSH",
                                "Line": "Toby meant in the polls."
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "I know what he meant."
                            },
                            {
                                "Character": "TOBY",
                                "Line": "So, Hoynes will be in a fight with Wiley for a strong second place finish in New Hampshire, meantime we're going to be in South Carolina, and we're going to be the only ones there."
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "We're not going to beat Hoynes in South Carolina."
                            },
                            {
                                "Character": "TOBY",
                                "Line": "We don't have to beat Hoynes in South Carolina."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "We just have to beat Wiley."
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "[to Leo] Wiley's going to drop out after South Carolina?"
                            },
                            {
                                "Character": "LEO",
                                "Line": "If he doesn't finish higher than third."
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "Are we going to get his endorsement?"
                            },
                            {
                                "Character": "LEO",
                                "Line": "We're going to get his money, that's for sure."
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "It's for sure?"
                            },
                            {
                                "Character": "LEO",
                                "Line": "Josh thinks it is."
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "Which one is Josh?"
                            },
                            {
                                "Character": "JOSH",
                                "Line": "[as Leo points at him] I am."
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "Okay."
                            },
                            {
                                "Character": "TOBY",
                                "Line": "So, we finish second in South Carolina, we pick up some steam, some endorsements, mostly some money, going into South Dakota, Vermont, Maine --"
                            },
                            {
                                "Character": "SAM",
                                "Line": "Where we come away with a split, maybe better, and now the prohibitive nominee for the democratic candidate has lost 3 out of seven contests..."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "And half the actual primaries -"
                            },
                            {
                                "Character": "SAM",
                                "Line": "Leading into Super Tuesday."
                            },
                            {
                                "Character": "JOSH",
                                "Line": "Hoynes will take the South. We'll take the North and the Pacific Northwest."
                            },
                            {
                                "Character": "TOBY",
                                "Line": "This race will be decided a week later in Illinois."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Illinois will be High Noon."
                            },
                            {
                                "Character": "LEO",
                                "Line": "Sam, if we win in Illinois, will we have a shot at California and New York?"
                            },
                            {
                                "Character": "SAM",
                                "Line": "If we win in Illinois, we're going to run the table."
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "Well, that's it, then. And we saved people the trouble of voting. What's next?"
                            },
                            {
                                "Character": "JOSH",
                                "Line": "Our point is that it's --"
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "I understand the point. We're going to South Carolina to set up Illinois. When I ask, \"What's next?\", it means that I'm ready to move on to other things. So, what's next?"
                            },
                            {
                                "Character": "LEO",
                                "Line": "We're done."
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "Fantastic. Bartlet gets up and walks away. Josh walks over to Leo."
                            },
                            {
                                "Character": "JOSH",
                                "Line": "Well, I feel bathed in the warm embrace of the candidate."
                            },
                            {
                                "Character": "LEO",
                                "Line": "He's very easy to like, once you get to know him."
                            },
                            {
                                "Character": "JOSH",
                                "Line": "How many people get that far?"
                            },
                            {
                                "Character": "LEO",
                                "Line": "Not that many."
                            },
                            {
                                "Character": "JOSH",
                                "Line": "Okay."
                            }
                        ]
                    },
                    {
                        "Scene Heading": "CUT TO: INT. BARTLET HEADQUARTERS, JOSH'S OFFICE - CONTINUOUS",
                        "Description": "Donna is sitting on Josh's desk at the campaign office, consulting his calendar as she talks on the phone.",
                        "Dialogues": [
                            {
                                "Character": "DONNA",
                                "Line": "[into phone] Josh Lyman. Uh, no, he's not available right now. This afternoon? Uh, he's got a media session, and then a five o'clock with finance. Josh walks into his office, grabs a piece of paper, turns right around to leave and then does a double take."
                            },
                            {
                                "Character": "DONNA",
                                "Line": "I can get your name and number and give Josh the message when he gets back. Thank you very much. She hangs up the phone.",
                                "Descriptor": "CONT."
                            },
                            {
                                "Character": "JOSH",
                                "Line": "Hi."
                            },
                            {
                                "Character": "DONNA",
                                "Line": "Hi."
                            },
                            {
                                "Character": "JOSH",
                                "Line": "Who are you?"
                            },
                            {
                                "Character": "DONNA",
                                "Line": "I'm Donna Moss, who are you?"
                            },
                            {
                                "Character": "JOSH",
                                "Line": "I'm Josh Lyman."
                            },
                            {
                                "Character": "DONNA",
                                "Line": "Ah."
                            },
                            {
                                "Character": "JOSH",
                                "Line": "Yes."
                            },
                            {
                                "Character": "DONNA",
                                "Line": "I'm your new assistant."
                            },
                            {
                                "Character": "JOSH",
                                "Line": "Did I have an old assistant?"
                            },
                            {
                                "Character": "DONNA",
                                "Line": "Maybe not."
                            },
                            {
                                "Character": "JOSH",
                                "Line": "Who are you?"
                            },
                            {
                                "Character": "DONNA",
                                "Line": "I'm Donna Moss, I came here to volunteer and the woman assigned me to you."
                            },
                            {
                                "Character": "JOSH",
                                "Line": "Which woman?"
                            },
                            {
                                "Character": "DONNA",
                                "Line": "Becky."
                            },
                            {
                                "Character": "JOSH",
                                "Line": "You mean Margaret?"
                            },
                            {
                                "Character": "DONNA",
                                "Line": "Yes."
                            },
                            {
                                "Character": "JOSH",
                                "Line": "Who are you?"
                            },
                            {
                                "Character": "DONNA",
                                "Line": "I'm Donna Moss, I'll be working as your assistant."
                            },
                            {
                                "Character": "JOSH",
                                "Line": "I'm going to talk to Margaret."
                            },
                            {
                                "Character": "DONNA",
                                "Line": "[blocking his way] Actually, Josh --"
                            },
                            {
                                "Character": "JOSH",
                                "Line": "Yeah?"
                            },
                            {
                                "Character": "DONNA",
                                "Line": "When I said I was assigned to you?"
                            },
                            {
                                "Character": "JOSH",
                                "Line": "Yeah?"
                            },
                            {
                                "Character": "DONNA",
                                "Line": "I may have been overstating it a little."
                            },
                            {
                                "Character": "JOSH",
                                "Line": "Who are you? Josh and Donna walk and talk through the headquarters."
                            },
                            {
                                "Character": "DONNA",
                                "Line": "I'm Donna Moss, I drove up here from Madison, Wisconsin?"
                            },
                            {
                                "Character": "JOSH",
                                "Line": "When did your boyfriend break up with you?"
                            },
                            {
                                "Character": "DONNA",
                                "Line": "What makes you think that my boyfriend broke up with me?"
                            },
                            {
                                "Character": "JOSH",
                                "Line": "Well, you're too old for your parents to have kicked you out of the house."
                            },
                            {
                                "Character": "DONNA",
                                "Line": "I'm here because I want to work for Bartlet. I'm a college graduate, with a degree in Political Science and Government."
                            },
                            {
                                "Character": "JOSH",
                                "Line": "Where did you graduate?"
                            },
                            {
                                "Character": "DONNA",
                                "Line": "Hmm?"
                            },
                            {
                                "Character": "JOSH",
                                "Line": "Where did you graduate?"
                            },
                            {
                                "Character": "DONNA",
                                "Line": "Okay, when I said I graduated, I may have been overstating a little?"
                            },
                            {
                                "Character": "JOSH",
                                "Line": "Look --"
                            },
                            {
                                "Character": "DONNA",
                                "Line": "I was a couple of credits short."
                            },
                            {
                                "Character": "JOSH",
                                "Line": "From where?"
                            },
                            {
                                "Character": "DONNA",
                                "Line": "University of Wisconsin."
                            },
                            {
                                "Character": "JOSH",
                                "Line": "You majored in Political Science and Government?"
                            },
                            {
                                "Character": "DONNA",
                                "Line": "And, uh, Sociology and Psychology."
                            },
                            {
                                "Character": "JOSH",
                                "Line": "Uh-huh."
                            },
                            {
                                "Character": "DONNA",
                                "Line": "And biology for a while, with a minor in French?"
                            },
                            {
                                "Character": "JOSH",
                                "Line": "Okay."
                            },
                            {
                                "Character": "DONNA",
                                "Line": "And, uh, drama?"
                            },
                            {
                                "Character": "JOSH",
                                "Line": "You had five majors and two minors in four years?"
                            },
                            {
                                "Character": "DONNA",
                                "Line": "Two years."
                            },
                            {
                                "Character": "JOSH",
                                "Line": "Okay, listen..."
                            },
                            {
                                "Character": "DONNA",
                                "Line": "I had to drop out. I had to drop out."
                            },
                            {
                                "Character": "JOSH",
                                "Line": "Your boyfriend was older than you?"
                            },
                            {
                                "Character": "DONNA",
                                "Line": "I think that question is of a personal nature?"
                            },
                            {
                                "Character": "JOSH",
                                "Line": "Donna, you were just at my desk, reading my calendar, answering my phone, and hoping that I wouldn't notice that I never hired you. Your boyfriend was older?"
                            },
                            {
                                "Character": "DONNA",
                                "Line": "Yes."
                            },
                            {
                                "Character": "JOSH",
                                "Line": "Law student?"
                            },
                            {
                                "Character": "DONNA",
                                "Line": "Medical student."
                            },
                            {
                                "Character": "JOSH",
                                "Line": "And the idea was that you'd drop out and pay the bills till he was done with his residency."
                            },
                            {
                                "Character": "DONNA",
                                "Line": "Yes. They end up back in JOSH'S OFFICE."
                            },
                            {
                                "Character": "JOSH",
                                "Line": "And why did Dr. Freeloader break up with you."
                            },
                            {
                                "Character": "DONNA",
                                "Line": "What makes you think he broke up with me?"
                            },
                            {
                                "Character": "JOSH",
                                "Line": "Donna, this is a campaign for the Presidency, and there's nothing I take more seriously than that. This can't be a place where people come to find their confidence and start over."
                            },
                            {
                                "Character": "DONNA",
                                "Line": "Why not?"
                            },
                            {
                                "Character": "JOSH",
                                "Line": "I'm sorry?"
                            },
                            {
                                "Character": "DONNA",
                                "Line": "Why can't it be those things?"
                            },
                            {
                                "Character": "JOSH",
                                "Line": "Because --"
                            },
                            {
                                "Character": "DONNA",
                                "Line": "What, is it going to interfere with my typing?"
                            },
                            {
                                "Character": "JOSH",
                                "Line": "Donna, we're picking up today and going to South Carolina. If you want to stay in the Manchester office -"
                            },
                            {
                                "Character": "DONNA",
                                "Line": "I want to come to Charleston."
                            },
                            {
                                "Character": "JOSH",
                                "Line": "I can't carry you, Donna! I got a lot of guys out there not making the trip."
                            },
                            {
                                "Character": "DONNA",
                                "Line": "I'll pay my own way."
                            },
                            {
                                "Character": "JOSH",
                                "Line": "With what?"
                            },
                            {
                                "Character": "DONNA",
                                "Line": "I'll sleep on the floor, I'll sell my car. Eventually, you're going to put me on salary."
                            },
                            {
                                "Character": "JOSH",
                                "Line": "Donna."
                            },
                            {
                                "Character": "DONNA",
                                "Line": "Look. I think I might be good at this. I think you might find me valuable. The phone rings. Josh and Donna stare at each other, his look measuring, her's beseeching, through a couple of rings. Finally --"
                            },
                            {
                                "Character": "JOSH",
                                "Line": "Go ahead. Donna grabs the phone."
                            },
                            {
                                "Character": "DONNA",
                                "Line": "[into phone] Bartlet for America, Josh Lyman's office. Uh, yes, I think I'm going to have someone from the press office get back to you if it's related to -- yes. Uh, yes. Josh takes his badge holder off his neck and hands it to Donna, who smiles."
                            },
                            {
                                "Character": "DONNA",
                                "Line": "[into phone] Yes."
                            },
                            {
                                "Character": "FADE TO",
                                "Line": "INT. G.W. HOSPITAL - PRESENT A very concerned and teary-eyed Donna watches from outside Josh's operating room, while holding her White House badge."
                            },
                            {
                                "Character": "FADE OUT.",
                                "Line": "* * *"
                            }
                        ]
                    }
                ]
            },
            {
                "Section": "Act Four",
                "Scenes": [
                    {
                        "Scene Heading": "FADE IN: INT. THE WHITE HOUSE - DAY",
                        "Description": "TUESDAY, 8:46 AM",
                        "Dialogues": []
                    },
                    {
                        "Scene Heading": "CUT TO: INT. SAM'S OFFICE - CONTINUOUS",
                        "Description": "Sam is inside as C.J. knocks on the door.",
                        "Dialogues": [
                            {
                                "Character": "C.J.",
                                "Line": "Hey, Spanky."
                            },
                            {
                                "Character": "SAM",
                                "Line": "Oh, God, what did I do?"
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Take a walk with me, would you? C.J. and Sam walk and talk down the HALLWAY."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "They're taking him off bypass now."
                            },
                            {
                                "Character": "SAM",
                                "Line": "Yeah, I just heard. I'm going to head to the hospital."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "You did well on the morning shows."
                            },
                            {
                                "Character": "SAM",
                                "Line": "Thanks."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "I told Leo the reason I didn't want to do it was that it didn't feel right with Josh still in surgery."
                            },
                            {
                                "Character": "SAM",
                                "Line": "Yeah."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "You know what the real reason was?"
                            },
                            {
                                "Character": "SAM",
                                "Line": "The real reason?"
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Yeah."
                            },
                            {
                                "Character": "SAM",
                                "Line": "No."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "I think you do."
                            },
                            {
                                "Character": "SAM",
                                "Line": "Listen, C.J...."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "[to aide] Suzanne. [to Sam] The real reason I couldn't go on the morning shows and give a first-hand account of what happened is that I couldn't remember what happened. I remember walking out of the building, I remember somebody knocked me down, I know my necklace came off, and I know a police car window exploded over my head. All night long, I've been doing my press briefings using notes from other people's accounts. But it's morning now, and after listening to you on the morning shows, I know what happened."
                            },
                            {
                                "Character": "SAM",
                                "Line": ""
                            },
                            {
                                "Character": "C.J....",
                                "Line": ""
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Sam. I think you have my necklace."
                            },
                            {
                                "Character": "SAM",
                                "Line": "I didn't want you to feel beholden to me. I didn't want it to be like an episode of \"I Dream of Jeannie\" where now you have to save my life..."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Sam."
                            },
                            {
                                "Character": "SAM",
                                "Line": "...the time-space continuum, where you have to follow me around with coconut oil and hot towels..."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Coconut oil?"
                            },
                            {
                                "Character": "SAM",
                                "Line": "I'm just saying."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Sam, I don't feel beholden to you."
                            },
                            {
                                "Character": "SAM",
                                "Line": "Why not? I saved your life."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Can I have my necklace back? She smiles at him sweetly as he searches his pockets for the necklace and hands it to her."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Thank you."
                            },
                            {
                                "Character": "SAM",
                                "Line": "I'll be in my office."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Sam?"
                            },
                            {
                                "Character": "SAM",
                                "Line": "Yeah."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Were you scared?"
                            },
                            {
                                "Character": "SAM",
                                "Line": "[pauses and steadies himself] Yeah."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Me too. Thanks. Sam walks back to his office. C.J. opens a door and steps into the loud and glare that is the press room."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "I have an update, and I can give you a ballistics report, so let's get started. The reporters clamor for C.J.",
                                "Descriptor": "VO"
                            }
                        ]
                    },
                    {
                        "Scene Heading": "CUT TO: EXT. OUTSIDE G.W. HOSPITAL - DAY",
                        "Description": "Ron Butterfield is doing a security check, as Toby walks up to him.",
                        "Dialogues": [
                            {
                                "Character": "TOBY",
                                "Line": "Ron."
                            },
                            {
                                "Character": "RON",
                                "Line": "Hey, Toby. I heard they're about to take him off bypass."
                            },
                            {
                                "Character": "TOBY",
                                "Line": "Pretty soon, yeah. Listen, can I talk to you for a minute?"
                            },
                            {
                                "Character": "RON",
                                "Line": "Sure. [to cop] Sergeant, I want those people in the corner backed up another 200 feet."
                            },
                            {
                                "Character": "COP",
                                "Line": "Yes, sir."
                            },
                            {
                                "Character": "RON",
                                "Line": "And if they move again, then handcuff them to a parking meter."
                            },
                            {
                                "Character": "TOBY",
                                "Line": "How's your hand?"
                            },
                            {
                                "Character": "RON",
                                "Line": "It's fine."
                            },
                            {
                                "Character": "TOBY",
                                "Line": "You should be home."
                            },
                            {
                                "Character": "RON",
                                "Line": "What's on your mind?"
                            },
                            {
                                "Character": "TOBY",
                                "Line": "C.J.'s starting to get some questions about why the President's exit wasn't covered in Rosslyn."
                            },
                            {
                                "Character": "RON",
                                "Line": "The Secret Service doesn't comment on procedure."
                            },
                            {
                                "Character": "TOBY",
                                "Line": "Yeah. Ron, a few weeks after the President was sworn in, you got a memo about his protection."
                            },
                            {
                                "Character": "RON",
                                "Line": "Yeah."
                            },
                            {
                                "Character": "TOBY",
                                "Line": "It said he wanted to enter and exit in the open air, and he didn't like the feeling of traveling around in an armored tank."
                            },
                            {
                                "Character": "RON",
                                "Line": "Yeah."
                            },
                            {
                                "Character": "TOBY",
                                "Line": "Specifically, it said he wouldn't use the tent or the canopy anymore."
                            },
                            {
                                "Character": "RON",
                                "Line": "Yeah."
                            },
                            {
                                "Character": "TOBY",
                                "Line": "I wrote that memo, and the President signed it at my urging."
                            },
                            {
                                "Character": "RON",
                                "Line": "I know."
                            },
                            {
                                "Character": "TOBY",
                                "Line": "Ron, I don't think it's right that the Secret Service get blamed for what happened last night, I want the Treasury Department to hand over my memo to the Press."
                            },
                            {
                                "Character": "RON",
                                "Line": "No, we can't do that."
                            },
                            {
                                "Character": "TOBY",
                                "Line": "There are going to be a lot of questions."
                            },
                            {
                                "Character": "RON",
                                "Line": "There are always a lot of questions."
                            },
                            {
                                "Character": "TOBY",
                                "Line": "Ron."
                            },
                            {
                                "Character": "RON",
                                "Line": "Don't worry about it, Toby."
                            },
                            {
                                "Character": "TOBY",
                                "Line": "It's not right. You're the guys - look at your hand."
                            },
                            {
                                "Character": "RON",
                                "Line": "My hand is fine."
                            },
                            {
                                "Character": "TOBY",
                                "Line": "Your hand is not fine."
                            },
                            {
                                "Character": "RON",
                                "Line": "Toby."
                            },
                            {
                                "Character": "TOBY",
                                "Line": "Let me go over there and tell them it was my fault."
                            },
                            {
                                "Character": "RON",
                                "Line": "It wasn't your fault."
                            },
                            {
                                "Character": "TOBY",
                                "Line": "Ron."
                            },
                            {
                                "Character": "RON",
                                "Line": "It wasn't your fault. It wasn't Gina's fault, it wasn't Charlie's fault, it wasn't anybody's fault, Toby. It was an act of madmen. You think a tent was going to stop them? We got the President in the car. We got Zoey in the car. And at 150 yards, five stories up, the shooters were down 9.2 seconds after the first shot was fired. I would never let you not let me protect the President. You tell us you don't like something, we figure out something else. It was an act of madmen. Anyway, the Secret Service doesn't comment on procedure."
                            },
                            {
                                "Character": "TOBY",
                                "Line": "Okay. Ron walks away."
                            },
                            {
                                "Character": "TOBY",
                                "Line": "Good job last night."
                            },
                            {
                                "Character": "RON",
                                "Line": "Thank you. Toby sits down on a bench and sighs heavily."
                            }
                        ]
                    },
                    {
                        "Scene Heading": "CUT TO: INT. THE BRIEFING ROOM - DAY",
                        "Description": "C.J. is on a TV screen in the back of the pressroom holding another briefing. The camera pans up to Leo, who is watching her. He gives the nod to Margaret, who pulls Danny aside and directs him over to Leo.",
                        "Dialogues": [
                            {
                                "Character": "C.J.",
                                "Line": "The Secret Service Agents carry a weapon called a .357 sig-hauer. The agents on the roof shot the two men with .726 caliber rifles that are referred to as JAR, which believe it or not, stands for \"Just Another Rifle\". They are made specifically and exclusively for the Secret Service. Danny approaches Leo in the back of the room."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "I wanted to mention...",
                                "Descriptor": "OS"
                            },
                            {
                                "Character": "DANNY",
                                "Line": "Leo?"
                            },
                            {
                                "Character": "LEO",
                                "Line": "Shh."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "This is our 5th press briefing since midnight. Obviously, there's one story that going dominating news around the world for the next few days, and it would be easy to think that President Bartlet, Joshua Lyman, and Stephanie Abbott were the only victims of a gun crime last night. They weren't. Mark Davis and Sheila Evans of Philadelphia were killed by a gun last night. He was a Biology Teacher and she was a Nursing student. Tina Bishop and Linda Larkin were killed with a gun last night. They were 12. There were 36 homicides last night. 480 sexual assaults, 3,411 robberies, 3,685 aggravated assaults, all at gunpoint. And if anyone thinks those crimes could have been prevented if the victims themselves had been carrying guns, I'd only remind you that the President of the United States himself was shot last night while surrounded by the best trained armed guards in the history of the world. Back to the briefing. C.J. continues the briefing."
                            },
                            {
                                "Character": "DANNY",
                                "Line": "She's good."
                            },
                            {
                                "Character": "LEO",
                                "Line": "Yes, she is."
                            },
                            {
                                "Character": "DANNY",
                                "Line": "Leo..."
                            },
                            {
                                "Character": "LEO",
                                "Line": "I'm going to the hospital. Why don't you ride with me? Leo exits the Press Room as Danny follows."
                            }
                        ]
                    },
                    {
                        "Scene Heading": "CUT TO: INT. A HOTEL ROOM IN CHICAGO - FLASHBACK",
                        "Description": "",
                        "Dialogues": [
                            {
                                "Character": "SHERATON CENTRE HOTEL",
                                "Line": "CHICAGO, ILLINOIS The T.V. screen shows the results from the primary. The camera pans across room, finally following Sam and Leo as they cross it."
                            },
                            {
                                "Character": "SAM",
                                "Line": "We're starting to get some good exit polling, at Stark County and Rock Island."
                            },
                            {
                                "Character": "LEO",
                                "Line": "How good?"
                            },
                            {
                                "Character": "SAM",
                                "Line": "We're running at 53 to 58 with the undecideds, from 72 hours ago, at the 12th, 14th and 15th."
                            },
                            {
                                "Character": "LEO",
                                "Line": "That's the Money!"
                            },
                            {
                                "Character": "SAM",
                                "Line": "DeWitt County, Cumberland!"
                            },
                            {
                                "Character": "JOSH",
                                "Line": "Yeah!"
                            },
                            {
                                "Character": "LEO",
                                "Line": "Who are you talking to?"
                            },
                            {
                                "Character": "JOSH",
                                "Line": "I'm talking to nobody. There's no one at my house."
                            },
                            {
                                "Character": "LEO",
                                "Line": "What's going on?"
                            },
                            {
                                "Character": "JOSH",
                                "Line": "Nothing. My dad had his chemo today. These exit polls are going to cheer him up."
                            },
                            {
                                "Character": "LEO",
                                "Line": "Sam said that we got the 72 hour undecideds in the 14th and 15th. Abbey walks up to them."
                            },
                            {
                                "Character": "ABBEY",
                                "Line": "Leo, is there any food in this room that isn't fried?"
                            },
                            {
                                "Character": "LEO",
                                "Line": "Well, if there is, let's get rid of it."
                            },
                            {
                                "Character": "ABBEY",
                                "Line": "I'm not kidding."
                            },
                            {
                                "Character": "LEO",
                                "Line": "Good exits from Stark County and Rock Island."
                            },
                            {
                                "Character": "ABBEY",
                                "Line": "How good?"
                            },
                            {
                                "Character": "LEO",
                                "Line": "They're good."
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "Leo! Bartlet enters the arm, very grumpy.",
                                "Descriptor": "VO"
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "What the hell is this?"
                            },
                            {
                                "Character": "JOSH",
                                "Line": "That's Sam's draft of your victory remarks."
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "\"I congratulate my opponent on a well-fought campaign in Illinois\"?"
                            },
                            {
                                "Character": "LEO",
                                "Line": "You don't want to congratulate him?"
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "Yes, I want to congratulate him, but I'd like to call him by his name! Are we back to this old crap again?"
                            },
                            {
                                "Character": "JOSH",
                                "Line": "Governor, we just--"
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "Leo, I want to go over this whole thing with you."
                            },
                            {
                                "Character": "LEO",
                                "Line": "Excuse me. He follows Bartlet out of the room."
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "It's the exact same crap all over again! It's amateur hour...!",
                                "Descriptor": "VO"
                            },
                            {
                                "Character": "ABBEY",
                                "Line": "[to Josh] You can say it, you know. It's not like I haven't heard it before."
                            },
                            {
                                "Character": "JOSH",
                                "Line": "Your husband's a real son of a bitch, Mrs. Bartlet."
                            },
                            {
                                "Character": "ABBEY",
                                "Line": "He doesn't like being handled."
                            },
                            {
                                "Character": "JOSH",
                                "Line": "Well, I think that if he looked around, he'd see that nobody's handling him."
                            },
                            {
                                "Character": "ABBEY",
                                "Line": "He's not ready yet, Josh. He's terrified."
                            },
                            {
                                "Character": "JOSH",
                                "Line": "Well, is he going to be ready?"
                            },
                            {
                                "Character": "ABBEY",
                                "Line": "You bet your ass he will. In the meantime, you want to kick something, kick me. We switch our view to Sam, Toby and C.J. by the T.V."
                            },
                            {
                                "Character": "SAM",
                                "Line": "Toby."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Here it comes!"
                            },
                            {
                                "Character": "T.V. REPORTER",
                                "Line": "With 17% of the precincts reporting, we are now ready to call the Illinois primary for former New Hampshire Governor Jed Bartlet. Everyone cheers, cheers, cheers all around, and hugs as \"Celebration\" by Kool and the Gang plays."
                            },
                            {
                                "Character": "JOSH",
                                "Line": "[pointing at Sam] Yes! Leo enters and gives Josh a big hug."
                            },
                            {
                                "Character": "LEO",
                                "Line": "Hey, hey, hey! Way to go! Now, let's get to California. Leo runs away to party."
                            },
                            {
                                "Character": "JOSH",
                                "Line": "Leo, we've got to replace this music, we've got to replace it with some Doobie Brothers! Donna walks up to Josh apprehensively as the others party round."
                            },
                            {
                                "Character": "DONNA",
                                "Line": "Josh?"
                            },
                            {
                                "Character": "JOSH",
                                "Line": "And Donna, you've got to get happy, Donna, you just won the Illinois Primary, come dance with me!"
                            },
                            {
                                "Character": "DONNA",
                                "Line": "No, Josh. No, Josh... your father died. Josh stares at her, stunned."
                            },
                            {
                                "Character": "FADE TO",
                                "Line": "INT. CHICAGO AIRPORT - NIGHT In a T.V. screen at the airplane gate, we see a reporter."
                            },
                            {
                                "Character": "REPORTER",
                                "Line": "...very happy Bartlet Supporters. We are told the candidate is in the suite, refining his remarks, he's due to be down here at any moment. Just over an hour ago... The camera pulls down to the coolest blocking on television. Two men walk under the TV, one right past an oblivious Josh. The first man says something into his sleeve, and stops to stand about three feet away from Josh, near the counter. The second man, earpiece visible, walks past Josh on the other side of his seat, and stops to stand near the windows. Josh doesn't quite realize what's going on until a third man slides into view in the front left of the screen. All of a sudden, Bartlet appears, walking out of the right side of screen, directly behind Josh. [Do yourself a favor -- if you've got it on tape, watch it a couple of more times. It's the coolest thing ever.]"
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "Josh?"
                            },
                            {
                                "Character": "JOSH",
                                "Line": "[jumping up] Governor!"
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "Your father died, Josh. I can't believe it."
                            },
                            {
                                "Character": "JOSH",
                                "Line": "Yeah, uh, Governor, you -- you shouldn't be here."
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "What happened? Bartlet sits down. Josh also awkwardly sits."
                            },
                            {
                                "Character": "JOSH",
                                "Line": "He, uh, went for his chemotherapy and he unexpectedly developed a pulmonary embolism, it's a --"
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "It's a blood clot."
                            },
                            {
                                "Character": "JOSH",
                                "Line": "Yeah. It went to his heart and there was cardiac arrest."
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "Yeah... Yeah."
                            },
                            {
                                "Character": "JOSH",
                                "Line": "Governor, you should really get back to the ballroom, so that you can get on a plane and get to California."
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "He was a lawyer?"
                            },
                            {
                                "Character": "JOSH",
                                "Line": "Yeah, a litigator."
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "Did he like that you were in politics?"
                            },
                            {
                                "Character": "JOSH",
                                "Line": "I think he would have liked grandchildren more."
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "[chuckling] He would've."
                            },
                            {
                                "Character": "JOSH",
                                "Line": "He liked that I was working for you. He liked that we were starting to do well. He would've liked tonight. At least his friends and neighbors will be spared all the... you know..."
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "He'd have been doing some bragging?"
                            },
                            {
                                "Character": "JOSH",
                                "Line": "Yeah, and your name wouldn't have come up, by the way. \"My son won the Illinois primary tonight\". Three more hours, and he would have been able to say that. He'd have been proud."
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "He was already. Trust me, Josh, I'm a father. He was already."
                            },
                            {
                                "Character": "JOSH",
                                "Line": "I appreciate that, Governor. You should really get back to the hotel."
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "Nah, I'm okay."
                            },
                            {
                                "Character": "JOSH",
                                "Line": "Sir, not that I don't appreciate you coming down here, but there's a ballroom full of people waiting for a victory speech."
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "They'll wait."
                            },
                            {
                                "Character": "JOSH",
                                "Line": "Yeah, they will, but the people watching television won't."
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "I've been a real jackass to you, Josh."
                            },
                            {
                                "Character": "JOSH",
                                "Line": "Well."
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "To everybody. Toby Ziegler, C.J. Cregg, Sam Seaborn."
                            },
                            {
                                "Character": "JOSH",
                                "Line": "Yeah."
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "Don't think I don't know what you gave up to work on this campaign, and don't think that I don't know your value. And I'll never make you think I don't again. You got to be a little impressed that I got all those names right just now. Josh chuckles."
                            },
                            {
                                "Character": "FLIGHT ATTENDANT",
                                "Line": "Delta Airlines Flight 175 to Kennedy International now boarding...",
                                "Descriptor": "VO"
                            },
                            {
                                "Character": "JOSH",
                                "Line": "They're calling my flight. He gets up, and so does Bartlet."
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "You want me to go with you?"
                            },
                            {
                                "Character": "JOSH",
                                "Line": "[stops] Go with me?"
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "Maybe you want some company on the plane. He starts to feel all his pockets for his wallet."
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "I could get a ticket and come with you."
                            },
                            {
                                "Character": "JOSH",
                                "Line": "Governor! California. You have to go the ballroom and give a Victory speech in primetime and go to California."
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "I guess you're right."
                            },
                            {
                                "Character": "JOSH",
                                "Line": "[laughing] You guess I'm right? Listen to me, Governor, if you don't lose this election, it isn't going to be because you didn't try hard enough. But it was nice of you to ask. Thank you, I appreciate."
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "They're calling your flight. Josh turns to board the plane, taking one last look at Bartlet, who nods encouragingly to him. Josh boards the plane. Leo walks up behind Bartlet."
                            },
                            {
                                "Character": "LEO",
                                "Line": "Is he going to be all right?"
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "He's going to be fine."
                            },
                            {
                                "Character": "LEO",
                                "Line": "Good. Bartlet turns around to face Leo."
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "Leo?"
                            },
                            {
                                "Character": "LEO",
                                "Line": "Yeah?"
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "I'm ready. Leo grins in understanding, and then joins Bartlet as they walk out of the terminal, several people recognizing Bartlet and stopping to shake his hand, all the while we hear Bartlet giving his speech."
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "Tonight, what began on the commons in Concord, Massachusetts, as an alliance of farmers and workers, of cobbles man and tinsmiths, of statesmen and students, of mothers and wives, of men and boys, lives two centuries later as America! My name is Josiah Bartlet, and I accept your nomination for the Presidency of the United States! The speech ends, we hear cheers and applause, but we--",
                                "Descriptor": "VO"
                            },
                            {
                                "Character": "FADE TO WHITE.",
                                "Line": ""
                            },
                            {
                                "Character": "DR. HOLBROOK",
                                "Line": "Josh? Josh, wake up, it's okay.",
                                "Descriptor": "VO"
                            },
                            {
                                "Character": "FADE TO",
                                "Line": "INT. HOSPITAL ROOM - PRESENT The camera is closed in on Josh, lying on his hospital bed, with his eyes closed."
                            },
                            {
                                "Character": "DR. HOLBROOK",
                                "Line": "I want you to wake up. Josh opens his eyes slowly and looks around, muttering something as the camera pulls back from his face. He is surrounded by Leo, the doctors, and Bartlet, who leans in.",
                                "Descriptor": "OS"
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "I couldn't hear you, Josh. Bartlet leans in closer, and then pulls back."
                            },
                            {
                                "Character": "LEO",
                                "Line": "What did he say?"
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "He said, \"What's next?\" Bartlet lays his hand on Josh's head as we --"
                            }
                        ]
                    },
                    {
                        "Scene Heading": "DISSOLVE TO: END TITLES.",
                        "Description": "",
                        "Dialogues": [
                            {
                                "Character": "FADE TO BLACK.",
                                "Line": "* * *"
                            }
                        ]
                    }
                ]
            }
        ]
    }
}