{
    "Series": "\"The Stackhouse Filibuster\"",
    "Episode": {
        "Number": "2.17",
        "Title": "The Stackhouse Filibuster",
        "Original Airdate": "March 14, 2001, 9:00 P.M. EST",
        "Credits": {
            "Teleplay By": "AARON SORKIN",
            "Story By": "PETE MCCABE",
            "Directed By": "BRYAN GORDON"
        },
        "Sections": [
            {
                "Section": "Teaser",
                "Scenes": [
                    {
                        "Scene Heading": "FADE IN: EXT. WASHINGTON, D.C. - NIGHT",
                        "Description": "C.J. (VO) Dear Dad. First of all, Happy Birthday. Second of all, let me explain why I'm not on my way there right now. You're not going to believe this, but it's because of a filibuster. A filibuster no one ever saw coming. Not the Senate leadership. Not the Party leadership. And not me.",
                        "Dialogues": []
                    },
                    {
                        "Scene Heading": "CUT TO: INT. C.J.'S OFFICE - NIGHT",
                        "Description": "C.J. is sitting at her computer typing an email to her father. A television is on in the background. C.J. (VO) And if you're angry at me, well, you've got a lot of company. I'm going to explain all this. Right now, it's Friday night and everyone is trying to get out the door - only I won't let them.",
                        "Dialogues": []
                    },
                    {
                        "Scene Heading": "CUT TO: INT. SAM'S OFFICE - NIGHT",
                        "Description": "A television is shown to be on C-SPAN2, broadcasting the U.S. Senate Live. A Democratic Senator from Minnesota, HOWARD STACKHOUSE, has the floor and is reading from a recipe book.",
                        "Dialogues": [
                            {
                                "Character": "HOWARD STACKHOUSE",
                                "Line": "...non absorbent paper. Yields approximately four servings. Sam is watching the television, looking quite dismayed."
                            },
                            {
                                "Character": "SAM",
                                "Line": "(to himself) This isn't happening. Sam looks at his watch as STACKHOUSE continues to read."
                            },
                            {
                                "Character": "STACKHOUSE",
                                "Line": "...sauce, or chili sauce... Sam spots C.J. in the COMMUNICATIONS OFFICE."
                            },
                            {
                                "Character": "SAM",
                                "Line": "C.J.!"
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Yeah."
                            },
                            {
                                "Character": "SAM",
                                "Line": "What the hell is he doing? Sam and C.J. walk through into the CORRIDOR."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "It's a recipe for deep fried fantail shrimp."
                            },
                            {
                                "Character": "SAM",
                                "Line": "Yeah. But, what's he still doing up there?"
                            },
                            {
                                "Character": "C.J.",
                                "Line": "He's got a recipe book."
                            },
                            {
                                "Character": "SAM",
                                "Line": "How long will it go?"
                            },
                            {
                                "Character": "C.J.",
                                "Line": "I don't know."
                            },
                            {
                                "Character": "SAM",
                                "Line": "I'm saying how many recipes are there?"
                            },
                            {
                                "Character": "C.J.",
                                "Line": "All together?"
                            },
                            {
                                "Character": "SAM",
                                "Line": "Yeah."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "I can't cook, but I think there are probably like 20 or 30."
                            },
                            {
                                "Character": "SAM",
                                "Line": "You're screwing around with me."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Oh, yeah."
                            },
                            {
                                "Character": "SAM",
                                "Line": "I'm about to miss the 7:30 shuttle. If I miss the 8:30, I miss the last train to Sag Harbor. C.J. is handed a piece of paper by a staffer."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "You can spend the night in New York."
                            },
                            {
                                "Character": "SAM",
                                "Line": "I've only got two nights. And you've gotta see this house."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "It's cool?"
                            },
                            {
                                "Character": "SAM",
                                "Line": "It's Frank Lloyd Wright."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Is it cold in Sag Harbor right now?"
                            },
                            {
                                "Character": "SAM",
                                "Line": "We wear sweaters. It's a Tommy Hilfiger ad."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "It can't last forever."
                            },
                            {
                                "Character": "SAM",
                                "Line": "He's got twenty to thirty recipes he can read. Sam stops walking while C.J. continues through swinging doors into the JOSH'S BULLPEN, still talking to Sam."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Sam, seriously, there are more recipes than that."
                            },
                            {
                                "Character": "SAM",
                                "Line": "Who cares? He's blowing my weekend in the Hamptons."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Maybe he doesn't know about the sweaters. C.J. (VO) The reason they needed to stick around was that the moment the filibuster's over, there will be a vote and once they vote, I need my spin boys. C.J. is walking through JOSH'S BULLPEN."
                            },
                            {
                                "Character": "JOSH",
                                "Line": ""
                            },
                            {
                                "Character": "C.J....",
                                "Line": ""
                            },
                            {
                                "Character": "C.J.",
                                "Line": "I know! Josh jumps up from his chair and walks with C.J. through the bullpen."
                            },
                            {
                                "Character": "JOSH",
                                "Line": "Who gave him the recipe book?"
                            },
                            {
                                "Character": "C.J.",
                                "Line": "I really don't think we can blame this on the recipe book. Plus, I now know the secret to cold asparagus chantilly is a quarter cup whipped cream."
                            },
                            {
                                "Character": "JOSH",
                                "Line": "I'm going to Port Saint Lucie, which may not mean anything to you, but happens to be the spring training home of the..."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "New York Jets. Yes, you've told me. Josh, you can watch basketball on T.V."
                            },
                            {
                                "Character": "JOSH",
                                "Line": "Yes, except the New York Knicks are a basketball team, the New York Jets are a football team, and Port Saint Lucie is the spring training home of the New York..."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "(exasperated) Mets! Yes. Dammit, I'm inadequate. Josh stops at the bottom of a small staircase that leads to the Briefing Room, while C.J. continues. C.J. stops at the top to listen to Josh."
                            },
                            {
                                "Character": "JOSH",
                                "Line": "A weekend at spring training. Mike Piazza is going to be standing in the batting cage. (strikes a batting pose) He's going to turn and see me. He's going to say, 'Dude.'"
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Well, I wouldn't want you to miss a legitimate 'dude' sighting."
                            },
                            {
                                "Character": "JOSH",
                                "Line": "(excited) So I can take off?"
                            },
                            {
                                "Character": "C.J.",
                                "Line": "No. C.J. walks into the PRESS BRIEFING ROOM which is full of reporters. C.J. (VO) Why do I need the spin? Because it's a bipartisan bill and I'm all for bipartisanship as long as we get the credit. So, I've taken the press corps hostage. The moment C.J. enters and heads for the podium, all of the reporters start calling her name. A television in the room is tuned to Stackhouse on C-SPAN2 as he continues to talk."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Guys, I'm sorry, but you know what? Listen, seriously, you're looking at democracy at work, it's a beautiful thing."
                            },
                            {
                                "Character": "REPORTER 1",
                                "Line": "And how much more beauty can we be expecting tonight, C.J."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Well, I wouldn't think it would be that much longer."
                            },
                            {
                                "Character": "REPORTER 2",
                                "Line": "He's got a recipe book."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Yeah, but how many recipes can there be? 20? 30? Another reporter, Mark, rushes up to C.J."
                            },
                            {
                                "Character": "MARK",
                                "Line": "(in a loud whisper) C.J., it's Friday night. I'm supposed to have dinner with my girlfriend. She's going to kill me."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Yeah, but you know what, Mark? This is just the kind of thing that can cleanse the palate of a relationship that's gone stale. Like a fine sorbet."
                            },
                            {
                                "Character": "MARK",
                                "Line": "We've been going out three weeks."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "And she's already bitching about dinner?"
                            },
                            {
                                "Character": "MARK",
                                "Line": ""
                            },
                            {
                                "Character": "C.J....",
                                "Line": ""
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Lose her. Mark goes back to his seat as C.J. walks behind the podium. The reporters start to call her name again."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Listen up! Everybody, this was unforeseen. Obviously, he's got to finish sometime. When he does, there will be a vote immediately. When it's done, the President will make his calls, White House staff will be available for comment, and most important you will all write about it. In the mean time, I say, pizza for everybody! Who's with me? The room is silent."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Excellent! C.J. gathers her papers and leaves. Carol meets her outside the door and follows C.J. through the CORRIDOR."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "We're going to need like a massive truckload of pizza. And, I don't know, maybe some Cuervo 1800 if we've got some lying around."
                            },
                            {
                                "Character": "CAROL",
                                "Line": "How much?"
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Just enough for me. Toby approaches."
                            },
                            {
                                "Character": "TOBY",
                                "Line": "C.J. Just so you know, I need to be in Telluride first thing in the morning."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "That's a rough assignment you pulled there."
                            },
                            {
                                "Character": "TOBY",
                                "Line": "No, I'm saying, I already missed the 6:50 to Denver, but I can catch an 8:40 from National if I change planes in Chicago. C.J. and Toby enter C.J.'S OFFICE. Toby is bouncing his pink rubber ball."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "And as you're travel agent, it's important that you update me on that information."
                            },
                            {
                                "Character": "TOBY",
                                "Line": ""
                            },
                            {
                                "Character": "C.J....",
                                "Line": ""
                            },
                            {
                                "Character": "C.J.",
                                "Line": "I'm supposed to be on my way to Napa right now for my Dad's 70th birthday. You hear me complaining?"
                            },
                            {
                                "Character": "TOBY",
                                "Line": "You just did."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Get out. C.J. sits behind her desk with her computer."
                            },
                            {
                                "Character": "TOBY",
                                "Line": "It's your dad's 70th birthday?"
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Yeah."
                            },
                            {
                                "Character": "TOBY",
                                "Line": "You doing anything?"
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Yeah, we're all getting together in Napa."
                            },
                            {
                                "Character": "TOBY",
                                "Line": "(quietly) I meant right now."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "No. I'm sitting and waiting. I'm ordering pizza. I'm catching up on e-mails."
                            },
                            {
                                "Character": "TOBY",
                                "Line": "All right. I got a a basketball game on in my office if you want to come by?"
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Is it the Jets and the Mets?"
                            },
                            {
                                "Character": "TOBY",
                                "Line": "It's the Nets and the Hawks. [with disdain] The Jets and the Mets?"
                            },
                            {
                                "Character": "C.J.",
                                "Line": "I know the teams. I'm joking when I do this. I'm joking when I do this."
                            },
                            {
                                "Character": "TOBY",
                                "Line": "Okay. Toby turns to leave, then turns back around."
                            },
                            {
                                "Character": "TOBY",
                                "Line": "You know there's a 9:00 to SFO. You could drive to Napa."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Yeah."
                            },
                            {
                                "Character": "TOBY",
                                "Line": "All right. I'm in my office. C.J. turns to look at the television, where Stackhouse is still speaking."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "It'll end."
                            },
                            {
                                "Character": "TOBY",
                                "Line": "Do you have any idea how many recipes there are?"
                            },
                            {
                                "Character": "C.J.",
                                "Line": "I really don't. Toby leaves. STACKHOUSE (on T.V.) ...teaspoon of dry mustard... C.J. begins to type. C.J. (VO) So, the press is in the briefing room. The staff is in the West Wing. And I'm right here. I'm betting when you read this, you're going to be glad I stayed. I'm betting you're going to end up rooting for a Minnesota Senator named Howard Stackhouse. 'Cause I gotta tell ya, this doesn't seem like any old filibuster."
                            }
                        ]
                    },
                    {
                        "Scene Heading": "SMASH CUT TO: MAIN TITLES.",
                        "Description": "",
                        "Dialogues": [
                            {
                                "Character": "END TEASER",
                                "Line": "* * *"
                            }
                        ]
                    }
                ]
            },
            {
                "Section": "Act One",
                "Scenes": [
                    {
                        "Scene Heading": "FADE IN: INT. C.J.'S OFFICE - NIGHT",
                        "Description": "C.J. continues typing her e-mail.",
                        "Dialogues": [
                            {
                                "Character": "C.J.",
                                "Line": "It's our first filibuster, and I'm not a rules expert, but the rules of a filibuster are simple enough-you keep the floor as long as you hold the floor. What does that mean? It means you can't stop talking, ever. You can't eat, and you can't drink, which is fine, because you can't leave the chamber to use the bathroom, either. But all that's nothing compared to this: you're not allowed to sit down-you're not allowed to lean on anything or, for that matter, anyone. It started with the bill you'll read about tomorrow morning called the Family Wellness Act. Josh had been leading staffers from the Legislative Liaison Office in negotiations with the conference chairman for weeks and this last Monday morning he walked into the Roosevelt Room and said...",
                                "Descriptor": "VO"
                            }
                        ]
                    },
                    {
                        "Scene Heading": "CUT TO: INT. THE ROOSEVELT ROOM - DAY",
                        "Description": "Josh enters and seats himself at the table.",
                        "Dialogues": [
                            {
                                "Character": "JOSH",
                                "Line": "We got the Family Wellness Act."
                            },
                            {
                                "Character": "LEO",
                                "Line": "It's done?"
                            },
                            {
                                "Character": "JOSH",
                                "Line": "Yes, sir."
                            },
                            {
                                "Character": "LEO",
                                "Line": "What'd we get, what'd we lose?"
                            },
                            {
                                "Character": "JOSH",
                                "Line": "We got most of what we wanted in Title VII."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "That's infant hearing loss?"
                            },
                            {
                                "Character": "JOSH",
                                "Line": "Yeah, we got a hearing test for every child born in the US."
                            },
                            {
                                "Character": "SAM",
                                "Line": "What about...?"
                            },
                            {
                                "Character": "JOSH",
                                "Line": "We did not get mandatory tests for children not born in hospitals."
                            },
                            {
                                "Character": "SAM",
                                "Line": "We can live with that."
                            },
                            {
                                "Character": "LEO",
                                "Line": "The Special Needs Adoption Awareness program?"
                            },
                            {
                                "Character": "JOSH",
                                "Line": "Right, this is a national campaign to provide information to the public regarding the adoption of special needs children."
                            },
                            {
                                "Character": "LEO",
                                "Line": "How'd we get it?"
                            },
                            {
                                "Character": "JOSH",
                                "Line": "By agreeing to a provision that would require health care staff to give pregnant women information about adoption on an equal basis with all other courses of action."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "National Organization for Women's gonna hate that."
                            },
                            {
                                "Character": "JOSH",
                                "Line": "I know."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Women seeking abortions should not be required by law to be lectured at."
                            },
                            {
                                "Character": "JOSH",
                                "Line": "Yeah, but you're gonna help me out there, right?"
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Yes, I will. I will once again and betray the sisterhood. Josh and the other men look down with small smiles."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "[pointing to each] Okay, I saw you, you, you, and you roll your eyes."
                            },
                            {
                                "Character": "LARRY",
                                "Line": "You weren't even looking at me."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "I felt you."
                            },
                            {
                                "Character": "LEO",
                                "Line": "[standing with others and clapping] We're done! Josh Lyman, everybody. They all exit. Sam leaves with Josh."
                            },
                            {
                                "Character": "SAM",
                                "Line": "Nice job."
                            },
                            {
                                "Character": "JOSH",
                                "Line": "I know, I'm thinking seriously about turning pro."
                            },
                            {
                                "Character": "SAM",
                                "Line": "Yeah?"
                            },
                            {
                                "Character": "JOSH",
                                "Line": "Yeah, I got agents talking to me, telling me I could go high in the second round, maybe low in the first if I have a good postseason."
                            },
                            {
                                "Character": "SAM",
                                "Line": "You don't want to stay in school, get your education?"
                            },
                            {
                                "Character": "JOSH",
                                "Line": "Nah, I'm white, nobody's gonna mind. They walk into LEO'S OFFICE."
                            },
                            {
                                "Character": "LEO",
                                "Line": "Josh, this looks good. I mean, he stuck sunsets on a bunch of small-ticket items, but..."
                            },
                            {
                                "Character": "JOSH",
                                "Line": "But that's the way it's gonna happen."
                            },
                            {
                                "Character": "LEO",
                                "Line": "You just spent six billion dollars on health care. How do you feel?"
                            },
                            {
                                "Character": "JOSH",
                                "Line": "I'd feel better if it meant just once I could go to a doctor without filling out something on a clipboard."
                            },
                            {
                                "Character": "LEO",
                                "Line": "All right, what else?"
                            },
                            {
                                "Character": "TOBY",
                                "Line": "Philip Sluman, who's the chairman of the Petroleum Producers of America, testified yesterday to the FTC that \"the Bartlet administration's\" - blah, blah - \"relentless pursuit of emissions standards in the form of additives like MTBE is a big reason we've seen price hikes in some of the country.\""
                            },
                            {
                                "Character": "LEO",
                                "Line": "The Energy Secretary's gotta respond."
                            },
                            {
                                "Character": "TOBY",
                                "Line": "The Energy Secretary's gonnaa respond and I'd like to mention that to the Vice President."
                            },
                            {
                                "Character": "LEO",
                                "Line": "You want me to do it?"
                            },
                            {
                                "Character": "TOBY",
                                "Line": "I got it."
                            },
                            {
                                "Character": "LEO",
                                "Line": "He's gonna be pretty unhappy."
                            },
                            {
                                "Character": "TOBY",
                                "Line": "Yep."
                            },
                            {
                                "Character": "LEO",
                                "Line": "Anything else?"
                            },
                            {
                                "Character": "TOBY",
                                "Line": "No..."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Nope."
                            },
                            {
                                "Character": "JOSH",
                                "Line": "No sir, thank you. They all exit."
                            }
                        ]
                    },
                    {
                        "Scene Heading": "CUT TO: INT. C.J.'S OFFICE - PRESENT",
                        "Description": "C.J. continues typing.",
                        "Dialogues": [
                            {
                                "Character": "C.J.",
                                "Line": "So there it was, the Family Wellness Act, an omnibus health bill aimed at diseases that disproportionately affect children. This was a good day, cause something got done. The problem is, we only thought it was done. Dad, this would be a good time to mention that it's possible that an Egyptian cat goddess named Baste has put an ancient curse on me.",
                                "Descriptor": "VO"
                            }
                        ]
                    },
                    {
                        "Scene Heading": "CUT TO: INT. HALLWAY - DAY",
                        "Description": "C.J. walks through a hallway. Charlie catches up with her. They walk to C.J.'S OFFICE.",
                        "Dialogues": [
                            {
                                "Character": "CHARLIE",
                                "Line": "C.J.!"
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Charlie."
                            },
                            {
                                "Character": "CHARLIE",
                                "Line": "Listen..."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "May I call you Chip?"
                            },
                            {
                                "Character": "CHARLIE",
                                "Line": "No..."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Chipper?"
                            },
                            {
                                "Character": "CHARLIE",
                                "Line": "No..."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Gilligan?"
                            },
                            {
                                "Character": "CHARLIE",
                                "Line": "Listen..."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Yes?"
                            },
                            {
                                "Character": "CHARLIE",
                                "Line": "Hassan Ali's coming here at the end of the week."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "He's got 38 wives."
                            },
                            {
                                "Character": "CHARLIE",
                                "Line": "Yeah."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Imagine being the girl he dated who he didn't marry."
                            },
                            {
                                "Character": "CHARLIE",
                                "Line": "C.J.?"
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Hassan Ali is coming?"
                            },
                            {
                                "Character": "CHARLIE",
                                "Line": "Yeah, and on the President's trip to Cairo, Ali gave him a gift, a ceramic statue."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Okay."
                            },
                            {
                                "Character": "CHARLIE",
                                "Line": "The State Department told the Office of Protocol it is important the gift be displayed when Ali visits."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Display it."
                            },
                            {
                                "Character": "CHARLIE",
                                "Line": "Well, the Office of Protocol wasn't able to find it."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "They should talk to the gift officer."
                            },
                            {
                                "Character": "CHARLIE",
                                "Line": "They did."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "And?"
                            },
                            {
                                "Character": "CHARLIE",
                                "Line": "They say you have it."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "I'm sorry?"
                            },
                            {
                                "Character": "CHARLIE",
                                "Line": "Sherry Halpurn, the gift officer on the trip, says she handed it to you in Cairo."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Did you say a small, ceramic statue?"
                            },
                            {
                                "Character": "CHARLIE",
                                "Line": "Yeah, of a cat."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Okay... [sighs] okay... okay."
                            },
                            {
                                "Character": "CHARLIE",
                                "Line": "C.J.?"
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Yeah?"
                            },
                            {
                                "Character": "CHARLIE",
                                "Line": "You know anything about it?"
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Well, I have to think about it, Charlie. It was a year ago, and it's not like I have instant recall of every ceramic cat statue I've ever been handed in Cairo."
                            },
                            {
                                "Character": "CHARLIE",
                                "Line": "Yeah, should I tell Protocol that...?"
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Tell Protocol I'm searching my recollection."
                            },
                            {
                                "Character": "CHARLIE",
                                "Line": "Protocol's recollection seemed pretty good."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Leave me now."
                            },
                            {
                                "Character": "CHARLIE",
                                "Line": "Sure."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "[spots Toby in the hallway] Toby."
                            },
                            {
                                "Character": "TOBY",
                                "Line": "About to see Hoynes, talk to me later."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Okay, Carol?"
                            },
                            {
                                "Character": "CAROL",
                                "Line": "What do you need?"
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Some information, possibly a disguise, and a fast getaway car. Come inside."
                            }
                        ]
                    },
                    {
                        "Scene Heading": "CUT TO: INT. THE MURAL ROOM - DAY",
                        "Description": "Hoynes is with several senior citizens standing with quilts. They are posing for pictures.",
                        "Dialogues": [
                            {
                                "Character": "HOYNES",
                                "Line": "Tell me something, how did they not anticipate the flooding?"
                            },
                            {
                                "Character": "REPORTER",
                                "Line": "There was an unexpectedly high snowmelt."
                            },
                            {
                                "Character": "HOYNES",
                                "Line": "The snow fell three months ago. Did they not think it was going to melt this year? Hoynes thanks the guests for coming as they exit."
                            },
                            {
                                "Character": "WOMAN",
                                "Line": "The temperatures were unseasonably warms last month."
                            },
                            {
                                "Character": "MAN 1",
                                "Line": "We don't know why."
                            },
                            {
                                "Character": "HOYNES",
                                "Line": "Well it could have been something due to the sun, though, right?"
                            },
                            {
                                "Character": "MAN 2",
                                "Line": "Sir?"
                            },
                            {
                                "Character": "HOYNES",
                                "Line": "We're done. [to man] Yeah?"
                            },
                            {
                                "Character": "MAN 2",
                                "Line": "Could you see Toby Ziegler?"
                            },
                            {
                                "Character": "HOYNES",
                                "Line": "25 million acre-feet of water, Candy, that's eight trillion gallons."
                            },
                            {
                                "Character": "CANDY",
                                "Line": "Yes, sir. [exits with men]"
                            },
                            {
                                "Character": "HOYNES",
                                "Line": "[as Toby enters] Hey, Toby."
                            },
                            {
                                "Character": "TOBY",
                                "Line": "Good morning, Mr. Vice President."
                            },
                            {
                                "Character": "HOYNES",
                                "Line": "The California Aqueduct is twice the length of Pennsylvania. Did you know that?"
                            },
                            {
                                "Character": "TOBY",
                                "Line": "I knew it was pretty big."
                            },
                            {
                                "Character": "HOYNES",
                                "Line": "What do you need?"
                            },
                            {
                                "Character": "TOBY",
                                "Line": "[as both sit] Philip Sluman, testifying yesterday in front of the FTC, charged that it was the White House's pursuit of tighter emissions standards that has caused the rise in prices..."
                            },
                            {
                                "Character": "HOYNES",
                                "Line": "Phil Sluman had a good point."
                            },
                            {
                                "Character": "TOBY",
                                "Line": "Mr. Vice President, I don't want to go round and round with you on Sluman."
                            },
                            {
                                "Character": "HOYNES",
                                "Line": "Okay."
                            },
                            {
                                "Character": "TOBY",
                                "Line": "He had no point."
                            },
                            {
                                "Character": "HOYNES",
                                "Line": "Policy forces them to use expensive additives whose benefits are questionable."
                            },
                            {
                                "Character": "TOBY",
                                "Line": "It's price gouging... Hoynes shrugs his shoulders."
                            },
                            {
                                "Character": "TOBY",
                                "Line": "It costs marginally more to refine the fuel with the additives and the cost is being passed on to the consumer at an outrageous markup."
                            },
                            {
                                "Character": "HOYNES",
                                "Line": "Toby, if a refinery shuts down, if there's a fire, which isn't, like, out of the question when you're dealing with petroleum, production comes to a halt, gas becomes scarce, prices go up, then they come back down."
                            },
                            {
                                "Character": "TOBY",
                                "Line": "Well, it's good to know the companies can make it through the lean times."
                            },
                            {
                                "Character": "HOYNES",
                                "Line": "Yeah."
                            },
                            {
                                "Character": "TOBY",
                                "Line": "Anyway, sir, tomorrow night, Bill Trotter's gonna be delivering a speech to the Detroit Economic Counsel on Energy Efficiency in the 21st century, and we're gonna rewrite the draft to include a fairly strong rebuttal to Phillip Sluman's remarks."
                            },
                            {
                                "Character": "HOYNES",
                                "Line": "[clears throat] Shouldn't have Bill Trotter do it."
                            },
                            {
                                "Character": "TOBY",
                                "Line": "Why?"
                            },
                            {
                                "Character": "HOYNES",
                                "Line": "'Cause his rants against the oil companies have become familiar and the press has stopped writing about them."
                            },
                            {
                                "Character": "TOBY",
                                "Line": "Still..."
                            },
                            {
                                "Character": "HOYNES",
                                "Line": "It's also pretty dicey political terrain for the Energy Secretary."
                            },
                            {
                                "Character": "TOBY",
                                "Line": "Who would you send?"
                            },
                            {
                                "Character": "HOYNES",
                                "Line": "[standing] To punch back? Me."
                            },
                            {
                                "Character": "TOBY",
                                "Line": "Really?"
                            },
                            {
                                "Character": "HOYNES",
                                "Line": "I'm having a press conference tomorrow afternoon to announce an advisory group for the antitrust policy. I'll take questions at the end, I'll open it up for anything, and they will ask me about Sluman and oil."
                            },
                            {
                                "Character": "TOBY",
                                "Line": "Mr. Vice President..."
                            },
                            {
                                "Character": "HOYNES",
                                "Line": "Toby, if you think I'll be too soft on him, stand in the back of the room... if you don't like what I say, call Bill Trotter and say, \"You're on for tomorrow night.\""
                            },
                            {
                                "Character": "TOBY",
                                "Line": "[standing] Would you mind if I prepared some notes for you?"
                            },
                            {
                                "Character": "HOYNES",
                                "Line": "[chuckling lightly] Oh, not at all... Would you mind if I shoved them up your ass?"
                            },
                            {
                                "Character": "TOBY",
                                "Line": "[laughing] No, sir, well, thank you, sir, we appreciate it."
                            },
                            {
                                "Character": "HOYNES",
                                "Line": "I heard you got the Family Wellness Act."
                            },
                            {
                                "Character": "TOBY",
                                "Line": "We scheduled the vote for Friday at noon."
                            },
                            {
                                "Character": "HOYNES",
                                "Line": "Well, I'm sure you'll have the bill by 12:05. The filibuster continues in the background. TOBY: Thank you, Mr. Vice President. [exits]"
                            }
                        ]
                    },
                    {
                        "Scene Heading": "CUT TO: INT. C.J.'S OFFICE - PRESENT",
                        "Description": "",
                        "Dialogues": [
                            {
                                "Character": "C.J.",
                                "Line": "I'll get back to the cat story in a second, cause I have to interrupt to say this: if you ever have a free two hours and are so inclined, try standing up without leaning on anything and talking the whole time. You won't make it. I wouldn't make it. Stackhouse wasn't supposed to last 15 minutes. He's 78 years old. He has a head cold. This bill is going to pass. He has no hope, to say nothing of I can't imagine what the hell it is he's fighting for. Stackhouse wasn't supposed to last 15 minutes.",
                                "Descriptor": "VO"
                            },
                            {
                                "Character": "STACKHOUSE",
                                "Line": "That is how you prepare Virginia Green apple pie. Let's turn now to David Copperfield...",
                                "Descriptor": "on T.V."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "[still typing] Well, somebody forgot to tell Stackhouse, Dad, cause he just went into hour number eight."
                            },
                            {
                                "Character": "STACKHOUSE",
                                "Line": "...1870, began this great work...",
                                "Descriptor": "on T.V."
                            },
                            {
                                "Character": "FADE OUT.",
                                "Line": "* * *"
                            }
                        ]
                    }
                ]
            },
            {
                "Section": "Act Three",
                "Scenes": [
                    {
                        "Scene Heading": "FADE IN: INT. THE WHITE HOUSE - DAY",
                        "Description": "The camera tracks the halls of the West Wing. As it approaches LEO'S OFFICE, we hear Josh.",
                        "Dialogues": [
                            {
                                "Character": "JOSH",
                                "Line": "The message was pretty cryptic... like something you'd slip a the bank teller. And it was unusual to get it directly from a Senator, who'd normally dispatch an aide. Leo agreed, but was in no way concerned. He told me to go ahead, take the meeting, and not to sweat it, and under no circumstances give anything away. During the voiceover, we see Leo and Josh talk. Josh takes the memo from Leo and exits.",
                                "Descriptor": "VO"
                            }
                        ]
                    },
                    {
                        "Scene Heading": "CUT TO: EXT. THE CAPITOL HILL - DAY",
                        "Description": "",
                        "Dialogues": [
                            {
                                "Character": "JOSH",
                                "Line": "So I headed up to the Hill... wearing, by the way, the new shoes you bought me, which I'd never worn before.",
                                "Descriptor": "VO"
                            }
                        ]
                    },
                    {
                        "Scene Heading": "CUT TO: INT. CAPITOL BUILDING HALLWAY - CONTINUOUS",
                        "Description": "Josh slides in from camera left and falls on his butt.",
                        "Dialogues": [
                            {
                                "Character": "JOSH",
                                "Line": "Since Dad's not here to do it, I think it's my job to bore you with history now. The filibuster has been part of parliamentary strategy in this country for over a hundred and fifty years. Now, the reason we weren't sweating Stackshouse is that Stackhouse isn't someone you sweat. He's been around forever, but he has little influence, little power, and few friends. So, Dad would want me to tell you where the word 'filibuster' comes from. It's from the Dutch \"ury geiter,\" which translated literally means \"freebooter.\" But what they meant was, \"buccaneer.\" During the voiceover, we see Josh walk to SENATOR STACKHOUSE'S OFFICE. He removes his coat as the Senator beckons him in.",
                                "Descriptor": "VO"
                            },
                            {
                                "Character": "JOSH",
                                "Line": "Afternoon, Senator."
                            },
                            {
                                "Character": "STACKHOUSE",
                                "Line": "Good afternoon. [coughs]"
                            },
                            {
                                "Character": "JOSH",
                                "Line": "Sounds like a bad cold."
                            },
                            {
                                "Character": "STACKHOUSE",
                                "Line": "It's fine."
                            },
                            {
                                "Character": "JOSH",
                                "Line": "You taking anything?"
                            },
                            {
                                "Character": "STACKHOUSE",
                                "Line": "I don't want to talk about my cold. I want forty seven million dollars to fight autism."
                            },
                            {
                                "Character": "JOSH",
                                "Line": "Sir..."
                            },
                            {
                                "Character": "STACKHOUSE",
                                "Line": "Five \"Centers of Excellence\" in universities around the country to help scientists coordinate their research, three special units for autism epidemeilogy at the CDC, and a centralized facility for gene and brain banking. That's 43 million."
                            },
                            {
                                "Character": "JOSH",
                                "Line": "Senator..."
                            },
                            {
                                "Character": "STACKHOUSE",
                                "Line": "Uh, the other four million is for a federal program to educate doctors in order to reduce the staggeringly high percentage of cases in which autism is misdiagnosed."
                            },
                            {
                                "Character": "JOSH",
                                "Line": "We can't do it."
                            },
                            {
                                "Character": "STACKHOUSE",
                                "Line": "Of course you can. You simply pick up the phone, you call the Conference Chairman, and..."
                            },
                            {
                                "Character": "JOSH",
                                "Line": "The bill started out at two billion. It's six billion now."
                            },
                            {
                                "Character": "STACKHOUSE",
                                "Line": "That's right. So another forty seven million hurts you how?"
                            },
                            {
                                "Character": "JOSH",
                                "Line": "Sir..."
                            },
                            {
                                "Character": "STACKHOUSE",
                                "Line": "It's eight tenths of one percent of a bill aimed at the health issues affecting children, which is roughly the same as the percentage of children affected by autism."
                            },
                            {
                                "Character": "JOSH",
                                "Line": "I don't need to tell you that in these negotiations..."
                            },
                            {
                                "Character": "STACKHOUSE",
                                "Line": "In these negotiations about a bill aimed at health issues affecting children, we've allocated funds for Alzheimer's, glaucoma, and erectile dysfunction."
                            },
                            {
                                "Character": "JOSH",
                                "Line": "Sir..."
                            },
                            {
                                "Character": "STACKHOUSE",
                                "Line": "You know a lot of two year olds afflicted with that horrific condition, hmm?"
                            },
                            {
                                "Character": "JOSH",
                                "Line": "[smiling] There's no doubt that that's a good point, but in order for us to ensure that more important things were in the bill..."
                            },
                            {
                                "Character": "STACKHOUSE",
                                "Line": "So there was a determination made."
                            },
                            {
                                "Character": "JOSH",
                                "Line": "I'm sorry?"
                            },
                            {
                                "Character": "STACKHOUSE",
                                "Line": "A determination was made, in order of priorities."
                            },
                            {
                                "Character": "JOSH",
                                "Line": "Senator, there's going to be a vote. The bill's closed."
                            },
                            {
                                "Character": "STACKHOUSE",
                                "Line": "Open it back up again."
                            },
                            {
                                "Character": "JOSH",
                                "Line": "To do that would mean to postpone the vote, and everyone's breaking for the recess, and..."
                            },
                            {
                                "Character": "STACKHOUSE",
                                "Line": "And you want the story before everyone goes home."
                            },
                            {
                                "Character": "JOSH",
                                "Line": "Yeah."
                            },
                            {
                                "Character": "STACKHOUSE",
                                "Line": "Okay. [gets up and walks to the door]"
                            },
                            {
                                "Character": "JOSH",
                                "Line": "Sir, the next time around, and there will be a next time around..."
                            },
                            {
                                "Character": "STACKHOUSE",
                                "Line": "That's all. I'm done with you now. He waves his hand dismissively at Josh and walks out."
                            },
                            {
                                "Character": "JOSH",
                                "Line": "And that was that.",
                                "Descriptor": "VO"
                            }
                        ]
                    },
                    {
                        "Scene Heading": "CUT TO: INT. JOSH'S BULLPEN AREA - NIGHT",
                        "Description": "The camera focuses on the three T.V.s on the shelves.",
                        "Dialogues": [
                            {
                                "Character": "NEWSCASTER",
                                "Line": "Also in the news at this hour, parliamentary procedure in all of its glory, as a Senate filibuster watches day turn to night, and possibly back into day again. Seventy eighty year old Minnesota Senator Howard Stackhouse stands alone tonight in the well of the Senate chamber as his colleagues somewhat impatiently wait for a vote that was scheduled to take place more than nine hours ago. Stackhouse, a five term senator who once... During the commentary, we PAN TO Donna watching the coverage."
                            },
                            {
                                "Character": "DONNA",
                                "Line": "Hey, Zach."
                            },
                            {
                                "Character": "ZACH",
                                "Line": "Yeah?"
                            },
                            {
                                "Character": "DONNA",
                                "Line": "You guys record the news feeds coming in, right?"
                            },
                            {
                                "Character": "ZACH",
                                "Line": "Yeah."
                            },
                            {
                                "Character": "DONNA",
                                "Line": "Could I get a dub of the B-roll they're showing on the Stackhouse story? It's three or four seconds, it's a campaign stop, and his grandchildren were with him. The voiceover's talking about his seven grandchildren."
                            },
                            {
                                "Character": "ZACH",
                                "Line": "Sure. What's the problem?"
                            },
                            {
                                "Character": "DONNA",
                                "Line": "It's nothing."
                            },
                            {
                                "Character": "ZACH",
                                "Line": "I'll have it sent up in a few minutes."
                            },
                            {
                                "Character": "DONNA",
                                "Line": "Thanks. Josh enters. He and Donna start a walk and talk to JOSH'S OFFICE."
                            },
                            {
                                "Character": "JOSH",
                                "Line": "Donna."
                            },
                            {
                                "Character": "DONNA",
                                "Line": "You're booked tomorrow morning, 8:55, United, direct to West Palm Beach."
                            },
                            {
                                "Character": "JOSH",
                                "Line": "Which gets in at?"
                            },
                            {
                                "Character": "DONNA",
                                "Line": "12:58."
                            },
                            {
                                "Character": "JOSH",
                                "Line": "It's still a seventy mile drive to Port St. Lucie. I'll miss the game."
                            },
                            {
                                "Character": "DONNA",
                                "Line": "I thought they weren't playing yet."
                            },
                            {
                                "Character": "JOSH",
                                "Line": "It's an exhibition game."
                            },
                            {
                                "Character": "DONNA",
                                "Line": "You're flying to Florida to see the Mets play another team in a game that doesn't count?"
                            },
                            {
                                "Character": "JOSH",
                                "Line": "Actually, it's an intrasquad game."
                            },
                            {
                                "Character": "DONNA",
                                "Line": "So you're flying to Florida to see the Mets play each other in a game that doesn't count."
                            },
                            {
                                "Character": "JOSH",
                                "Line": "Yeah."
                            },
                            {
                                "Character": "DONNA",
                                "Line": "Okay. Uh... there's a Continental flight out of Dulles at seven A.M., you change planes in Newark."
                            },
                            {
                                "Character": "JOSH",
                                "Line": "I gotta fly to New Jersey to get to Palm Beach?"
                            },
                            {
                                "Character": "DONNA",
                                "Line": "Look..."
                            },
                            {
                                "Character": "JOSH",
                                "Line": "Whatever. Just make sure that tomorrow morning..."
                            },
                            {
                                "Character": "DONNA",
                                "Line": "Mike Piazza calls you \"dude.\""
                            },
                            {
                                "Character": "JOSH",
                                "Line": "Yes. Josh starts typing."
                            },
                            {
                                "Character": "DONNA",
                                "Line": "What are you doing?"
                            },
                            {
                                "Character": "JOSH",
                                "Line": "I'm writing an e-mail to my mother."
                            },
                            {
                                "Character": "DONNA",
                                "Line": "Why?"
                            },
                            {
                                "Character": "JOSH",
                                "Line": "To thank her for a pair of shoes she sent me."
                            },
                            {
                                "Character": "DONNA",
                                "Line": "Your mother sent you shoes?"
                            },
                            {
                                "Character": "JOSH",
                                "Line": "Donna, please try and keep it..."
                            },
                            {
                                "Character": "DONNA",
                                "Line": "That is the sweetest thing I..."
                            },
                            {
                                "Character": "JOSH",
                                "Line": "Donna?"
                            },
                            {
                                "Character": "DONNA",
                                "Line": "Okay. Donna exits. Josh turns back to the computer."
                            },
                            {
                                "Character": "JOSH",
                                "Line": "Donna says hi, Mom. Anyway, I didn't think much about the meeting with Stackhouse afterward. There are always going to be people who don't get what they want. I was thinking of other things.",
                                "Descriptor": "VO"
                            }
                        ]
                    },
                    {
                        "Scene Heading": "CUT TO: INT. BRIEFING ROOM - NIGHT",
                        "Description": "Hoynes is having a press conference. Toby is watching from the back of the room.",
                        "Dialogues": [
                            {
                                "Character": "JOSH",
                                "Line": "Like Toby, I was puzzled as to why the Vice President, who made his money from the oil industry, who champions the oil industry, would volunteer to admonish the oil industry.",
                                "Descriptor": "VO"
                            },
                            {
                                "Character": "STEVE",
                                "Line": "Sir, I'm sure you're aware that Phillip Sluman testified before the FTC that the Bartlet administration's relentless pursuit of stricter emissions standards in the form of additives is why we're seeing price spikes."
                            },
                            {
                                "Character": "HOYNES",
                                "Line": "Yeah."
                            },
                            {
                                "Character": "STEVE",
                                "Line": "Would you comment on that?"
                            },
                            {
                                "Character": "HOYNES",
                                "Line": "Yeah. Our relentless pursuit of cleaner air standards has resulted in lower asthma rates and the cleanest air in California in 50 years. It costs marginally more to refine fuel with additives, but the costs are being passed on to consumers at an outrageous price."
                            },
                            {
                                "Character": "CHRIS",
                                "Line": "Mr. Vice President."
                            },
                            {
                                "Character": "HOYNES",
                                "Line": "Uh, yeah, Chris."
                            },
                            {
                                "Character": "CHRIS",
                                "Line": "Are you accusing members of the PPA of price gouging?"
                            },
                            {
                                "Character": "HOYNES",
                                "Line": "Well, some of these CEOs are old friends of mine. But, uh, I can tell you they do know how to turn a profit. Now, they'll claim that prices will go back down after production increases..."
                            },
                            {
                                "Character": "JOSH",
                                "Line": "Hoynes just kept hammering away, and I was reminded for a minute how close he came to being elected President.",
                                "Descriptor": "VO"
                            },
                            {
                                "Character": "HOYNES",
                                "Line": "...have created a new bottom line..."
                            },
                            {
                                "Character": "JOSH",
                                "Line": "Toby said it was an impressive display from Hoynes, but couldn't get past the question of why he volunteered to do it.",
                                "Descriptor": "VO"
                            }
                        ]
                    },
                    {
                        "Scene Heading": "CUT TO: INT. JOSH'S OFFICE - NIGHT",
                        "Description": "",
                        "Dialogues": [
                            {
                                "Character": "JOSH",
                                "Line": "And if you're wondering what the President does during a filibuster, I dunno 'cause this is our first. But at the moment, he's in his private dining room having dinner. There's a famous French chef visiting, and every time he comes he cooks for the President.",
                                "Descriptor": "VO"
                            }
                        ]
                    },
                    {
                        "Scene Heading": "CUT TO: INT. LEO'S OFFICE - NIGHT",
                        "Description": "Bartlet walks in.",
                        "Dialogues": [
                            {
                                "Character": "BARTLET",
                                "Line": "Leo."
                            },
                            {
                                "Character": "LEO",
                                "Line": "Good evening, sir."
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "You busy?"
                            },
                            {
                                "Character": "LEO",
                                "Line": "What do you need?"
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "Come have dinner with me."
                            },
                            {
                                "Character": "LEO",
                                "Line": "Why?"
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "Pierre Boileau is cooking tonight. You want to have dinner?"
                            },
                            {
                                "Character": "LEO",
                                "Line": "What's he serving?"
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "That's your answer?"
                            },
                            {
                                "Character": "LEO",
                                "Line": "I'm just asking."
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "Well, I can tell you that the man specializes in a reinterpretation of classic Provancale cuisine. Cassoulet, duck with green olives..."
                            },
                            {
                                "Character": "LEO",
                                "Line": "Yeah..."
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "...saffron chicken..."
                            },
                            {
                                "Character": "LEO",
                                "Line": "I haven't had a good saffron chicken in quite some time."
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "Well, don't you think you deserve one?"
                            },
                            {
                                "Character": "LEO",
                                "Line": "Yes."
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "His specialty is his dessert: Tomate de Saltambique."
                            },
                            {
                                "Character": "LEO",
                                "Line": "That's gonna be a big, seedless beefsteak tomato stweed for three hours in creme de caramel and stuffed with..."
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "Passion fruit, kiwi and hazelnuts, and..."
                            },
                            {
                                "Character": "LEO",
                                "Line": "...served on a pomegranate reduction, yes."
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "Let's go. Leave the cell phone."
                            },
                            {
                                "Character": "LEO",
                                "Line": "I'm taking my phone."
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "We're not leaving the building. People can find you."
                            },
                            {
                                "Character": "LEO",
                                "Line": "Let's go. Bartlet and Leo head outside."
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "What's he on to now?"
                            },
                            {
                                "Character": "LEO",
                                "Line": "He's reading the rules of cards."
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "Oh, brother."
                            },
                            {
                                "Character": "LEO",
                                "Line": "Don't worry about it."
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "Could Howard Stackhouse possibly be a bigger horse's patoot?"
                            },
                            {
                                "Character": "LEO",
                                "Line": "I don't know what part of a horse that is, exactly, but I've always thought he was a decent guy."
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "He's a curmudgeon: a grouchy old crank."
                            },
                            {
                                "Character": "LEO",
                                "Line": "So are we."
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "You are. I am full of mirth."
                            },
                            {
                                "Character": "LEO",
                                "Line": "Okay."
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "He was all over me the first year. He called me, \"Bartlet the Inert.\""
                            },
                            {
                                "Character": "LEO",
                                "Line": "That was pretty funny."
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "I'm a reformer. I'm the most liberal President he's ever served under. His hero, Hubert Humphrey, once, you know..."
                            },
                            {
                                "Character": "LEO",
                                "Line": "Shook your hand."
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "That's right. [silence] I feel bad."
                            },
                            {
                                "Character": "LEO",
                                "Line": "Why?"
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "His wife died a few years ago. I didn't go to the funeral."
                            },
                            {
                                "Character": "LEO",
                                "Line": "Why?"
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "I was kind of busy running for President, Leo."
                            },
                            {
                                "Character": "LEO",
                                "Line": "That's right."
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "Tomate de Saltambique, my friend."
                            },
                            {
                                "Character": "LEO",
                                "Line": "Yes, indeed. They reach the DINING ROOM, which is lit by candlelight."
                            },
                            {
                                "Character": "BUTLER",
                                "Line": "Good evening."
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "Hi. Hang on. [to Leo] They thought I was going to be eating with Abbey, so..."
                            },
                            {
                                "Character": "LEO",
                                "Line": "Hmm..."
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "We'll just, you know, pretend there's no candlelight."
                            },
                            {
                                "Character": "LEO",
                                "Line": "And that we're not paranoid homophobes in any way."
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "Yeah. Leo's cell phone rings."
                            },
                            {
                                "Character": "LEO",
                                "Line": "Yeah."
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "Leo, you have a deputy who's, frankly, a lot smarter than you are. Whatever it is, let him handle it. Who are you talking to?"
                            },
                            {
                                "Character": "LEO",
                                "Line": "My deputy. [into phone] Yeah."
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "What did he say?"
                            },
                            {
                                "Character": "LEO",
                                "Line": "He says there's no end in sight."
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "Okay. Let's eat."
                            },
                            {
                                "Character": "FADE OUT.",
                                "Line": "* **"
                            }
                        ]
                    }
                ]
            },
            {
                "Section": "Act Four",
                "Scenes": [
                    {
                        "Scene Heading": "FADE IN: INT. JOSH'S BULLPEN AREA - NIGHT",
                        "Description": "",
                        "Dialogues": [
                            {
                                "Character": "STACKHOUSE",
                                "Line": "To get cash for your chips you have to go to the cashier's cage of the casino...",
                                "Descriptor": "V.O."
                            },
                            {
                                "Character": "DONNA",
                                "Line": "C.J.?"
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Yeah."
                            },
                            {
                                "Character": "DONNA",
                                "Line": "Listen, I was looking at the B-roll they're showing on the Stackhouse story and there's something that struck me as odd."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "What?"
                            },
                            {
                                "Character": "DONNA",
                                "Line": "They show two different events during his last campaign and his grandchildren are next to him on stage. He's got seven of them."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "What's the problem?"
                            },
                            {
                                "Character": "DONNA",
                                "Line": "There are only six in the shot. I don't think this is what we think it is. I don't think he's just being ornery. I think he's got a grandson who's autistic."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Oh, holy hell. Tell Josh. Find out for sure."
                            },
                            {
                                "Character": "DONNA",
                                "Line": "Yeah."
                            }
                        ]
                    },
                    {
                        "Scene Heading": "CUT TO: INT. THE PRESIDENT'S DINING ROOM - NIGHT",
                        "Description": "Bartlet and Leo are having dinner. The steward is with them, while Leo talks on the phone.",
                        "Dialogues": [
                            {
                                "Character": "STEWARD",
                                "Line": "More brandy, sir?"
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "Nah, I'm fine."
                            },
                            {
                                "Character": "STEWARD",
                                "Line": "I hope the First Lady's not feeling ill this evening."
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "No, she's up at the Manchester house."
                            },
                            {
                                "Character": "STEWARD",
                                "Line": "Very good, sir."
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "No, it really sucks, but thanks."
                            },
                            {
                                "Character": "STEWARD",
                                "Line": "Yes sir. [walks off]"
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "Did you hear that? He said, \"Very good, sir\". Where do they learn that?"
                            },
                            {
                                "Character": "LEO",
                                "Line": "Yeah. [to Bartlet] I'm sorry?"
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "Nothing."
                            },
                            {
                                "Character": "LEO",
                                "Line": "[into phone] I'm sure that was moved for a reason. We're prepping for a G-8 with Barney and we're going to Tel Aviv."
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "I just feel like we don't talk anymore."
                            },
                            {
                                "Character": "LEO",
                                "Line": "[into phone] Tel Aviv's the week after. [to Bartlet] What?"
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "See you're not even listing."
                            },
                            {
                                "Character": "LEO",
                                "Line": "[into phone] Ben, let me call you back. What's your problem?"
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "I'm just saying we work all day, and then the day's over, and we go out to dinner and you're still working, and you know, I'm sitting here. No time to talk."
                            },
                            {
                                "Character": "LEO",
                                "Line": "You know, conversations like this, are the reason I got divorced."
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "No, it's not. (clears his throat)"
                            },
                            {
                                "Character": "LEO",
                                "Line": "(whispering) Sir... what's wrong?"
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "I made... The steward enters."
                            },
                            {
                                "Character": "LEO",
                                "Line": "Uh... I'm fine, Billy. The steward turns and exits."
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "I made a deal with Abbey... 'cause of my thing."
                            },
                            {
                                "Character": "LEO",
                                "Line": "One term?"
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "[nods] My thing, by the way, is the reason Hoynes stepped up on oil."
                            },
                            {
                                "Character": "LEO",
                                "Line": "'Cause he thinks maybe..."
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "Yeah."
                            },
                            {
                                "Character": "LEO",
                                "Line": "It was three years ago. She can't expect... His cell phone rings."
                            },
                            {
                                "Character": "LEO",
                                "Line": "[into phone] Yeah. Yeah. [to Bartlet] It's C.J. Stackhouse has an autistic grandson."
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "(sighs) Let's go."
                            },
                            {
                                "Character": "LEO",
                                "Line": "[into phone] C.J., we're coming up."
                            }
                        ]
                    },
                    {
                        "Scene Heading": "CUT TO: INT. OUTER OVAL OFFICE - NIGHT",
                        "Description": "C.J. and Donna enter.",
                        "Dialogues": [
                            {
                                "Character": "C.J.",
                                "Line": "Charlie?"
                            },
                            {
                                "Character": "CHARLIE",
                                "Line": "He's just coming over."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Thanks. Can we wait?"
                            },
                            {
                                "Character": "CHARLIE",
                                "Line": "Yeah. Look, C.J., one of us is going to have to tell the President the statue's broken."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "It's not broken."
                            },
                            {
                                "Character": "CHARLIE",
                                "Line": "It is broken."
                            },
                            {
                                "Character": "DONNA",
                                "Line": "She Crazy Glued it back together."
                            },
                            {
                                "Character": "CHARLIE",
                                "Line": "You Crazy Glued it?"
                            },
                            {
                                "Character": "C.J.",
                                "Line": "I didn't know what it was. I needed a potpourri holder. I have the ancient curse of Bast on me so get off my back, Sparky."
                            },
                            {
                                "Character": "CHARLIE",
                                "Line": "Okay, but when you tell him I'd leave out the Crazy Glue."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "And the potpourri, right?"
                            },
                            {
                                "Character": "CHARLIE",
                                "Line": "Yeah. Here we go."
                            }
                        ]
                    },
                    {
                        "Scene Heading": "CUT TO: INT. WHITE HOUSE PORTICO - CONTINUOUS",
                        "Description": "",
                        "Dialogues": [
                            {
                                "Character": "BARTLET",
                                "Line": "How does he not just tell me?"
                            },
                            {
                                "Character": "LEO",
                                "Line": "Sir... Bartlet and Leo enter THE OVAL OFFICE."
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "How does he not come to me and say \"Jed, this is my grandson and there are lots more like him and there are lots more to come. Can you help us out?\""
                            },
                            {
                                "Character": "LEO",
                                "Line": "Because he..."
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "Damn it. He knows we would have gotten it done. Why doesn't he tell me?"
                            },
                            {
                                "Character": "LEO",
                                "Line": "Because he doesn't want to make political hay out of his grandson, which is commendable."
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "Nah, he's a crank."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Good evening, Mr. President."
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "Hey. Hey Donna, you need something?"
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Donna's the one who started sniffing around it."
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "C.J., that phone message was for real. He's not going to stop till he drops."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "He might."
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "C.J., let me tell you something. Don't ever, ever underestimate the will of a grandfather. We're mad men. We don't give a damn. We got here before you and they'll be here after. We'll make enemies, we'll break laws, we'll break bones but you will not mess with the grandchildren."
                            },
                            {
                                "Character": "LEO",
                                "Line": "There was quite a bit of sugar in the cr'me de caramel."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Yeah."
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "C.J.... If I told you to screw the print deadline what would you want to do right now?"
                            },
                            {
                                "Character": "C.J.",
                                "Line": "I'd want to see if there's a way I could help him out."
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "Give him some dignity right? And give him a rest. The guy's going to collapse out there."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Yes, sir."
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "Screw the print deadline. Leo?"
                            },
                            {
                                "Character": "LEO",
                                "Line": "Look..."
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "We will talk about the other thing later."
                            },
                            {
                                "Character": "LEO",
                                "Line": "I'm just asking how we're going to do this."
                            },
                            {
                                "Character": "DONNA",
                                "Line": "Excuse me?"
                            },
                            {
                                "Character": "LEO",
                                "Line": "The Chairman's going to gavel him off if he stops talking or sits. Donna, holds up her hand, like in school."
                            },
                            {
                                "Character": "DONNA",
                                "Line": "Excuse me?"
                            },
                            {
                                "Character": "LEO",
                                "Line": "(amazed) What are you doing?"
                            },
                            {
                                "Character": "DONNA",
                                "Line": "I didn't know if I'm supposed to..."
                            },
                            {
                                "Character": "LEO",
                                "Line": "We usually don't raise our hands."
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "Though it's not the worst idea in the world."
                            },
                            {
                                "Character": "DONNA",
                                "Line": "The Senator's allowed to yield for a question without yielding the floor."
                            },
                            {
                                "Character": "LEO",
                                "Line": "What do you mean?"
                            },
                            {
                                "Character": "DONNA",
                                "Line": "He's allowed to yield for a question without yielding the floor. C.J. and Leo turn to Bartlet."
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "I was in the House. I know nothing about Senate rules."
                            },
                            {
                                "Character": "DONNA",
                                "Line": "Yes sir, but Josh does, and he likes to explain things, and, well, I let him."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "I'm pretty sure it's true, sir."
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "What time is it? Let's wake up a parliamentarian."
                            },
                            {
                                "Character": "LEO",
                                "Line": "Yeah, but the problem is the only people who ask questions are Senators."
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "We're going to get one of them to walk in there. Charlie!"
                            },
                            {
                                "Character": "LEO",
                                "Line": "The Senate wants to go home. They want a vote."
                            },
                            {
                                "Character": "CHARLIE",
                                "Line": "Yes, sir?"
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "I want to call Senators. We'll start with our friends. When we're done with those two, we'll go on to the other 98."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Charlie!"
                            },
                            {
                                "Character": "CHARLIE",
                                "Line": "Yes, ma'am."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Start with the grandfathers."
                            },
                            {
                                "Character": "CHARLIE",
                                "Line": "Yes, ma'am."
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "There's no damn holiday for us either."
                            },
                            {
                                "Character": "LEO",
                                "Line": "We'll be in the dining room."
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "C.J., no kidding, make this happen."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Yes, sir. (quietly) Oh and, I broke you're statue."
                            },
                            {
                                "Character": "DONNA",
                                "Line": "I don't think he heard you."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "No."
                            }
                        ]
                    },
                    {
                        "Scene Heading": "CUT TO: INT. HALLWAY - NIGHT",
                        "Description": "Hoynes and his staff walking through the hall.",
                        "Dialogues": [
                            {
                                "Character": "STAFFER",
                                "Line": "The water peaked at 3 690 feet last month because of an uncontrolled release from Lake Powell."
                            },
                            {
                                "Character": "HOYNES",
                                "Line": "You mean the uncontrolled release of Lake Powell."
                            },
                            {
                                "Character": "STAFFER",
                                "Line": "I suppose."
                            },
                            {
                                "Character": "HOYNES",
                                "Line": "I am going home."
                            },
                            {
                                "Character": "STAFFER",
                                "Line": "Good night, sir."
                            },
                            {
                                "Character": "HOYNES",
                                "Line": "Good night."
                            },
                            {
                                "Character": "TOBY",
                                "Line": "[walks up] Mr. Vice President?"
                            },
                            {
                                "Character": "HOYNES",
                                "Line": "Didn't I do it right?"
                            },
                            {
                                "Character": "TOBY",
                                "Line": "No, sir, you did it very well. I appreciate it."
                            },
                            {
                                "Character": "HOYNES",
                                "Line": "Yeah."
                            },
                            {
                                "Character": "TOBY",
                                "Line": "I'm sure you know I was curious about why you'd volunteer for something like that."
                            },
                            {
                                "Character": "HOYNES",
                                "Line": "Yeah."
                            },
                            {
                                "Character": "TOBY",
                                "Line": "So I got a hold of some private polling you've had done."
                            },
                            {
                                "Character": "HOYNES",
                                "Line": "Oh. Yeah?"
                            },
                            {
                                "Character": "TOBY",
                                "Line": "A significant number of people are concerned over your close ties to big oil."
                            },
                            {
                                "Character": "HOYNES",
                                "Line": "Well, not anymore."
                            },
                            {
                                "Character": "TOBY",
                                "Line": "Yeah, but what I was wondering was why did you put the poll in the field at all? Mr. Vice President, what do you know that I don't?"
                            },
                            {
                                "Character": "HOYNES",
                                "Line": "Toby, the total tonnage of what I know that you don't could stun a team of oxen in its tracks. Good night. Hoynes steps into his car, and leaves Toby standing."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "And then came the big moment, Dad. Everyone...",
                                "Descriptor": "V.O."
                            }
                        ]
                    },
                    {
                        "Scene Heading": "CUT TO: INT. THE WHITE HOUSE - NIGHT",
                        "Description": "The staff throughout the building are frantically calling Senators.",
                        "Dialogues": [
                            {
                                "Character": "JOSH",
                                "Line": "Everyone was enlisted. You called everyone you had a relationship with..."
                            },
                            {
                                "Character": "SAM",
                                "Line": "...with and if you didn't get anywhere, they got a call from the President."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Do I have your word on that, Sarah?"
                            },
                            {
                                "Character": "JOSH",
                                "Line": "We'd been at it 20 minutes and we were coming up with..."
                            },
                            {
                                "Character": "SAM",
                                "Line": "...nothing, until..."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Got it!"
                            },
                            {
                                "Character": "SAM",
                                "Line": "Senator Tom Grissom of Washington State was headed from his office..."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "...to the Chamber and everybody started flooding into the Communications Bullpen to see what would happen, the problem being of course..."
                            },
                            {
                                "Character": "SAM",
                                "Line": "...Stackhouse would have to know as much about rules and procedures as Donna had and not think we were trying to screw him."
                            },
                            {
                                "Character": "JOSH",
                                "Line": "We stared at 14 different television sets while calculating in our heads the time it would take Grissom to walk from his office..."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "...to the floor and we were in frozen silence while we listened to the rules of blackjack."
                            },
                            {
                                "Character": "STACKHOUSE",
                                "Line": "...unless you are counting cards."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "And then it happened."
                            },
                            {
                                "Character": "TOM GRISSOM",
                                "Line": "Point of order, Mr. Chairman."
                            },
                            {
                                "Character": "CHAIRMAN",
                                "Line": "Mr. Grissom?"
                            },
                            {
                                "Character": "GRISSOM",
                                "Line": "Will the Senator yield for a question?"
                            },
                            {
                                "Character": "SAM",
                                "Line": "Come on."
                            },
                            {
                                "Character": "CHAIRMAN",
                                "Line": "Mr. Stackhouse?"
                            },
                            {
                                "Character": "JOSH",
                                "Line": "Come on."
                            },
                            {
                                "Character": "BARTLET",
                                "Line": "Trust me just this once, you grouchy old son of a bitch."
                            },
                            {
                                "Character": "STACKHOUSE",
                                "Line": "Mr. Chairman, I yield to the Senator from Washington for a question."
                            },
                            {
                                "Character": "GRISSOM",
                                "Line": "My question is in 22 parts and might take quite a while. Perhaps you'd like to sit and have some water while I ask it. The COMMUNICATIONS OFFICE explodes with cheers."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "And that was it. Grissom gave him a rest and an opportunity to answer some real questions about autism, and when Grissom was done, McNamara took over, and after McNamara came Gianelli, grandfathers all. I'm going to have to finish this up now and go into the press room and explain what happened. There'll be no vote tonight and the Senate will go home..."
                            },
                            {
                                "Character": "JOSH",
                                "Line": "...for the week. And since Stackhouse, with our help, blew the print deadline anyway, there's really no reason..."
                            },
                            {
                                "Character": "SAM",
                                "Line": "...for Josh not to go back to the Conference Chairman and reopen the bill."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "There are so many days here where you can't imagine that anything good will ever happen. You're..."
                            },
                            {
                                "Character": "JOSH",
                                "Line": "You're buried under a black fog of partisanship and self promotion and..."
                            },
                            {
                                "Character": "SAM",
                                "Line": "...stupidity and a brand of politics that's just plain mean..."
                            },
                            {
                                "Character": "C.J.",
                                "Line": "Yes, Hoynes had us nervous with his admonishment of big oil and yes, the President was making us nervous too, but that's for tomorrow 'cause tonight I've seen a man with no legs stay standing Dad, and a guy with no voice keep shouting and if politics brings out the worst in people then maybe people bring out the best 'cause I'm looking at the TV right now and damned if 28 US Senators haven't just walked onto the floor to help. I'll catch the first plane out in the morning and if you wouldn't mind not turning 70 until tomorrow that'd be great. In the meantime, I love you so much. Your daughter, Claudia."
                            }
                        ]
                    },
                    {
                        "Scene Heading": "DISSOLVE TO: END TITLES.",
                        "Description": "",
                        "Dialogues": [
                            {
                                "Character": "FADE TO BLACK.",
                                "Line": "* * *"
                            }
                        ]
                    }
                ]
            }
        ]
    }
}