{
    "title": "Four to Doomsday",
    "air_date": "18 January 1982",
    "num_episodes": 4,
    "episode_titles": [
        "Part One",
        "Part Two",
        "Part Three",
        "Part Four"
    ],
    "episode_duration": 25,
    "writers": [
        "Terence Dudley"
    ],
    "directors": [
        "John Black"
    ],
    "media_format": "Color",
    "dialogue_triumphs": [
        "The Doctor's grin to Persuasion: 'Friendly, I hope?'",
        "'If a frog with a funny hairdo can turn itself into a semblance of a human being…'",
        "Persuasion confiscates the sonic screwdriver but says: 'You may keep the pencil.'"
    ],
    "dialogue_disasters": null,
    "goofs": [
        "Tegan not only speaks the correct one of over 3000 Aboriginal languages, but one over 35,000 years old!",
        "In episode one, as Monarch tries to open the TARDIS, you can spot the head of a production person, crouching behind the equipment.",
        "Monarch seems unconcerned by the fact that Tegan is leaving in the TARDIS, given that he wants to steal it.",
        "In episode four the Doctor and Tegan take the space pack helmets before they realize that Monarch has turned off the life support."
    ],
    "continuity_notes": [
        {
            "name": "The Doctor",
            "type": "Character",
            "description": "Time Lord protagonist, currently in his fifth incarnation.",
            "origin": "Gallifrey",
            "current_status": "Exploring space and time, short-sighted in his right eye, carries various items including a magnifying glass, notebook, and string."
        },
        {
            "name": "TARDIS",
            "type": "Object",
            "description": "The Doctor's time and space machine, powered by artron energy.",
            "origin": "Gallifrey",
            "current_status": "Functioning, with various rooms and equipment including spacepacks and an airlock."
        },
        {
            "name": "Tegan",
            "type": "Character",
            "description": "Human companion of the Doctor, an accomplished artist.",
            "origin": "Earth",
            "current_status": "Traveling with the Doctor, missed her flight AA778."
        },
        {
            "name": "Nyssa",
            "type": "Character",
            "description": "Companion of the Doctor, skilled in bioengineering and cybernetics.",
            "origin": "Traken",
            "current_status": "Traveling with the Doctor."
        },
        {
            "name": "Adric",
            "type": "Character",
            "description": "Young companion of the Doctor, mathematically gifted but gullible and sometimes spiteful.",
            "origin": "E-Space",
            "current_status": "Traveling with the Doctor, having a difficult day."
        },
        {
            "name": "Monarch",
            "type": "Character",
            "description": "Ruler of the Urbankans, seeking to achieve faster-than-light travel.",
            "origin": "Urbankan homeworld",
            "current_status": "Leading his people on a mission to Earth, stored on computer chips."
        }
    ],
    "technobabble": [
        "'These will eliminate the need for telemicrographics.'",
        "All the stuff with the cricket ball in space is accurate."
    ],
    "roots": [
        "Allusion to Matthew 26:11",
        "Enlightenment's description of love as 'the exchange of two fantasies' is a quote from Renoir's La Règle du Jeu",
        "Von Daniken",
        "Moonraker"
    ],
    "links": [
        "Nyssa's comment about increasing density and reducing matter is probably a reference to the Master's tissue compression eliminator."
    ],
    "locations": [
        {
            "name": "Urbankan Spaceship",
            "type": "Location",
            "description": "A massive vessel carrying the Urbankan population towards Earth",
            "origin": "Built by Urbankans",
            "current_status": "Four days out from Earth, at 4.15pm on 28 February 1981"
        }
    ],
    "future_history": null,
    "untold_adventures": [
        "The Doctor was a friend of Francis Drake",
        "The Doctor was at Heathrow when they were rebuilding Terminal 3",
        "The Doctor once took five wickets for New South Wales"
    ],
    "qv": [
        "Language, 'The Masque of Mandragora'",
        "The Origins of the Time Lords, 'The Deadly Assassin'"
    ],
    "additional_notes": "The story features unique concepts and intellectual interests without alienating the audience with excessive technobabble.",
    "bottom_line": "A neglected gem, but a real oddity. The story uses big concepts and intellectual interest to move the plot along, with charm and clarity of ideas. All the regulars are well-characterised, and Peter Davison and Stratford Johns shine through."
}