{
    "title": "Frontios",
    "air_date": "26 January 1984",
    "num_episodes": 4,
    "episode_titles": [
        "Part One",
        "Part Two",
        "Part Three",
        "Part Four"
    ],
    "episode_duration": 25,
    "writers": [
        "Christopher H. Bidmead"
    ],
    "directors": [
        "Ron Jones"
    ],
    "media_format": "Color",
    "dialogue_triumphs": [
        "The Doctor on the TARDIS: 'As an invasion weapon you'd have to agree it's about as offensive as a chicken vol-au-vent!'",
        "The Doctor convinces the Gravis that Tegan is an android: 'I got this one cheap because the walk's not quite right… And then there's the accent…'"
    ],
    "dialogue_disasters": null,
    "goofs": [
        "In the opening scene, as Captain Revere sees the earth moving beneath him, the fingers of one of the technical crew are visible giving it a helping hand.",
        "When the TARDIS explodes, what happens to Kamelion?",
        "When Tegan traps Brazen in the medical unit, she puts a bar across the middle of a door handle. By the next scene it has moved to the top of the handle.",
        "Why did the designer decide to give the Gravis a nose?"
    ],
    "continuity_notes": [
        {
            "name": "Turlough",
            "type": "Character",
            "description": "A companion of the Fifth Doctor who recognizes signs of the Tractators from his home planet.",
            "origin": "Trion",
            "current_status": "Traveling with the Doctor and Tegan"
        },
        {
            "name": "TARDIS",
            "type": "Object",
            "description": "The Doctor's time and space machine, referred to by its full name for the first time in many years.",
            "origin": "Gallifrey",
            "current_status": "Exploded and reassembled during the story"
        },
        {
            "name": "The Doctor",
            "type": "Character",
            "description": "The protagonist, known by reputation to the Gravis.",
            "origin": "Gallifrey",
            "current_status": "Helping the colonists on Frontios"
        },
        {
            "name": "The Gravis",
            "type": "Character",
            "description": "Leader of the Tractators, left on the uninhabited planet Kolkokron by the Doctor.",
            "origin": "Unknown",
            "current_status": "Defeated and isolated on Kolkokron"
        },
        {
            "name": "Tractators",
            "type": "Character",
            "description": "Alien creatures that become harmless burrowing animals without the Gravis's influence.",
            "origin": "Unknown",
            "current_status": "Rendered harmless after separation from the Gravis"
        },
        {
            "name": "TARDIS Hat Stand",
            "type": "Object",
            "description": "A hat stand from the TARDIS, used as a weapon by Turlough and given as a gift to Plantagenet.",
            "origin": "TARDIS",
            "current_status": "Given to Plantagenet"
        }
    ],
    "technobabble": [
        "The Doctor asks Turlough to get a portable mufield activator and some argon discharge globes."
    ],
    "roots": [
        "Forbidden Planet",
        "The Tempest",
        "Them!",
        "Wittgenstein's 'Tractatus'",
        "Star Trek's 'The Devil in the Dark'",
        "Frankenstein",
        "M*A*S*H",
        "Alien (the spilt acid)",
        "Invaders From Mars"
    ],
    "links": [
        "The Ark"
    ],
    "locations": [
        {
            "name": "Frontios",
            "type": "Location",
            "description": "A planet in the Veruna system where one of the last surviving groups of humans have settled.",
            "origin": "Veruna system",
            "current_status": "Human colony for 40 years"
        },
        {
            "name": "Kolkokron",
            "type": "Location",
            "description": "An uninhabited planet where the Doctor leaves the Gravis.",
            "origin": "Unknown",
            "current_status": "Uninhabited, new home of the isolated Gravis"
        }
    ],
    "future_history": "In the Veruna system, one of the last surviving groups of humans have settled after fleeing from Earth due to an imminent catastrophic collision with the sun. The colonists have been on Frontios for 40 years.",
    "untold_adventures": null,
    "qv": null,
    "additional_notes": "Tegan wears a leather mini-skirt, which is noted as cute but impractical for running away from killer earthworms. The Doctor wears half-rimmed spectacles in this story.",
    "bottom_line": "A very good use of the colonists versus hostile aliens plot, and much wit (Range's description of the ship's 'failure proof' technology prompts the Doctor to ask what went wrong: 'It failed,' notes Range)."
}