{
  "metadata": {
    "title": "The Mark of the Rani",
    "series": "Doctor Who",
    "season": "22",
    "episode_number": 3,
    "release_date": "2 - 9 February 1985",
    "writer": "Pip & Jane Baker",
    "director": "Sarah Hellings",
    "producer": "John Nathan-Turner",
    "main_actors": [
      "Colin Baker",
      "Nicola Bryant",
      "Anthony Ainley",
      "Kate O'Mara"
    ],
    "time_reference": "19th century"
  },
  "cast_crew": [
    {
      "cast": {
        "name": "Colin Baker",
        "role": "The Doctor"
      },
      "crew": {
        "name": "Pip & Jane Baker",
        "role": "Writers"
      }
    },
    {
      "cast": {
        "name": "Nicola Bryant",
        "role": "Peri"
      },
      "crew": {
        "name": "Sarah Hellings",
        "role": "Director"
      }
    },
    {
      "cast": {
        "name": "Anthony Ainley",
        "role": "The Master"
      },
      "crew": {
        "name": "John Nathan-Turner",
        "role": "Producer"
      }
    }
  ],
  "home_media": [
    {
      "releases": {
        "media_type": "DVD",
        "date": "4 September 2006",
        "special_features": [
          "Commentary by Colin Baker, Nicola Bryant and Kate O'Mara",
          "Lords and Luddites documentary",
          "Deleted Scenes",
          "Now and Then short film",
          "Playing With Time interview",
          "Blue Peter short film",
          "Saturday Superstore extract",
          "Alternative Soundtrack",
          "Isolated Music Score",
          "Radio Times Listings",
          "Doctor Who Annual 1985"
        ]
      }
    }
  ],
  "story_notes": [
    {
      "notes": [
        "This story had working titles of Too Clever by Far and Enter the Rani.",
        "The music score for this story was provided by composer Jonathan Gibbs. John Lewis was originally hired to compose the score, but he fell ill from AIDS-related complications, which resulted in his death.",
        "The Mark of the Rani was the last story of the original series of Doctor Who to be directed by a woman. The next such occasion was Blink, directed by Hettie MacDonald, in 2007.",
        "The Rani was conceived as a new, ongoing villain, but the character only appeared once more in the series, two years later in the serial Time and the Rani.",
        "Colin Baker did his own stunts in this serial.",
        "The Rani's experimentation with the sleep centres of the human brain came from an article Pip and Jane Baker read in New Scientist.",
        "Nicola Bryant injured her neck while sleeping. As a result, she would have to wear a brace for the remainder of the shoot — except while the cameras were actually rolling — and was in some discomfort.",
        "During the scene where the Doctor makes his face dirty using Fuller's earth, Colin Baker unknowingly smeared dog excrement on his face.",
        "Sarah Hellings chose Blists Hill as the main location as she had made a Blue Peter film there several years earlier."
      ]
    }
  ],
  "worldbuilding": {
    "in_universe_mythology": [
      "The Rani was exiled from Gallifrey because her giant mice ate the Lord President's cat and took a bite out of the President himself according to the Master.",
      "The Rani rules Miasimia Goria, where she controls a race of aliens."
    ],
    "real_world_cultural_references": [
      "The Rani's TARDIS is covered with a work by Turner.",
      "The Doctor quotes Battle of the Baltic by Thomas Campbell, Julius Caesar, Hamlet, and The Spider and the Fly by Mary Howitt.",
      "Peri misquotes Henry IV Part I."
    ],
    "individuals": [
      "The Rani",
      "The Master",
      "George Stephenson"
    ],
    "items": [
      "Tyrannosaurus Rex embryo",
      "Valerian",
      "The Master's Tissue Compression Eliminator",
      "Stattenheim remote control"
    ],
    "locations": [
      "Killingworth",
      "Miasimia Goria",
      "Redfern Dell"
    ]
  },
  "ratings": {
    "ratings_millions": [
      {
        "part": "Part one",
        "viewers": 6.3
      },
      {
        "part": "Part two",
        "viewers": 7.3
      }
    ]
  },
  "continuity": {
    "continuity_notes": [
      "The Master returns in this story, with no explanation given of his escape from what appeared to be a fiery demise at the end of TV: Planet of Fire.",
      "This incarnation of the Rani later appears in PROSE: State of Change, TV: Time and the Rani, Dimensions in Time and AUDIO: The Rani Reaps the Whirlwind."
    ]
  },
  "plot": [
    {
      "plot_summary": "In 19th century England, the Sixth Doctor finds himself facing two competing enemies: his old adversary, the Master, and the Rani, another Time Lord with a sinister plan. The local population is turning violent and unpredictable. With a major meeting of the brains of the Industrial Revolution due to happen in the village soon, the Doctor must work out what exactly is causing all the problems. Only the Doctor can stop the Master and the Rani's evil plans."
    },
    {
      "plot_summary": "The Rani is using the local bathhouse to anaesthetise miners and distil neuro-chemicals from them for use on her planet Miasimia Goria. The Master has teamed up with the Rani to use the finest brains of the Industrial Revolution to speed up Earth's development and then use the planet as a power base. The Doctor has to stop their plans and rescue the affected miners."
    }
  ]
}