{
  "metadata": {
    "title": "The Mysterious Planet",
    "series": "Doctor Who",
    "season": "23",
    "episode_number": 1,
    "release_date": "6 - 27 September 1986",
    "writer": "Robert Holmes",
    "director": "Nicholas Mallett",
    "producer": "John Nathan-Turner",
    "main_actors": [
      "Colin Baker",
      "Nicola Bryant"
    ],
    "time_reference": "At least two million years after the 20th century"
  },
  "cast_crew": [
    {
      "cast": {
        "name": "Colin Baker",
        "role": "The Doctor"
      },
      "crew": {
        "name": "Nicholas Mallett",
        "role": "Director"
      }
    },
    {
      "cast": {
        "name": "Nicola Bryant",
        "role": "Peri"
      },
      "crew": {
        "name": "John Nathan-Turner",
        "role": "Producer"
      }
    },
    {
      "cast": {
        "name": "Michael Jayston",
        "role": "The Valeyard"
      },
      "crew": {
        "name": "Robert Holmes",
        "role": "Writer"
      }
    },
    {
      "cast": {
        "name": "Lynda Bellingham",
        "role": "The Inquisitor"
      },
      "crew": {
        "name": "Dominic Glynn",
        "role": "Incidental Music"
      }
    },
    {
      "cast": {
        "name": "Tony Selby",
        "role": "Glitz"
      },
      "crew": {
        "name": "Mike Kelt",
        "role": "Visual Effects Designer"
      }
    },
    {
      "cast": {
        "name": "Glen Murphy",
        "role": "Dibber"
      },
      "crew": {
        "name": "Paul McGuinness",
        "role": "Drathro Operator"
      }
    }
  ],
  "home_media": [
    {
      "releases": {
        "media_type": "VHS",
        "date": "October 1993",
        "special_features": []
      }
    },
    {
      "releases": {
        "media_type": "DVD",
        "date": "29 September 2008",
        "details": "The Trial of a Time Lord boxset",
        "special_features": [
          "Commentary 1 by Colin Baker, Nicola Bryant, Tony Selby and Adam Blackwood",
          "Commentary 2 (Part One only) by Eric Saward",
          "The Making of The Mysterious Planet - A new documentary featuring members of the cast and crew",
          "Deleted and Extended Scenes",
          "35mm Film Sequence - The full-length version of the opening effects shot",
          "Trails and Continuity - From the original 1986 transmission",
          "Music Videos - Three videos showcasing the title sequence and music from Season 23",
          "Wogan - Terry Wogan interviews Colin Baker and Lynda Bellingham",
          "Blue Peter - A Doctor Who related item from 1986 featuring Janet Ellis and Mike Ellis showing the L1 and Drathro special effects",
          "Points of View - Viewers' response to the program",
          "Production Information",
          "Subtitles"
        ]
      }
    },
    {
      "releases": {
        "media_type": "BLU_RAY",
        "date": "3 October 2019",
        "details": "Season 23 Boxset",
        "special_features": [
          "Audio Commentary 1 featuring Colin Baker, Nicola Bryant and Tony Selby",
          "Audio Commentary 2 (Part 1 only) featuring Eric Saward",
          "Optional 5.1 Surround Sound Mix",
          "Isolated Music Soundtrack",
          "Production Subtitles",
          "The Making of The Mysterious Planet",
          "Behind the Sofa, featuring Colin Baker, Nicola Bryant, Bonnie Langford, Fraser Hines, Matthew Waterhouse & Mark Strickson",
          "The Doctor's Table - Colin Baker, Nicola Bryant, Bonnie Langford and Michael Jayston are reunited over dinner and answer a set of unusual questions",
          "Deleted and Extended Scenes",
          "Studio and Location Footage",
          "35mm Model Footage",
          "Wogan interview with Colin Baker and Lynda Bellingham",
          "Saturday Picture Show",
          "Points of View",
          "Blue Peter segment featuring Janet Ellis and Mike Ellis showing the L1 and Drathro special effects",
          "Trails and Continuity",
          "Music Videos featuring the new theme music and trial theme",
          "HD Photo Gallery",
          "PDF Written Archive",
          "Alternative/Extended Edits based on the director's initial cuts for each episode"
        ]
      }
    }
  ],
  "story_notes": [
    {
      "notes": [
        "Working titles for this story were Wasteland and The Robots of Ravalox.",
        "Despite the change to the 'Doctor Who Theme' arrangement, the title sequence introduced in The Twin Dilemma remained unchanged for the season.",
        "Beginning with this story, Doctor Who returned to its original 25-minute episode format, which it retained for the remainder of the original series.",
        "The filmed insert that begins part one of a special effects sequence involving the TARDIS and the space station would be the last shot-on-film footage made for Doctor Who until the 1996 TV movie.",
        "Colin Baker felt that the money could have spent elsewhere.",
        "Graeme Harper was asked to direct, but was not free.",
        "Beginning with this story, all exteriors would be recorded using Outside Broadcast video, rather than film as had usually been the practice for the previous 22 years.",
        "The use of OB for exteriors would continue for the remainder of the original series, until its end in 1989.",
        "In an interview in Doctor Who Magazine 448, Timelash author Glen McCoy said that he came up with the idea of the Doctor being put on trial.",
        "Joan Sims is said to have disliked her stint on the series.",
        "Colin Baker admitted that the script wasn't the greatest and didn't like the \"junkyard, railyard\" remarks, either.",
        "Roger Brierley was originally supposed to deliver his lines as Drathro while inhabiting the robot costume constructed by the BBC Visual Effects Department. However, he found the outfit claustrophobic and unwieldy, and he soon became adamant that his involvement be limited to providing Drathro's dialogue.",
        "Robert Holmes was in ill-health when he wrote the script.",
        "Eric Saward thought that he could write good dialogue.",
        "Jonathan Powell hated the story."
      ]
    }
  ],
  "worldbuilding": {
    "in_universe_mythology": [
      "The Free worship the Earth god Haldren",
      "The black light converter functions as its totem"
    ],
    "real_world_cultural_references": [
      "Glitz asks the Doctor if he, as a Time Lord, has a ring or a magic lamp to rub",
      "When the Doctor is forbidden to look upon the Immortal, he jokes about the risk of being turned into a pillar of salt",
      "The three sacred books of Marb Station are Moby-Dick by Herman Melville, The Water Babies by Charles Kingsley, and UK Habitats of the Canadian Goose by H.M. Stationery Office"
    ],
    "individuals": [
      "Sabalom Glitz",
      "Drathro"
    ],
    "items": [
      "Black light converter"
    ],
    "locations": [
      "Ravolox",
      "Time Lord space station",
      "Marb Station",
      "Andromeda Galaxy"
    ]
  },
  "ratings": {
    "ratings_millions": [
      {
        "part": "Part one",
        "viewers": 4.9
      },
      {
        "part": "Part two",
        "viewers": 4.9
      },
      {
        "part": "Part three",
        "viewers": 3.9
      },
      {
        "part": "Part four",
        "viewers": 3.7
      }
    ]
  },
  "continuity": {
    "continuity_notes": [
      "The Doctor believes he is still Lord President of Gallifrey, until the Inquisitor informs him that he has since been deposed for leaving the office vacant too long.",
      "The Inquisitor claims the Doctor has already \"been on trial already for offences of this nature\". The Valeyard contends that the High Council were \"too lenient\" with the sentence that resulted from that trial.",
      "Glitz uses the phrase \"Five rounds, rapid ought to do the trick\", which Brigadier Lethbridge-Stewart used when directing UNIT soldiers to shoot Bok."
    ]
  },
  "plot": [
    {
      "plot_summary": "The Doctor is summoned before the High Council of Time Lords to stand trial for the charges of harmful interference to the course of events during his space-time excursions, which have threatened the sanctity of the universe. His prosecuting attorney, a sinister Time Lord known as the Valeyard, begins a crusade against the Doctor's life with the motive of painting him out to be a villainous renegade. The Valeyard's first movement against the Doctor is to review his past interactions on the planet Ravolox, where he and his companion Peri met the morally grey Sabalom Glitz and a tyrannical robot stalking the world's desolated landscape. However, Ravolox holds a terrible truth in the far reaches of its ruins, while the Doctor's trial has its own fair share of startling twists and turns."
    },
    {
      "plot_summary": "The Doctor and Peri arrive on the planet Ravolox, which is virtually identical to Earth. They encounter the morally ambiguous Sabalom Glitz and his associate Dibber, who are plotting to sabotage a powerful robot called Drathro. The Doctor is put on trial by the Time Lords, with the Valeyard prosecuting him. Through the Matrix, the Valeyard shows the Doctor's actions on Ravolox, where he discovers that the planet is in fact a devastated Earth moved across space. Glitz and Dibber try to steal Drathro's technology, while the Doctor attempts to stop Drathro from destroying the entire universe. In the end, the Doctor is able to prevent the catastrophic explosion, but the Valeyard warns that he has more evidence to present against the Doctor."
    }
  ]
}