{
  "metadata": {
    "title": "An Unearthly Child",
    "series": "Doctor Who",
    "season": "1",
    "episode_number": 1,
    "release_date": "23 November 1963",
    "writer": "Anthony Coburn",
    "director": "Waris Hussein",
    "producer": "Verity Lambert",
    "main_actors": [
      "William Hartnell",
      "Carole Ann Ford",
      "William Russell",
      "Jacqueline Hill"
    ],
    "time_reference": "circa 100,000 BC"
  },
  "cast_crew": [
    {
      "cast": {
        "name": "William Hartnell",
        "role": "Dr. Who"
      },
      "crew": {
        "name": "Waris Hussein",
        "role": "Director"
      }
    },
    {
      "cast": {
        "name": "William Russell",
        "role": "Ian Chesterton"
      },
      "crew": {
        "name": "Anthony Coburn",
        "role": "Writer"
      }
    },
    {
      "cast": {
        "name": "Jacqueline Hill",
        "role": "Barbara Wright"
      },
      "crew": {
        "name": "Verity Lambert",
        "role": "Producer"
      }
    },
    {
      "cast": {
        "name": "Carole Ann Ford",
        "role": "Susan Foreman"
      },
      "crew": {
        "name": "Barry Newbery",
        "role": "Designer"
      }
    }
  ],
  "home_media": [
    {
      "releases": {
        "media_type": "VHS",
        "date": "February 1990",
        "special_features": []
      }
    },
    {
      "releases": {
        "media_type": "VHS",
        "date": "September 2000",
        "details": "Remastered edition",
        "special_features": []
      }
    },
    {
      "releases": {
        "media_type": "DVD",
        "date": "30 January 2006",
        "special_features": [
          "Commentaries",
          "Pilot Episode",
          "Theme Music Video",
          "Comedy Sketches",
          "Photo Gallery",
          "Production Subtitles"
        ]
      }
    }
  ],
  "story_notes": [
    {
      "notes": [
        "This is the first Doctor Who episode broadcast on television and in any medium.",
        "The very first words in Doctor Who were \"Goodnight, Miss Wright.\"",
        "This story is also known as 100,000 BC, The Tribe of Gum, The Firemakers and The Cavemen.",
        "At no point is the name \"Tribe of Gum\" uttered on screen.",
        "The working title of The Tribe of Gum originated in earlier drafts of the script where the character of Kal was instead called Gum.",
        "Originally, the premiere storyline was to have been a serial by C. E. Webber that carried the working titles Nothing at the End of the Lane and The Giants, with An Unearthly Child initially scheduled to be the second serial of the first series.",
        "The makers of the show originally considered the idea of having a functioning chameleon circuit but ruled it out on cost grounds, feeling it would have been too expensive to build a new, disguised spaceship for every story.",
        "At one point, they also considered making the TARDIS invisible.",
        "A pilot version of \"An Unearthly Child\" was made and exists in various versions.",
        "Bernard Lodge was the uncredited designer of the original title sequence.",
        "The Doctor smokes a pipe in \"The Cave of Skulls\", but never does so again after he loses both this and his matches on Stone Age Earth when he is attacked and kidnapped by Kal.",
        "It is never explicitly stated on-screen whether the Stone Age episodes of the story are set on Earth or some other planet.",
        "According to the DVD info text, the striped top Susan wears in this and later stories belonged to Carole Ann Ford and was part of an alternate costume she suggested for the character after it was decided to abandon the more adult, futuristic look of the unaired pilot.",
        "Carole Ann Ford's hairstyle as Susan was created by famed stylist Vidal Sassoon.",
        "This story was one of those selected to be shown as part of BSB's Doctor Who Weekend in September 1990.",
        "The story was also repeated on BBC Four on November 21, 2013, to celebrate the show's 50th anniversary, following the premiere of An Adventure in Space and Time, a docudrama starring David Bradley as William Hartnell.",
        "A lizard was accidentally brought on set along with the tropical plants for the forest; Carole Ann Ford took it home and kept it as a pet, but not before keeping it alive by placing it in a sink full of water in her dressing room.",
        "The piece of music that is purported to be John Smith and the Common Men is called \"3 Guitars Mood 2,\" by The Arthur Nelson Group.",
        "Susan claims that she made up the term TARDIS from the initials of Time and Relative Dimension in Space.",
        "When the TARDIS dematerialises for the first time, both Ian and Barbara faint. This effect is unique to this story as Ian and Barbara show no further ill effects in subsequent dematerialisations (at least not of this nature and not caused directly by the TARDIS activating), nor do any future new TARDIS passengers until the 2005 BBC Wales revival.",
        "Due to the original airing being overshadowed by news of the John F. Kennedy assassination the previous day, on Wednesday 27 November, the Programme Review board decided to repeat \"An Unearthly Child\" immediately before \"The Cave of Skulls\".",
        "An Unearthly Child was the first Doctor Who story to be broadcast internationally, appearing on New Zealand's Christchurch regional channel CHTV-3 on 18 September 1964.",
        "The story was repeated on BBC Two on consecutive evenings from Monday 2 to Thursday 5 November 1981 as part of the repeat season The Five Faces of Doctor Who."
      ]
    }
  ],
  "worldbuilding": {
    "in_universe_mythology": [
      "the Doctor's TARDIS",
      "Gallifrey"
    ],
    "real_world_cultural_references": [
      "The French Revolution"
    ],
    "individuals": [
      "Za",
      "Hur",
      "Kal",
      "Horg",
      "Old Mother"
    ],
    "items": [
      "the Doctor's notebook",
      "the Doctor's karakul hat",
      "the Doctor's pipe",
      "Ian's car",
      "Ian's torch",
      "the Doctor's lighting device",
      "the Doctor's Geiger counter"
    ],
    "locations": [
      "Shoreditch, London",
      "76 Totter's Lane",
      "Coal Hill School",
      "the junkyard",
      "the Cave of Skulls",
      "the Forest of Fear",
      "Skaro"
    ]
  },
  "ratings": {
    "ratings_millions": [
      {
        "part": "An Unearthly Child",
        "viewers": 4.4
      },
      {
        "part": "The Cave of Skulls",
        "viewers": 5.9
      },
      {
        "part": "The Forest of Fear",
        "viewers": 6.9
      },
      {
        "part": "The Firemaker",
        "viewers": 6.4
      }
    ]
  },
  "continuity": {
    "continuity_notes": [
      "This story leads directly into TV: The Daleks.",
      "The First Doctor's return to 76 Totter's Lane is depicted in various other stories.",
      "Susan's history book from this story is seen in TV: Remembrance of the Daleks.",
      "The Eighth Doctor briefly visits prehistoric Earth and happens upon his younger self in PROSE: The Eight Doctors.",
      "COMIC: Hunters of the Burning Stone serves as a sequel to this story.",
      "Two quotes from this story appeared in TV: Journey to the Centre of the TARDIS as echoes from the Doctor's past.",
      "The end of this story leads directly into TV: The Daleks."
    ]
  },
  "plot": [
    {
      "plot_summary": "Barbara Wright and Ian Chesterton, two humble teachers during 1963, are surprised by a bright student named Susan Foreman. Confused by the contradictions in Susan's knowledge, Barbara had decided to visit her home, only to learn that the address on record is a junkyard. She and Ian decide to wait at the location until Susan or her grandfather show up. There, they discover a junkyard inhabited by her grandfather, simply known as \"the Doctor\", and he doesn't want them lurking about. When the teachers refuse to leave, they discover that an ordinary police box is actually bigger on the inside. The Doctor decides they know too much about his and Susan's otherworldly origins and takes them on a journey across space and time in his TARDIS, the place he and Susan now call home."
    },
    {
      "plot_summary": "The Doctor, Susan, Ian, and Barbara arrive in a Palaeolithic landscape, where they encounter a tribe of cavemen. Za, the son of the tribe's previous leader, is struggling to make fire, which frustrates him. Hur, a young cavewoman, tries to pacify him but also warns him that if he loses his position as the leader of the tribe he will lose her. The Doctor goes off to investigate the area, but is attacked by a caveman named Kal, who claims the Doctor came from a \"strange tree\" and used \"fire\" from his fingers. Kal takes the unconscious Doctor back to the tribe, where Za decides the Doctor and his companions must be sacrificed to Orb. Ian and Barbara try to help Za, much to the bemusement of Hur, who does not understand the idea of friendship. The Doctor and his companions eventually escape the tribe and return to the TARDIS, but their departure is foiled when they see the tribesmen appear."
    },
    {
      "plot_summary": "The four travelers are returned to the encampment. The Doctor convinces the tribe that Kal killed the tribal elder, and he and Ian lead the tribe in an attack which drives Kal into the forest. Za is again declared leader, but instead of expressing his gratitude by freeing the travelers, he orders them returned to the Cave of Skulls where he will either learn the secret of fire from them or sacrifice them to Orb. In the Cave of Skulls, Ian makes fire for Za, using friction for a spark, hoping this gift will convince the tribe to set them free. Za comes to speak with them and is entranced by the fire. Meanwhile, Kal sneaks back into the camp and attacks Za. Za gains the upper hand and kills Kal, confirming his leadership. With fire at his disposal, Za is now undisputed. However, he still leaves the Doctor and his companions to languish in the cave. Susan's moment of inspiration leads Ian to devise a plan to scare and distract the tribe enough to let them flee. The four travelers manage to make it back inside the TARDIS, just as the tribesmen throw spears at it. The Doctor explains to Ian and Barbara that he cannot take them back to 1963, because he has no idea where or when they will end up next. As they leave the console room, the radiation detector's needle starts to move, passing into the zone marked DANGER and a warning light starts flashing."
    }
  ]
}