{
  "metadata": {
    "title": "Marco Polo",
    "series": "Doctor Who",
    "season": "1",
    "episode_number": 4,
    "release_date": "22 February - 4 April 1964",
    "writer": "John Lucarotti",
    "director": "Waris Hussein, John Crockett",
    "producer": "Verity Lambert",
    "main_actors": [
      "William Hartnell",
      "William Russell",
      "Jacqueline Hill",
      "Carole Ann Ford"
    ],
    "time_reference": "1289"
  },
  "cast_crew": [
    {
      "cast": {
        "name": "William Hartnell",
        "role": "Dr. Who"
      },
      "crew": {
        "name": "John Lucarotti",
        "role": "Writer"
      }
    },
    {
      "cast": {
        "name": "William Russell",
        "role": "Ian Chesterton"
      },
      "crew": {
        "name": "Waris Hussein",
        "role": "Director"
      }
    },
    {
      "cast": {
        "name": "Jacqueline Hill",
        "role": "Barbara Wright"
      },
      "crew": {
        "name": "John Crockett",
        "role": "Director"
      }
    },
    {
      "cast": {
        "name": "Carole Ann Ford",
        "role": "Susan Foreman"
      },
      "crew": {
        "name": "Verity Lambert",
        "role": "Producer"
      }
    }
  ],
  "home_media": [
    {},
    {},
    {}
  ],
  "story_notes": [
    {
      "notes": [
        "This was the first occasion in which a famous person from history appeared on the series.",
        "It also saw the TARDIS act as a plot piece rather than something the travellers must return to once they have finished their adventuring.",
        "Marco Polo showed a mixed-ethnic group rather than a stereotypical collection of one race.",
        "Reference is made to real-world narcotics when Ping-Cho relates a fairytale that features hashish.",
        "Almost uniquely for the 1963 series, this story has a narrator. Mark Eden reads aloud while the map of the travellers' journey is shown.",
        "Marco Polo is perhaps most notable as the earliest and longest Doctor Who story which is completely missing."
      ]
    }
  ],
  "worldbuilding": {
    "in_universe_mythology": [
      "References to in-universe mythology or lore."
    ],
    "real_world_cultural_references": [
      "References to real-world culture, history, or mythology."
    ],
    "individuals": [
      "Marco Polo",
      "Kublai Khan",
      "Tegana"
    ],
    "items": [
      "The TARDIS"
    ],
    "locations": [
      "Cathay",
      "Pamir Plateau",
      "Gobi Desert",
      "Tun-Huang",
      "Cave of Five Hundred Eyes",
      "Great Wall of Cathay",
      "Yellow River",
      "Shang-Tu",
      "Peking"
    ]
  },
  "ratings": {
    "ratings_millions": [
      {
        "part": "The Roof of the World",
        "viewers": 9.4
      },
      {
        "part": "The Singing Sands",
        "viewers": 9.4
      },
      {
        "part": "Five Hundred Eyes",
        "viewers": 9.4
      },
      {
        "part": "The Wall of Lies",
        "viewers": 9.9
      },
      {
        "part": "Rider From Shang-Tu",
        "viewers": 9.4
      },
      {
        "part": "Mighty Kublai Khan",
        "viewers": 8.4
      },
      {
        "part": "Assassin at Peking",
        "viewers": 10.4
      }
    ]
  },
  "continuity": {
    "continuity_notes": [
      "After the Doctor departed, the court of Kublai Khan was visited by Jared Khan, who wished to acquire the TARDIS for the Charrl.",
      "The Fourth Doctor later mentions that he has not been to China in four hundred years.",
      "The Second Doctor mentions to his companions Ben Jackson and Polly Wright that he had once visited China and that Marco Polo was a \"friend.\"",
      "The Doctor, Ian and Barbara later returned to China in 1865 in the company of Vicki Pallister.",
      "Despite the Doctor's claims to the contrary in this story, the Doctor and Susan had previously met Kublai's grandfather Genghis Khan.",
      "The Doctor and Susan had previously visited Peking during the Boxer Rebellion in the late 19th or early 20th century.",
      "In an alternate timeline, Marco Polo discovered another \"magical, flying box\". When the Eleventh Doctor was erased from history, Polo discovered the Pandorica and brought it to the Vatican.",
      "The Doctor later told his companions Steven Taylor and Sara Kingdom and the crew of the time travel test vessel Hank Morgan IV about his encounter with Kublai Khan.",
      "The same circuit that caused this adventure broke when the Sixth Doctor and Peri Brown landed in Kazakhstan in 1963, causing the Doctor to mention spending several months travelling across China."
    ]
  },
  "plot": [
    {
      "plot_summary": "Arriving in Central Asia in 1289, the Doctor and his companions join the caravan of the famous Venetian explorer Marco Polo as it makes its way from the snowy heights of the Pamir Plateau, across the treacherous Gobi Desert and through the heart of imperial Cathay. Having witnessed many incredible sights and survived a variety of dangers, they arrive at the mighty Kublai Khan's Summer Palace in Shang-tu, where the Doctor strikes up an extraordinary friendship with the now-aged ruler. They move on at last to the even more sumptuous Imperial Palace in Peking, where the travellers save the Khan from an assassination attempt by the Mongol warlord Tegana - supposedly on a peace mission - before departing once more in the TARDIS."
    }
  ]
}