{
  "metadata": {
    "title": "Planet of Giants",
    "series": "Doctor Who",
    "season": "2",
    "episode_number": 1,
    "release_date": "31 October - 14 November 1964",
    "writer": "Louis Marks",
    "director": "Mervyn Pinfield, Douglas Camfield",
    "producer": "Verity Lambert",
    "main_actors": [
      "William Hartnell",
      "William Russell",
      "Jacqueline Hill",
      "Carole Ann Ford"
    ],
    "time_reference": "1960s"
  },
  "cast_crew": [
    {
      "cast": {
        "name": "William Hartnell",
        "role": "Dr. Who"
      },
      "crew": {
        "name": "Louis Marks",
        "role": "Writer"
      }
    },
    {
      "cast": {
        "name": "William Russell",
        "role": "Ian Chesterton"
      },
      "crew": {
        "name": "Mervyn Pinfield",
        "role": "Director"
      }
    },
    {
      "cast": {
        "name": "Jacqueline Hill",
        "role": "Barbara Wright"
      },
      "crew": {
        "name": "Douglas Camfield",
        "role": "Director"
      }
    },
    {
      "cast": {
        "name": "Carole Ann Ford",
        "role": "Susan Foreman"
      },
      "crew": {
        "name": "Verity Lambert",
        "role": "Producer"
      }
    }
  ],
  "home_media": [
    {
      "releases": {
        "media_type": "DVD",
        "date": "20 August 2012",
        "special_features": [
          "Commentary",
          "Episodes 3 and 4 Reconstruction",
          "Rediscovering the Urge to Live",
          "Suddenly Susan",
          "The Lambert Tapes",
          "Prop Design Plans",
          "Radio Times Listings",
          "Optional Arabic Mono Audio",
          "Production Information Subtitles",
          "Photo Gallery",
          "Coming Soon Trailer - Vengeance on Varos : Special Edition"
        ]
      }
    }
  ],
  "story_notes": [
    {
      "notes": [
        "All three episodes exist as 16mm telerecordings.",
        "This story had the working titles Miniscule Story and The Miniscules.",
        "Negative film prints of all three episodes were recovered in 1978.",
        "Arabic prints of all three episodes are also held by the BBC.",
        "Richard Martin was the original choice to direct, but was switched over to The Dalek Invasion of Earth instead.",
        "The request to compress this serial into three parts came from Donald Wilson, BBC Head of Serials, who felt the story simply didn't work in four parts.",
        "The third episode was entitled \"Crisis\" and the fourth episode was to be called \"The Urge to Live\".",
        "No full versions of the original two episodes are known to exist.",
        "A reconstruction based on the original scripts directed by Ian Levine was made for the 2012 DVD release of the story, featuring new recordings by Carole Ann Ford, William Russell and other actors impersonating the rest of the cast.",
        "The story was originally developed under the title The Miniscules.",
        "The working title of \"Dangerous Journey\" was \"Death in the Afternoon\".",
        "This is the first time the Doctor manages to return to contemporary Earth since An Unearthly Child, the first story.",
        "No date is given on-screen for the events of Planet of Giants. However, three dates are known to exist, taken from various Doctor Who publications: 1963 (Terrance Dicks' novelisation); 1964 (The UNIT Chronology in Doctor Who Magazine Winter Special: UNIT Exposed); and June 1969 (The Grandfather Infestation), five years ahead of the original transmission, when the UNIT stories were supposedly set.",
        "William Russell was ill during shooting and was rushed to hospital as soon as the cameras stopped rolling.",
        "Forester's ultimate fate after his arrest has never been revealed on television or in any expanded universe media.",
        "Smithers originally had a financial involvement with DN6, but the pesticide's lethality had motivated him to turn his back on Forester.",
        "In situations where it was impossible or impractical to use oversized props, such as the discovery of Farrow's body, a film technique was used whereby the object was magnified via a half-silvered mirror, through which the camera could also capture the actors standing against black drapes.",
        "Hilda Rowse was originally named Emma.",
        "Farrow continually makes a whistling noise every time he makes an 'S' sound with his dialogue. It can be seen on most home media releases, but was removed during restoration for the Season Two box set in an effort to prevent the distracting nature of the whistling noise."
      ]
    }
  ],
  "worldbuilding": {
    "in_universe_mythology": [
      "Zeppelin air raid during World War I"
    ],
    "real_world_cultural_references": [
      "Rachel Carson's Silent Spring",
      "Gulliver's Travels",
      "The Incredible Shrinking Man",
      "Dixon of Dock Green"
    ],
    "individuals": [
      "Whitmore",
      "Forester",
      "Arnold Farrow",
      "Smithers",
      "Hilda Rowse",
      "Bert Rowse"
    ],
    "items": [
      "DN6 (pesticide)"
    ],
    "locations": [
      "House and garden"
    ]
  },
  "ratings": {
    "ratings_millions": [
      {
        "part": "Planet of Giants",
        "viewers": 8.4
      },
      {
        "part": "Dangerous Journey",
        "viewers": 8.4
      },
      {
        "part": "Crisis",
        "viewers": 8.9
      }
    ]
  },
  "continuity": {
    "continuity_notes": [
      "The Doctor refers to having just been in the late 18th century.",
      "An emergency klaxon is heard in the TARDIS in the first episode, \"Planet of Giants\".",
      "The Cloister Bell is first heard in TV: Logopolis.",
      "Ian ponders what kind of planet would produce large insects, and later finds out on Vortis.",
      "PROSE: House of Giants follows on directly from this story, and reveals that it takes place in 1969.",
      "DN6 reappears in PROSE: House of Giants and PROSE: The Grandfather Infestation."
    ]
  },
  "plot": [
    {
      "plot_summary": "The Doctor lands the TARDIS in what he believes to be mid 20th century Earth, but the TARDIS malfunctions and shrinks the Doctor and his companions to an inch tall. They discover a plot by a ruthless businessman, Forester, and his scientist colleague, Smithers, to launch a deadly new insecticide, DN6, that would kill not only harmful insects but also vital ones. The Doctor and his friends try to stop Forester and Smithers, hampered by the fact that Barbara has been infected by the insecticide. They are eventually able to alert the police, leading to the arrest of Forester and Smithers, and the Doctor returns the TARDIS crew to their normal size."
    }
  ]
}