{
  "metadata": {
    "title": "The Sensorites",
    "series": "Doctor Who",
    "season": "1",
    "episode_number": 7,
    "release_date": "20 June - 1 August 1964",
    "writer": "Peter R. Newman",
    "director": "Mervyn Pinfield, Frank Cox",
    "producer": "Verity Lambert",
    "main_actors": [
      "William Hartnell",
      "William Russell",
      "Jacqueline Hill",
      "Carole Ann Ford"
    ],
    "time_reference": "28th century"
  },
  "cast_crew": [
    {
      "cast": {
        "name": "William Hartnell",
        "role": "Dr. Who"
      },
      "crew": {
        "name": "Mervyn Pinfield",
        "role": "Associate Producer"
      }
    },
    {
      "cast": {
        "name": "William Russell",
        "role": "Ian Chesterton"
      },
      "crew": {
        "name": "Daphne Dare",
        "role": "Costumes"
      }
    },
    {
      "cast": {
        "name": "Jacqueline Hill",
        "role": "Barbara Wright"
      },
      "crew": {
        "name": "Frank Cox",
        "role": "Director"
      }
    },
    {
      "cast": {
        "name": "Carole Ann Ford",
        "role": "Susan Foreman"
      },
      "crew": {
        "name": "Raymond P. Cusick",
        "role": "Designer"
      }
    },
    {
      "cast": {
        "name": "Stephen Dartnell",
        "role": "John"
      },
      "crew": {
        "name": "Jill Summers",
        "role": "Make-Up"
      }
    },
    {
      "cast": {
        "name": "Ilona Rodgers",
        "role": "Carol Richmond"
      },
      "crew": {
        "name": "Verity Lambert",
        "role": "Producer"
      }
    },
    {
      "cast": {
        "name": "Lorne Cossette",
        "role": "Maitland"
      },
      "crew": {
        "name": "David Whitaker",
        "role": "Story Editor"
      }
    }
  ],
  "home_media": [
    {
      "releases": {
        "media_type": "DVD",
        "date": "23 January 2012",
        "special_features": [
          "Commentary",
          "Looking for Peter documentary",
          "Vision On featurette",
          "Secret Voices of the Sense-Sphere featurette",
          "Photo Gallery",
          "Production Subtitles",
          "Radio Times Listings",
          "Original Design Drawings"
        ]
      }
    },
    {
      "releases": {
        "media_type": "VHS",
        "date": "November 2002 (UK), October 2003 (US)",
        "special_features": []
      }
    }
  ],
  "story_notes": [
    {
      "notes": [
        "The working title of this story was 'Mind Control'.",
        "This was originally meant to be the finale of the first season, followed by a six-week hiatus. Ultimately, it was changed to a four-week hiatus, moving The Reign of Terror forward.",
        "The third episode, \"Hidden Danger\", had the dubious distinction of being the first episode of Doctor Who delayed because of programming by another BBC department.",
        "Susan's description of her home planet was almost directly quoted by the Tenth Doctor in Gridlock, retroactively applying it to Gallifrey.",
        "Planet of the Ood suggested a kinship between the Ood and the equally telepathic Sensorites."
      ]
    }
  ],
  "worldbuilding": {
    "in_universe_mythology": [
      "Susan's home planet",
      "The Sensorites' planet (Sense Sphere)"
    ],
    "real_world_cultural_references": [
      "Beau Brummell",
      "Plato's Republic"
    ],
    "individuals": [
      "Susan",
      "John",
      "Carol Richmond",
      "Maitland",
      "City Administrator",
      "Elder Sensorite",
      "Second Elder",
      "Chief Warrior",
      "Commander"
    ],
    "items": [
      "Heart resuscitator",
      "Sensorites' communications tool",
      "Disintegrator",
      "Sensorites' sashes"
    ],
    "locations": [
      "Maitland's ship",
      "Sense Sphere",
      "Aqueduct"
    ]
  },
  "ratings": {
    "ratings_millions": [
      {
        "part": "Strangers in Space",
        "viewers": 7.9
      },
      {
        "part": "The Unwilling Warriors",
        "viewers": 6.9
      },
      {
        "part": "Hidden Danger",
        "viewers": 7.4
      },
      {
        "part": "A Race Against Death",
        "viewers": 5.5
      },
      {
        "part": "Kidnap",
        "viewers": 6.9
      },
      {
        "part": "A Desperate Venture",
        "viewers": 6.9
      }
    ]
  },
  "continuity": {
    "continuity_notes": [
      "The Doctor and his companions speak of how a simple trip turned into one big adventure, mentioning their previous adventures to prehistoric times, Marinus, meeting Daleks, Marco Polo, and Aztecs.",
      "The Tenth Doctor quoted Susan's description of her home planet almost word-for-word when describing Gallifrey to Martha Jones in Gridlock.",
      "Planet of the Ood suggested a kinship between the Ood and the equally telepathic Sensorites."
    ]
  },
  "plot": [
    {
      "plot_summary": "The TARDIS travellers find they have landed on a drifting spaceship, and its crew is dead. They discover the crew is under the telepathic control of the Sensorites, the inhabitants of the nearby planet Sense Sphere. The Doctor and his companions travel to the Sense Sphere and seek to cure an illness afflicting Ian and the Sensorites, which they discover has been caused by deliberate poisoning. The political maneuvering of the Sensorite City Administrator poses another threat to the TARDIS crew as he seeks to discredit and implicate them."
    },
    {
      "plot_summary": "In the first episode, 'Strangers in Space', the TARDIS crew find themselves on a drifting spaceship with a dead crew. They revive two of the crew members, Maitland and Carol Richmond, who tell them they are being held captive by the telepathic Sensorites. In the second episode, 'The Unwilling Warriors', the crew attempt to escape the ship but are thwarted by the Sensorites, who have taken control of the ship's systems. Barbara and Susan are locked in a room with a disturbed crew member named John, who is under the Sensorites' influence."
    },
    {
      "plot_summary": "In the third episode, 'Hidden Danger', the Doctor and his companions travel to the Sense Sphere, the homeworld of the Sensorites, to try and resolve the situation. They meet with the Sensorite Elder, who explains that a previous human expedition crashed on the planet, polluting it with a deadly disease. The Doctor promises to investigate the cause of the disease. Meanwhile, the conniving Administrator plots against the humans, aiming to have them destroyed."
    },
    {
      "plot_summary": "In 'A Race Against Death', the fourth episode, the Doctor discovers the 'disease' is actually a poison in the water supply, and he works to create an antidote. The Administrator, however, tries to sabotage the Doctor's efforts. In 'Kidnap', the fifth episode, the Administrator kidnaps Carol and tricks the others into thinking she has left of her own accord. The Doctor and Ian venture into the aqueducts to investigate the source of the poison, where they encounter a group of human survivors from the previous expedition who are also plotting against the Sensorites."
    },
    {
      "plot_summary": "In the final episode, 'A Desperate Venture', the Doctor and Ian are captured by the human survivors, who reveal they are trying to wipe out the Sensorites and harvest their planet. Barbara and another human, John, go to rescue the Doctor and Ian. They are able to stop the humans' plan and expose the Administrator's treachery. The Sensorites agree to let the human crew return to Earth, while the TARDIS crew are free to depart."
    }
  ]
}