{
  "metadata": {
    "title": "The Smugglers",
    "series": "Doctor Who",
    "season": "4",
    "episode_number": 1,
    "release_date": "10 September - 1 October 1966",
    "writer": "Brian Hayles",
    "director": "Julia Smith",
    "producer": "Innes Lloyd",
    "main_actors": [
      "William Hartnell",
      "Michael Craze",
      "Anneke Wills"
    ],
    "time_reference": "17th century"
  },
  "cast_crew": [
    {
      "cast": {
        "name": "William Hartnell",
        "role": "Dr. Who"
      },
      "crew": {
        "name": "Brian Hayles",
        "role": "Writer"
      }
    },
    {
      "cast": {
        "name": "Michael Craze",
        "role": "Ben Jackson"
      },
      "crew": {
        "name": "Julia Smith",
        "role": "Director"
      }
    },
    {
      "cast": {
        "name": "Anneke Wills",
        "role": "Polly"
      },
      "crew": {
        "name": "Innes Lloyd",
        "role": "Producer"
      }
    }
  ],
  "home_media": [
    {},
    {},
    {}
  ],
  "story_notes": [
    {
      "notes": [
        "The Smugglers was the first serial of season 4 of Doctor Who.",
        "It was narratively notable for being Ben and Polly's first journey in the TARDIS and furthers the development of their characters as opposites to each other.",
        "The story also contains an unusual amount of coarse violence, which resulted in the only surviving clips of the serial.",
        "The ABC took exceptions to a few scenes and edited them out — and then preserved those edits rather than broader episodes.",
        "Amateur filmmaker footage exists of some of the location work, giving modern fans a further glimpse into the costuming and make-up of the serial.",
        "All four episodes are missing from the BBC Archives.",
        "Despite the fact that The Smugglers was a ratings failure and is ill-remembered by modern audiences, it was given a boost by the BBC Wales team in 2011, being elevated to the status of a loose sequel to The Curse of the Black Spot."
      ]
    }
  ],
  "worldbuilding": {
    "in_universe_mythology": [
      "Avery",
      "Black Albatross",
      "Davy Jones"
    ],
    "real_world_cultural_references": [
      "Victorian restoration",
      "Sherlock Holmes"
    ],
    "individuals": [
      "Samuel Pike",
      "Cherub",
      "Joseph Longfoot",
      "Josiah Blake",
      "Jacob Kewper",
      "Tom",
      "Squire Edwards",
      "The Spaniard",
      "Jamaica",
      "Gaptooth"
    ],
    "items": [
      "TARDIS key"
    ],
    "locations": [
      "Cornwall",
      "Church crypt",
      "Black Albatross"
    ]
  },
  "ratings": {
    "ratings_millions": [
      {
        "part": "Episode 1",
        "viewers": 4.3
      },
      {
        "part": "Episode 2",
        "viewers": 4.9
      },
      {
        "part": "Episode 3",
        "viewers": 4.2
      },
      {
        "part": "Episode 4",
        "viewers": 4.5
      }
    ]
  },
  "continuity": {
    "continuity_notes": [
      "The end of this story leads straight into the next, The Tenth Planet.",
      "The 2006 short story The Three Paths retcons this, allowing further stories featuring Ben and Polly as companions of the First Doctor to be told prior to the Doctor's regeneration.",
      "The 2017 The Companion Chronicles release The Bonfires of the Vanities has the TARDIS arriving at Antarctica only for the Daleks to attempt to prevent the Doctor's regeneration by having them appear at 1950s Lewes instead, allowing for further adventures for the First Doctor, Ben and Polly.",
      "The Doctor would eventually meet Captain Avery in-person in his eleventh incarnation."
    ]
  },
  "plot": [
    {
      "plot_summary": "The TARDIS arrives on the coast of seventeenth-century Cornwall — much to the astonishment of Polly and Ben. Pirates led by Captain Samuel Pike and his henchman Cherub are searching for a hidden treasure, while a smuggling ring masterminded by the local squire is trying to off-load contraband. The Doctor inadvertently learns, from churchwarden Joseph Longfoot (who is subsequently murdered), a cryptic rhyme that holds the key to the treasure's whereabouts. He is then kidnapped. Although he escapes, the Doctor is eventually forced to tell Pike the rhyme's meaning — it refers to names on tombstones in the church crypt — and the treasure is uncovered. At this point, the militia arrives, summoned by revenue officer Josiah Blake. A fight ensues in which Pike and many of his men are killed and the rest taken prisoner. The Doctor and his companions meanwhile slip back to the TARDIS."
    }
  ]
}