{
  "metadata": {
    "title": "The Space Museum",
    "series": "Doctor Who",
    "season": "2",
    "episode_number": 7,
    "release_date": "24 April - 15 May 1965",
    "writer": "Glyn Jones",
    "director": "Mervyn Pinfield",
    "producer": "Verity Lambert",
    "main_actors": [
      "William Hartnell",
      "William Russell",
      "Jacqueline Hill",
      "Maureen O'Brien"
    ],
    "time_reference": "On the planet Xeros"
  },
  "cast_crew": [
    {
      "cast": {
        "name": "William Hartnell",
        "role": "Dr. Who"
      },
      "crew": {
        "name": "Glyn Jones",
        "role": "Writer"
      }
    },
    {
      "cast": {
        "name": "William Russell",
        "role": "Ian Chesterton"
      },
      "crew": {
        "name": "Mervyn Pinfield",
        "role": "Director"
      }
    },
    {
      "cast": {
        "name": "Jacqueline Hill",
        "role": "Barbara Wright"
      },
      "crew": {
        "name": "Verity Lambert",
        "role": "Producer"
      }
    },
    {
      "cast": {
        "name": "Maureen O'Brien",
        "role": "Vicki"
      },
      "crew": {
        "name": "Peter Sanders",
        "role": "Sita"
      }
    },
    {
      "cast": {
        "name": "Peter Craze",
        "role": "Dako"
      },
      "crew": {
        "name": "Richard Shaw",
        "role": "Lobos"
      }
    },
    {
      "cast": {
        "name": "Jeremy Bulloch",
        "role": "Tor"
      },
      "crew": {
        "name": "Salvin Stewart",
        "role": "Morok Messenger/Morok Guard"
      }
    },
    {
      "cast": {
        "name": "Lawrence Dean",
        "role": "Morok Guard"
      },
      "crew": {
        "name": "Peter Diamond",
        "role": "Morok Technician/Morok Guard"
      }
    },
    {
      "cast": {
        "name": "Ken Norris",
        "role": "Morok Guard"
      },
      "crew": {
        "name": "Ivor Salter",
        "role": "Morok Commander"
      }
    },
    {
      "cast": {
        "name": "Salvin Stewart",
        "role": "Morok Messenger/Morok Guard"
      },
      "crew": {
        "name": "Peter Hawkins",
        "role": "Dalek Voice"
      }
    }
  ],
  "home_media": [
    {
      "releases": {
        "media_type": "DVD",
        "date": "1 March 2010",
        "special_features": [
          "Commentary by William Russell, Maureen O'Brien, and writer Glyn Jones",
          "Defending the Museum - New series Doctor Who writer Robert Shearman provides a personal and robust defense of this often overlooked story",
          "My Grandfather, the Doctor - Jessica Carney talks about the career of her grandfather, William Hartnell",
          "A Holiday For The Doctor - Spoof comedy recreation of 1960s Doctor Who, starring Christopher Green as actress Ida Barr",
          "Radio Times Billings (PDF DVD-ROM - PC/Mac)",
          "Production Information",
          "Subtitles",
          "Photo Gallery",
          "Coming Soon Trailer - Myths and Legends"
        ]
      }
    }
  ],
  "story_notes": [
    {
      "notes": [
        "The working titles of the first and fourth episodes, 'The Space Museum' and 'The Final Phase', were 'The Four Dimensions of Time' and 'Zone Seven' respectively.",
        "William Hartnell does not appear in 'The Search' except in the reprise from the previous episode, 'The Dimensions of Time', as he was on holiday during the week it was recorded.",
        "Of all the William Hartnell stories with individual episode titles, this is the only one for which only one overall story title has ever been used. See also Disputed story titles.",
        "It was during the production of this story that Jacqueline Hill decided that she was leaving the series.",
        "This is the only story Mervyn Pinfield directed entirely by himself.",
        "Glyn Jones was later dismayed by Dennis Spooner's editing of his scripts, which excised much of the humorous content. Spooner felt that such material was inappropriate in what he envisioned as a high-concept science-fiction story.",
        "The first episode, 'The Space Museum', begins with a brief reprise of the final scene of The Crusade. This clip is currently the only surviving 16mm black-and-white film footage from that story's final episode, 'The Warlords'.",
        "Richard Shaw, who spoke with a Cockney accent, was cast as Governor Lobos but was asked to deliver his lines in 'BBC English'. His accent slips only once when he bellows at a Morok underling to use 'maximum securi'ee!'",
        "The incidental music was all from stock recordings rather than being specially composed for the story.",
        "In a nice piece of internal continuity, William Russell starts gently banging his fists together as he leaves the TARDIS interior set and carries this through to the next scene, following a recording break, as he emerges from the police box onto the Xeros surface set; this gives the effect of a continuous piece of action and helps maintain the illusion that the TARDIS interior really is inside the police box shell.",
        "Salvin Stewart (Morok Messenger/Morok Guard) also provided the voice of the armoury computer in 'The Final Phase', for which he remained uncredited both on-screen and in Radio Times.",
        "This was one of the stories selected to be shown as part of BSB's Doctor Who Weekend in September 1990.",
        "Glyn Jones later starred as Krans in The Sontaran Experiment nearly a decade later, making him one of five individuals to have both written for and acted in Doctor Who (the others being Victor Pemberton, Derrick Sherwin, Mark Gatiss, and Toby Whithouse).",
        "The first episode, 'The Space Museum', features a rare use (for the 1960s) of a filmed insert of an interior location, specifically a room in the TARDIS, due to the need to show a special effect — namely Vicki dropping a glass and the glass reassembling itself — that at the time could not be rendered on videotape. The switch from video to film was rendered unnoticeable in the filmed recordings of the serial that were circulated after its UK broadcast and when the story was recovered in the 1980s but is once again quite noticeable following the serial's vidFIRE remastering for DVD release in 2010.",
        "Several of the story's guest cast members are credited on-screen but not in Radio Times, presumably due to lack of space for those particular issues: Bill Starkey (Third Xeron) for the first episode, 'The Space Museum'; Lawrence Dean and Ken Norris (Morok Guards) for all four episodes; and Michael Gordon, Edward Granville, David Wolliscroft and Bill Starkey (Xerons) for 'The Search' and 'The Final Phase'.",
        "The four episodes were produced at the same time that the feature film Dr. Who and the Daleks was in production.",
        "This story was ranked as Doctor Who Magazine readers' least favourite First Doctor story in their 2009 and 2014 polls. In the other two polls, it was voted second-last."
      ]
    }
  ],
  "worldbuilding": {
    "in_universe_mythology": [
      "The Moroks were from Morok",
      "The Moroks used a paralytic called Zaphra gas during the creation of their empire",
      "The museum has a Dalek as an exhibit, with a sign confirming it comes from Skaro"
    ],
    "real_world_cultural_references": [
      "The Doctor claims he was with James Watt when he discovered steam power"
    ],
    "individuals": [
      "Governor Lobos"
    ],
    "items": [
      "Time-Space Visualiser"
    ],
    "locations": [
      "Xeros"
    ]
  },
  "ratings": {
    "ratings_millions": [
      {
        "part": "The Space Museum",
        "viewers": 10.5
      },
      {
        "part": "The Dimensions of Time",
        "viewers": 9.2
      },
      {
        "part": "The Search",
        "viewers": 8.5
      },
      {
        "part": "The Final Phase",
        "viewers": 8.5
      }
    ]
  },
  "continuity": {
    "continuity_notes": [
      "The Doctor fixes the Time-Space Visualiser (TV: The Chase) and uses it again. (AUDIO: The Fourth Wall, The One Doctor)",
      "The Faction Paradox use a similar device to show Fitz his future. (PROSE: The Ancestor Cell)",
      "The TARDIS will jump its own time track again. (PROSE: Festival of Death, Prisoner of the Daleks)",
      "The Eleventh Doctor also thinks at first that this may have occurred again when he, Amy and Rory start switching between two dreams that each seem real, but is proven incorrect. (TV: Amy's Choice)",
      "Mortimus was once an adviser to the Moroks. (PROSE: No Future)",
      "The Doctor would later visit other 'space museums'. (TV: The Seeds of Death, Dalek, The Time of Angels)"
    ]
  },
  "plot": [
    {
      "plot_summary": "The TARDIS jumps a time track and the travellers arrive on the planet Xeros. There they discover their own future selves displayed as exhibits in a museum established as a monument to the galactic conquests of the warlike Morok invaders who now rule the planet. When time shifts back to normal, they realise that they must do everything they can to avert this potential future. Vicki helps the native Xerons obtain arms and revolt against the Moroks. The revolution succeeds and the travellers go on their way, confident that the future has been changed."
    }
  ]
}