{
  "metadata": {
    "title": "The Tenth Planet",
    "series": "Doctor Who",
    "season": "4",
    "episode_number": 2,
    "release_date": "8 October - 29 October 1966",
    "writer": "Kit Pedler, Gerry Davis",
    "director": "Derek Martinus",
    "producer": "Innes Lloyd",
    "main_actors": [
      "William Hartnell",
      "Anneke Wills",
      "Michael Craze"
    ],
    "time_reference": "December 1986"
  },
  "cast_crew": [
    {
      "cast": {
        "name": "William Hartnell",
        "role": "Dr. Who"
      },
      "uncredited_cast": {
        "name": "Patrick Troughton"
      },
      "crew": {
        "name": "Kit Pedler",
        "role": "Writer"
      }
    },
    {
      "cast": {
        "name": "Anneke Wills",
        "role": "Polly"
      },
      "crew": {
        "name": "Gerry Davis",
        "role": "Writer"
      }
    },
    {
      "cast": {
        "name": "Michael Craze",
        "role": "Ben"
      },
      "crew": {
        "name": "Derek Martinus",
        "role": "Director"
      }
    },
    {
      "cast": {
        "name": "Robert Beatty",
        "role": "General Cutler"
      },
      "crew": {
        "name": "Innes Lloyd",
        "role": "Producer"
      }
    }
  ],
  "home_media": [
    {
      "releases": {
        "media_type": "DVD",
        "date": "14 October 2013 (Region 2), 19 November 2013 (Region 1)",
        "special_features": [
          "Commentary",
          "Frozen Out - Cast and crew look back on the making of the story",
          "Episode 4 VHS Reconstruction",
          "William Hartnell Interview from 1966",
          "Doctor Who Stories - Anneke Wills",
          "The Golden Age",
          "Boys! Boys! Boys!",
          "Companion Piece",
          "Blue Peter - Tenth Anniversary retrospective on Doctor Who's history",
          "Production Information",
          "Subtitles",
          "Photo Gallery",
          "Coming Soon Trailer - The Moonbase"
        ]
      }
    }
  ],
  "story_notes": [
    {
      "notes": [
        "The specific design of the Cybermen featured in this story would be seen in many adventures.",
        "Mondas' origins prior to this story are explored in AUDIO: Spare Parts.",
        "The Eighth Doctor later encountered these rudimentary Cyberman variants in Vienna on 11 September 1873.",
        "The Twelfth Doctor and his companions later witnessed the inception of a version of these prototypical Cybermen, which he recognises on sight as a \"Mondasian Cyberman\", on a Mondasian colony ship that had been trapped in the grasp of a black hole.",
        "The Doctor claims his body is \"wearing a bit thin\". This phrase is echoed by his war incarnation before he regenerates.",
        "The Cybermen would later attempt to gain access to time travel, hoping to destroy Earth in 1985, thus preventing the destruction of Mondas. However, their efforts were thwarted by the Sixth Doctor and Peri Brown.",
        "The Doctor would later return to Antarctica in the 1970s during his fourth incarnation and, during his seventh incarnation, in 2006, 2012 and 2045.",
        "The Twelfth Doctor would return to Antarctica at the same time as the First Doctor when he was also on the verge of regenerating.",
        "Twenty years after they helped the Doctor prevent the return of Mondas in their personal timelines, Ben and Polly — who had gone their separate ways in life following their return to Earth on 20 July 1966 — reunited on 31 December 1986, which was by then their present.",
        "In the aftermath of the attempted Cyberman invasion, Professor Allison Williams led the scientific team which examined their ship.",
        "Unbeknownst to the Doctor, his regeneration into his second incarnation was witnessed by his deceased companion Oliver Harper, who was killed by the Vardans on Grace Alone but remained as a ghost in the TARDIS.",
        "Earth would again be threatened by the approach of a planet in or around the 2000s, in that case Gallifrey."
      ]
    }
  ],
  "worldbuilding": {
    "in_universe_mythology": [
      "Mondas, Earth's twin planet",
      "The Cybermen"
    ],
    "real_world_cultural_references": [
      "Carnaby Street"
    ],
    "individuals": [
      "General Cutler",
      "Lieutenant Terry Cutler",
      "Professor Allison Williams",
      "Oliver Harper"
    ],
    "items": [
      "Z-Bomb",
      "Demeter rocket",
      "Retinascope"
    ],
    "locations": [
      "Snowcap space tracking station",
      "Antarctica",
      "Jodrell Bank",
      "Mount Palomar",
      "Woomera cosmodrome",
      "International Space Command HQ in Geneva"
    ]
  },
  "ratings": {
    "ratings_millions": [
      {
        "part": "Episode 1",
        "viewers": 5.5
      },
      {
        "part": "Episode 2",
        "viewers": 6.4
      },
      {
        "part": "Episode 3",
        "viewers": 7.6
      },
      {
        "part": "Episode 4",
        "viewers": 7.5
      }
    ]
  },
  "continuity": {
    "continuity_notes": [
      "This was the final chronological appearance of William Hartnell as the First Doctor and introduced Patrick Troughton as the Second Doctor in the final moments of part four.",
      "The Tenth Planet was a major historical turning point for the Doctor Who series by employing a new concept that would come to be known as regeneration.",
      "William Hartnell returned to reprise the role of the First Doctor one final time in 1972-73's The Three Doctors for the opening of the tenth anniversary season of Doctor Who, but his poor health at the time of recording meant his appearances were reduced to pre-recorded video screen images."
    ]
  },
  "plot": [
    {
      "plot_summary": "The Snowcap space tracking station in Antarctica is monitoring the launch of the manned Zeus IV atmospheric testing probe. The Doctor, Ben and Polly materialise outside the underground bunker and are soon spotted. They are interrogated and put in the observation room. A distress call is received from the Zeus IV space capsule which has been drawn off-course by an unknown force. The Doctor announces he knows the cause - a twin planet to Earth called Mondas has drifted back into the solar system and is draining Earth's energy. The Cybermen, inhabitants of Mondas, invade Snowcap and take control. Ben escapes and helps disable a Z-Bomb that could destroy Mondas. As Mondas burns up, the Cybermen die. The First Doctor collapses from old age and regenerates into the Second Doctor as Ben and Polly watch."
    }
  ]
}