{
  "metadata": {
    "title": "The Ark",
    "series": "Doctor Who",
    "season": "3",
    "episode_number": 23,
    "release_date": "5 - 26 March 1966",
    "writer": "Paul Erickson, Lesley Scott",
    "director": "Michael Imison",
    "producer": "John Wiles",
    "main_actors": [
      "William Hartnell",
      "Peter Purves",
      "Jackie Lane"
    ],
    "time_reference": "57th Segment of Time, circa 10,000,000 AD"
  },
  "cast_crew": [
    {
      "cast": {
        "name": "William Hartnell",
        "role": "Dr. Who"
      },
      "crew": {
        "name": "Michael Imison",
        "role": "Director"
      }
    },
    {
      "cast": {
        "name": "Peter Purves",
        "role": "Steven Taylor"
      },
      "crew": {
        "name": "Paul Erickson",
        "role": "Writer"
      }
    },
    {
      "cast": {
        "name": "Jackie Lane",
        "role": "Dodo Chaplet"
      },
      "crew": {
        "name": "Lesley Scott",
        "role": "Writer"
      }
    },
    {
      "cast": {
        "name": "Eric Elliot",
        "role": "Commander"
      },
      "crew": {
        "name": "John Wiles",
        "role": "Producer"
      }
    },
    {
      "cast": {
        "name": "Inigo Jackson",
        "role": "Zentos"
      },
      "crew": {
        "name": "Michael Sheard",
        "role": "Rhos"
      }
    },
    {
      "cast": {
        "name": "Roy Spencer",
        "role": "Manyak"
      },
      "crew": {
        "name": "Roy Skelton",
        "role": "Monoid Voices"
      }
    }
  ],
  "home_media": [
    {
      "releases": {
        "media_type": "DVD",
        "date": "14 February 2011",
        "special_features": [
          "Commentary by Peter Purves, Michael Imison and Toby Hadoke",
          "All's Wells That Ends Wells - A new documentary exploring the influence of H. G. Wells on Doctor Who",
          "One Hit Wonder - What gives a monster staying power?",
          "Riverside Story - Peter Purves returns to Riverside Studios in Hammersmith, home to numerous 1960s Doctor Who stories",
          "Radio Times Billings (PDF DVD-ROM - PC/Mac)",
          "Production Information",
          "Subtitles",
          "Photo Gallery",
          "Coming Soon Trailer - Mara Tales"
        ]
      }
    },
    {
      "releases": {
        "media_type": "VHS",
        "date": "1998",
        "details": "Editing for the VHS release was completed by the Doctor Who Restoration Team",
        "special_features": []
      }
    }
  ],
  "story_notes": [
    {
      "notes": [
        "This story had the possible working title of The Space Ark.",
        "Although Lesley Scott, Paul Erickson's then wife, was credited as co-writer, she did no work on the scripts.",
        "Erickson later gave his reasons for sharing the on-screen writer's credit with her: \"It was a personal arrangement I had with her, which was my own personal business at the time. The circumstances went into history. I need say no more than that.\"",
        "The Monoids were played by actors, each holding a ping-pong ball in his mouth to represent the alien's single eye. The upper portion of the actor's face was hidden by a \"Beatle\" wig. Their hair was Yak hair.",
        "There are occasional lapses by Jackie Lane into the Lancashire accent in which she rehearsed the story before the production team were instructed by their superiors that it was unacceptable for a regular character in Doctor Who to speak in anything other than \"BBC English\".",
        "This rule was later relaxed, as companion Ben Jackson — introduced only four stories later in The War Machines — was allowed to keep his Cockney accent.",
        "Peter Purves thought the Monoids looked ludicrous and couldn't take them seriously as a monster.",
        "Director Michael Imison not only didn't think much of the story, but also was informed that his contract as a BBC director would not be renewed immediately before recording of the final episode, \"The Bomb\".",
        "Imison wasn't even told of this decision face-to-face, but was simply handed a note before entering the studio gallery at the start of recording.",
        "This is the only Doctor Who story produced by John Wiles for which all episodes exist.",
        "It is also the earliest serial from the third season to exist in its entirety, and one of three alongside The Gunfighters and The War Machines.",
        "It was John Wiles' idea to have a story set on a giant spaceship where cars and bicycles would be required to get around.",
        "Donald Tosh was sceptical that such a story could be done on the show's resources and linked the idea to the works of Arthur C. Clarke.",
        "Donald Tosh knew Paul Erickson from working on Compact.",
        "The script was originally devised with Katarina in mind before it was decided to kill her off. Her role was given to Dodo.",
        "This was the only contribution to the series of both writer Paul Erickson and director Michael Imison.",
        "Michael Imison viewed directing the serial was punishment from the Head of Serials, Gerald Savory, as he and Savory's wife, actress Annette Carell, had come into conflict during the making of Buddenbrooks a year earlier.",
        "It was reportedly Michael Imison who came up with the idea of creating the Monoids by having costumed actors use their tongues to manipulate a single \"eye\" set into their masks.",
        "Imison's use of playback to indicate that the bridge computers and control consoles on the Ark were fully operational was also unusually sophisticated for the Hartnell era.",
        "Monica the elephant was forced to spend the night before filming in her van outside Michael Imison's home, after the van's driver was refused permission to park at Ealing.",
        "During production, Innes Lloyd took Peter Purves aside and told him that his contract would not be renewed after his extension to twelve more episodes.",
        "The first scene to be recorded was the miniaturisation effect for the male guardian played by extra David Greneau, who was not hired to appear in the next installment as another guardian.",
        "To increase the number of Monoids aboard the Ark, the printed numbers on the voice collars would change between shots. Clever editing was also used so that the same Monoid could appear twice in the same scene, thus swelling their numbers.",
        "To stimulate the effect of the invisible Refusians, wires and other techniques were used in various capacities.",
        "To save money on sets and set dressings, many of the computer banks were taken from stock and Barry Newbery used angled mirrors to increase the number of storage cabinets.",
        "The gates which made up a part of the castle of Refusian II had previously been designed by Barry Newbery for The Crusade.",
        "Just before recording commenced on \"The Bomb\", Michael Imison found out that his contract with the drama series and serial department had not been renewed. He believed that it was due to the serial overrunning."
      ]
    }
  ],
  "worldbuilding": {
    "in_universe_mythology": [
      "The reign of Nero",
      "The Trojan War",
      "Wars involving the Daleks"
    ],
    "real_world_cultural_references": [],
    "individuals": [
      "The Commander",
      "Zentos",
      "Manyak",
      "Mellium",
      "Monoid One",
      "Monoid Two",
      "Monoid Three",
      "Monoid Four",
      "Rhos",
      "Maharis",
      "Dassuk",
      "Venussa",
      "Yendom",
      "The Refusian"
    ],
    "items": [
      "Gregarian rock statue",
      "Minifier",
      "Launcher 14"
    ],
    "locations": [
      "The Ark",
      "Refusis II"
    ]
  },
  "ratings": {
    "ratings_millions": [
      {
        "part": "The Steel Sky",
        "viewers": 5.5
      },
      {
        "part": "The Plague",
        "viewers": 6.9
      },
      {
        "part": "The Return",
        "viewers": 6.2
      },
      {
        "part": "The Bomb",
        "viewers": 7.3
      }
    ]
  },
  "continuity": {
    "continuity_notes": [
      "In TV: The Ark in Space, the Earth was also evacuated because of solar flare activity that rendered the biosphere uninhabitable for five thousand years. There, however, the survivors of mankind slept in suspended animation and returned to repopulate the planet after that period had passed.",
      "When questioned by the humans as to things he has seen on his travels, the Doctor seemingly mentions events from TV: The Romans and The Myth Makers and mentions the Daleks.",
      "The Earth is seen trailing smoke as it heads towards the Sun at the close of \"The Plague\". However, the National Trust, over the billions of years that followed, preserved it and restored it into a \"classic Earth\" before it was finally destroyed by the expanding sun (TV: The End of the World).",
      "The Monoids also feature in the AUDIO: The Kingdom of the Blind.",
      "The Silurians built an ark of their own when they believed that the Earth was about to be destroyed millions of years earlier (TV: Dinosaurs on a Spaceship).",
      "After being conditioned by the artificial intelligence WOTAN on 20 July 1966, Dodo suffered a nervous breakdown. She left the TARDIS soon after. Her claims to have met one-eyed reptile men and other similarly outlandish stories resulted in her being sent to a psychiatric institution (PROSE: Who Killed Kennedy)."
    ]
  },
  "plot": [
    {
      "plot_summary": "The Doctor, Steven and Dodo arrive on a generation starship called the Ark, which is carrying the last of humanity away from an Earth that is about to fall into the Sun. However, Dodo's common cold could prove devastating to the future humans and their alien servants, the Monoids. The Monoids eventually seize control of the Ark and plan to abandon the humans on Refusis II, but the Doctor and his companions work to stop them and liberate the humans."
    }
  ]
}