{
  "metadata": {
    "title": "The Edge of Destruction",
    "series": "Doctor Who",
    "season": "1",
    "episode_number": 3,
    "release_date": "8 February - 15 February 1964",
    "writer": "David Whitaker",
    "director": "Richard Martin, Frank Cox",
    "producer": "Verity Lambert",
    "main_actors": [
      "William Hartnell",
      "William Russell",
      "Jacqueline Hill",
      "Carole Ann Ford"
    ],
    "time_reference": "The TARDIS"
  },
  "cast_crew": [
    {
      "cast": {
        "name": "William Hartnell",
        "role": "Dr. Who"
      },
      "crew": {
        "name": "David Whitaker",
        "role": "Writer"
      }
    },
    {
      "cast": {
        "name": "William Russell",
        "role": "Ian Chesterton"
      },
      "crew": {
        "name": "Richard Martin",
        "role": "Director"
      }
    },
    {
      "cast": {
        "name": "Jacqueline Hill",
        "role": "Barbara Wright"
      },
      "crew": {
        "name": "Frank Cox",
        "role": "Director"
      }
    },
    {
      "cast": {
        "name": "Carole Ann Ford",
        "role": "Susan Foreman"
      },
      "crew": {
        "name": "Verity Lambert",
        "role": "Producer"
      }
    }
  ],
  "home_media": [
    {
      "releases": {
        "media_type": "DVD",
        "date": "30 January 2006",
        "special_features": [
          "Doctor Who: Origins - A 55-minute documentary",
          "Over the Edge - The cast and crew look back at the production",
          "Inside the Spaceship - A look at the Doctor's time and space ship, the TARDIS",
          "Masters of Sound - A look inside the BBC Radiophonic Workshop",
          "Marco Polo - A 30-minute version of the 'lost' fourth Doctor Who story",
          "PDF Documents - A selection of Radio Times billings and the full script of An Unearthly Child",
          "Arabic Soundtrack - Listen to the final episode dubbed into Arabic",
          "Photo Gallery",
          "Production Subtitles"
        ]
      }
    },
    {
      "releases": {
        "media_type": "VHS",
        "date": "May 2000",
        "special_features": [
          "The full takes of 'The Pilot Episode'",
          "The documentary 'The Missing Years'",
          "Episode 3 of 'The Underwater Menace'"
        ]
      }
    }
  ],
  "story_notes": [
    {
      "notes": [
        "This is the first story — and only full-length story — featuring only the Doctor and his companions.",
        "This is the first (and arguably only) televised Doctor Who story in which, essentially, all action takes place inside the TARDIS.",
        "This story was written to make up the allotted number of episodes and meet the show's commitment to the BBC.",
        "This story marks the first time the Doctor indicates on-screen that his TARDIS might be sentient.",
        "This is the first story to not feature a main antagonist of any kind.",
        "This remains the cheapest Doctor Who story ever made, coming in at £2500.",
        "This is the only serial released on DVD from the show's original run to not have a commentary of any sorts attached."
      ]
    }
  ],
  "worldbuilding": {
    "in_universe_mythology": [
      "Quinnis in the fourth universe"
    ],
    "real_world_cultural_references": [
      "Gilbert and Sullivan"
    ],
    "individuals": [
      "Susan",
      "the Doctor"
    ],
    "items": [
      "a special healing bandage",
      "a pair of scissors"
    ],
    "locations": [
      "the TARDIS"
    ]
  },
  "ratings": {
    "ratings_millions": [
      {
        "part": "The Edge of Destruction",
        "viewers": 10.4
      },
      {
        "part": "The Brink of Disaster",
        "viewers": 9.9
      }
    ]
  },
  "continuity": {
    "continuity_notes": [
      "The travellers reference their first adventure together (TV: An Unearthly Child)",
      "The Daleks and Skaro are mentioned (TV: The Daleks)"
    ]
  },
  "plot": [
    {
      "plot_summary": "The Doctor, while attempting to correct the TARDIS's faulty navigation circuits, causes a small explosion. The Doctor, Barbara, Ian and Susan are all rendered unconscious. Barbara is the first to recover shortly followed by Susan, who has trouble remembering who Barbara is, where she is, and is suffering from a pain in the back of her neck. Susan suddenly realises the Doctor lying on the floor with a gash on his head and rushes to his side followed by Barbara. As the Doctor regains consciousness, Barbara tends to him while Ian carries Susan to her room. There she tries to stab him with a pair of scissors, not knowing who he is, but suddenly stabs the scissors on the bed multiple times before collapsing. Later, the Doctor, Barbara, and Ian discuss the situation, each alternating between clarity of mind and paranoid sniping. The Doctor checks the system controls with Ian's assistance, while Barbara checks on Susan. Susan becomes very suspicious of Barbara and threatens her with the pair of scissors, but Barbara is able to stop her from doing any real harm. Susan reveals that she thinks something is hiding inside the ship or inside one of them. When the Doctor tries to determine their location with the view scanner, he finds only images which he recognises as records of the TARDIS's earlier trips. The last image, a picture of planets, a solar system and an explosion, puzzles him. The travellers all check their watches and see the same has happened to their timepieces. Barbara, disturbed, takes off her watch and throws it away from her, before breaking down into tears. The Doctor leaves from the room during the commotion - but returns with a tray of drinks, a \"nightcap\" which he serves as a peace offering to his companions. After looking in on his companions to confirm they are asleep, the Doctor returns to the console. As he examines it, a pair of hands swing him around and grab him by the throat..."
    },
    {
      "plot_summary": "The Doctor's attacker is revealed to be Ian. A strange force has compelled him to stop the Doctor from operating the TARDIS controls, but Ian recognises the Doctor and then collapses. Barbara enters the console room, only to have her and Ian accused of sabotage and conspiracy by the Doctor. As Barbara tries to reason with the Doctor, Susan enters the room and seemingly sides with her grandfather, but then believes her teachers' innocence after the Doctor threatens to throw the humans off his ship. Suddenly an alarm sounds and the Doctor rushes to the fault locator which lights up, showing faults in every system. The Doctor admits that he has misjudged the pair of teachers and tells them they have to work together to get out of the danger they are in. The ship rocks, throwing everyone off balance. The Doctor realises the TARDIS's power source, located beneath the console, is trying to force its way out and they are only minutes from destruction. The Doctor and Ian discover the broken switch. Barbara deduces that the strange events are an attempt by the TARDIS itself to warn the crew that something is wrong. The Doctor traces the fault of the ship to a broken spring in the fast return switch which had been stuck down sending them further back in time than intended. The strange events the four have been experiencing were the TARDIS's attempts to warn its passengers before the ship was destroyed. Fixing the fast return switch returns everything to normal. The Doctor humbly apologises to Ian, who accepts straight away - but Barbara needs more convincing and leaves the room. The Doctor and Ian banter before the TARDIS dematerialises and the Doctor goes to apologise to Barbara, who accepts his plea. Now on amicable terms with each other, the four prepare to explore their new surroundings, this time a snowy plane. When Barbara and Susan go outside, they discover a giant footprint in the snow..."
    }
  ]
}