{
  "metadata": {
    "title": "The Myth Makers",
    "series": "Doctor Who",
    "season": "3",
    "episode_number": 20,
    "release_date": "16 October - 6 November 1965",
    "writer": "Donald Cotton",
    "director": "Michael Leeston-Smith",
    "producer": "John Wiles",
    "main_actors": [
      "William Hartnell",
      "Maureen O'Brien",
      "Peter Purves",
      "Adrienne Hill"
    ],
    "time_reference": "Circa 1200 BC"
  },
  "cast_crew": [
    {
      "cast": {
        "name": "William Hartnell",
        "role": "Dr. Who"
      },
      "crew": {
        "name": "Donald Cotton",
        "role": "Writer"
      }
    },
    {
      "cast": {
        "name": "Maureen O'Brien",
        "role": "Vicki Pallister / Cressida"
      },
      "crew": {
        "name": "Michael Leeston-Smith",
        "role": "Director"
      }
    },
    {
      "cast": {
        "name": "Peter Purves",
        "role": "Steven Taylor"
      },
      "crew": {
        "name": "John Wiles",
        "role": "Producer"
      }
    }
  ],
  "home_media": [
    {},
    {},
    {}
  ],
  "story_notes": [
    {
      "notes": [
        "Derek Martinus was the first choice to direct, but he was moved over to Galaxy 4 and Mission to the Unknown.",
        "Within the context of the DWU, the creation of Trojan Horse is an ontological paradox.",
        "The working titles for this story were The Trojans, The Trojan Horse, The Trojan War and The Mythmakers.",
        "All four episodes of this story are currently lost, but some material from them exists as 8mm home movie clips, shot by filming a television set during transmission.",
        "William Hartnell was unhappy making this serial for a variety of reasons: His health had begun to deteriorate, with his arteriosclerosis making it more difficult for the actor to remember his lines. He was struck and injured by a camera during the filming of 'Temple of Secrets' and sustained a bruise to the shoulder. He was unhappy by what he saw as the Doctor's diminished role in the scripts. He feared that he was being upstaged by prominent guest stars, including Francis De Wolff and especially Max Adrian. He suffered a bereavement while working on the story: the death of his Aunt Bessie, who had looked after him during his troubled childhood.",
        "Only eleven short clips from 'Temple of Secrets', 'Small Prophet, Quick Return' and 'Horse of Destruction' are known to exist. They are from a reel of 8mm film shot off a TV screen."
      ]
    }
  ],
  "worldbuilding": {
    "in_universe_mythology": [
      "Hector boasts about slaying Patroclus.",
      "Trojans worship horses, one of their gods being the Great Horse of Asia, which they think the Trojan Horse is."
    ],
    "real_world_cultural_references": [
      "Homer's Iliad and The Odyssey",
      "Virgil's Aeneid",
      "Chaucer's Troilus and Criseyde",
      "Shakespeare's Troilus and Cressida",
      "The plays of Euripides",
      "A Funny Thing Happened on the Way to the Forum"
    ],
    "individuals": [
      "Achilles",
      "Hector",
      "Odysseus",
      "Agamemnon",
      "Menelaus",
      "Priam",
      "Paris",
      "Cassandra",
      "Troilus",
      "Aeneas"
    ],
    "items": [
      "The Trojan Horse"
    ],
    "locations": [
      "Troy",
      "Asia Minor"
    ]
  },
  "ratings": {
    "ratings_millions": [
      {
        "part": "Temple of Secrets",
        "viewers": 8.3
      },
      {
        "part": "Small Prophet, Quick Return",
        "viewers": 8.1
      },
      {
        "part": "Death of a Spy",
        "viewers": 8.7
      },
      {
        "part": "Horse of Destruction",
        "viewers": 8.3
      }
    ]
  },
  "continuity": {
    "continuity_notes": [
      "The Eighth Doctor and Charlotte Pollard meet Vicki later, though as she was unfamiliar with regeneration, she assumed he was a younger version of the First Doctor.",
      "Vicki still has her twisted ankle, which happened immediately before this adventure.",
      "The Doctor was previously aware that Vicki would eventually become Cressida in circa 1200 BC.",
      "In 1873, Heinrich Schliemann discovered the Jewels of Helen while excavating Troy.",
      "Cassandra was later resurrected in the City of the Saved as a young woman.",
      "The Doctor plans to find help for Steven."
    ]
  },
  "plot": [
    {
      "plot_summary": "When the TARDIS arrives on the plains of Asia Minor not far from the besieged city of Troy, the Doctor is hailed by Achilles as the mighty god Zeus and taken to the Greek camp. He meets Agamemnon and Odysseus. Forced to admit he is a mere mortal — albeit a traveller in space and time — he is given two days to devise a scheme to capture Troy. Steven and Vicki, meanwhile, have been taken prisoner by the Trojans. Vicki, believed to possess supernatural powers, is given two days to banish the Greeks to prove she is not a spy."
    },
    {
      "plot_summary": "The next morning, the Doctor and Steven go to the plains with the Greeks to find out what happened. The TARDIS has indeed disappeared, but tracks lead off in the direction of Troy. Odysseus claims that this is the final proof that the men are spies. Menelaus calls upon the Doctor to sacrifice Steven as he had planned; the Doctor's protestations that he can only do it in his temple fall on deaf ears. Out of options, the Doctor finally confesses that he is not Zeus and that Steven and he are friends. In the city of Troy, a crowd is gathering around the TARDIS which has been brought into the city centre by Paris. Priam asks his son why he is bringing back trinkets rather than seeking vengeance upon the man who killed his brother Hector. Inside the TARDIS, Vicki is watching this scene unfold and is terrified to hear that her life is in imminent danger."
    },
    {
      "plot_summary": "Back at the Greek camp, the Doctor presents Odysseus with some demands of his own: he will only help Odysseus if he can ensure that Vicki is safely carried away from Troy when the Greeks attack. Odysseus says that he cannot guarantee such protection due to the chaos of war. Steven suggests that he make the attempt to save Vicki himself. He proposes to disguise himself as a Greek soldier and allow himself to be seized as a prisoner of war by the Trojans. They will take him into Troy and, once inside, he will find a way to liberate Vicki. In the palace at Troy, Vicki and Priam are enjoying a luxurious meal. Vicki inquires as to how he gets such succulent food; Priam responds that his cavalry often finds ways of bypassing the Greek siege. Paris brings Steven, who is disguised as the Greek soldier Diomedes, into the palace as his prisoner. Both Steven and Vicki are so surprised to see each other that they say each other's names. Cassandra takes the fact that Steven is dressed in the guise of a Greek soldier as proof that Vicki is a spy for the Greeks. She calls in the guards and commands them to kill Vicki and Steven instantly."
    },
    {
      "plot_summary": "Paris intervenes to save Steven and Vicki, stating that Steven is Diomedes and should be kept as a prisoner of war. Cassandra continues arguing with Paris. However, Priam is impressed by Paris' sudden show of strength. He sides with his son on the proviso that Vicki prove herself to be either a time traveller, as she claims, or a goddess, as some believe her to be, by changing the course of the war either through gained knowledge or through divine intervention. Vicki is given one day to prove herself or face death. At the Greek camp, Odysseus is putting pressure on the Doctor to formulate a plan to infiltrate Troy. Desperate, the Doctor proposes his theory of flying machines, modelling his idea on a paper aeroplane that could be jettisoned with the help of a catapult. Odysseus is intrigued by this idea and informs the Doctor that he will be first to try this machine out. As a result, the Doctor is considerably less keen on constructing his invention. The following morning, Vicki is awakened by a jubilant Troilus. He explains that the war has come to an end and that the Greeks have sailed for home. Priam is hailing this as divine intervention on Vicki's behalf and has declared that her imprisonment is at an end. While Vicki is freed, Steven is left to languish."
    },
    {
      "plot_summary": "Not everyone believes that Vicki is the bringer of peace, however. On being received in the palace, Vicki is met by further hostility and scepticism by Cassandra. Cassandra warns Priam about Vicki, but he pays her no heed. Instead, he continues to celebrate, becoming even more joyful when Paris returns from the plains with good news: he believes that he has found the mythical Horse of Asia in the plains and he has had it brought into Troy. Everyone goes to the window to see the sight of the horse just outside Priam's palace. Cassandra continues to rant and rave, saying that the horse is a sign of oncoming doom. Priam and Paris vehemently disagree, and the three begin arguing. Vicki slips away whilst they are distracted. Once they realise that she is gone, they assume she has gone down into the square to see the horse close up. Priam sends Paris out to get her. Cassandra lacks confidence in her brother's ability and sends a handmaiden by the name of Katarina to seek her out. Unbeknownst to any of the Trojans, Vicki slips down to the dungeon and releases Steven. Night falls and the Greeks in the horse climb out. The rest of the Greek army masses outside of Troy's walls, waiting for the infiltrators to let them in. As morning dawns, Troilus is searching for Diomedes, oblivious to his city's impending destruction. He comes across Achilles and challenges him to a fight. Achilles reluctantly engages in combat with him, and is slain. Meanwhile, the Greeks are in the midst of sacking Troy. Cassandra reminds Priam and Paris that this is the fate she had prophesied. They are soon caught by Odysseus, who slays Priam and Paris and drags Cassandra away as a prisoner of war. The Doctor slips away during the melee. Amidst the chaos, Vicki has convinced Katarina to take her side. She tells her to uncover Steven from his hiding place inside one of the temples. Steven is discovered in his hiding place by a Trojan warrior. The two men fight and Steven is victorious in defeating the Trojan. However, he is wounded badly. Katarina finds him and brings him back to the palace. Once reunited with the Doctor, they go into the TARDIS, but Vicki does not join them. Out on the plains, Troilus is looking upon the destruction of his native city. He wonders if Cressida has betrayed them and caused his city's doom. Whilst engaging in his dark speculations, he sees Vicki coming to join him. She perfunctorily explains that Diomedes is safe and that her friends have left her to go back to where they came from. However, she has elected to stay with Troilus. Troilus is initially disconsolate at the loss of his city, but the two soon declare their love. Moments later, Troilus' cousin Aeneas arrives with reinforcements, and Vicki says that this is how it is meant to be: they can build 'another Troy' together. Aboard the TARDIS, Steven is hallucinating and is very unwell. He is worried about Vicki. The Doctor explains that she asked to stay with Troilus in Greece. Steven loses consciousness. Katarina, however, believes that the Doctor is Zeus, the TARDIS is a state of limbo, and that they are all already dead. The Doctor assures her that this is not the case. His attention turns to Steven. The Doctor knows they need the right medication to save Steven and hopes their next landing will provide it."
    }
  ]
}