{
  "metadata": {
    "title": "The Web Planet",
    "series": "Doctor Who",
    "season": "2",
    "episode_number": 13,
    "release_date": "13 February - 20 March 1965",
    "writer": "Bill Strutton",
    "director": "Richard Martin",
    "producer": "Verity Lambert",
    "main_actors": [
      "William Hartnell",
      "William Russell",
      "Jacqueline Hill",
      "Maureen O'Brien"
    ],
    "time_reference": "During the Zarbi invasion of Vortis"
  },
  "cast_crew": [
    {
      "cast": {
        "name": "William Hartnell",
        "role": "Dr. Who"
      },
      "crew": {
        "name": "Bill Strutton",
        "role": "Writer"
      }
    },
    {
      "cast": {
        "name": "William Russell",
        "role": "Ian Chesterton"
      },
      "crew": {
        "name": "Richard Martin",
        "role": "Director"
      }
    },
    {
      "cast": {
        "name": "Jacqueline Hill",
        "role": "Barbara Wright"
      },
      "crew": {
        "name": "Verity Lambert",
        "role": "Producer"
      }
    },
    {
      "cast": {
        "name": "Maureen O'Brien",
        "role": "Vicki"
      },
      "crew": {
        "name": "Robert Jewell",
        "role": "Zarbi Operator"
      }
    },
    {
      "cast": {
        "name": "Roslyn De Winter",
        "role": "Vrestin"
      },
      "crew": {
        "name": "Kevin Manser",
        "role": "Zarbi Operator"
      }
    },
    {
      "cast": {
        "name": "Arne Gordon",
        "role": "Hrostar"
      },
      "crew": {
        "name": "Catherine Fleming",
        "role": "Animus Voice"
      }
    },
    {
      "cast": {
        "name": "Arthur Blake",
        "role": "Hrhoonda"
      },
      "crew": {
        "name": "John Scott Martin",
        "role": "Zarbi Operator"
      }
    }
  ],
  "home_media": [
    {
      "releases": {
        "media_type": "VHS",
        "date": "September 1990",
        "special_features": []
      }
    },
    {
      "releases": {
        "media_type": "DVD",
        "date": "3 October 2005",
        "special_features": [
          "Audio Commentary",
          "Tales of Isop",
          "The Lair of Zarbi Supremo",
          "Doctor Who Annual",
          "Spanish Soundtrack",
          "Give-a-Show Slides",
          "Production Subtitles"
        ]
      }
    },
    {
      "releases": {
        "media_type": "BLU_RAY",
        "date": "5 December 2022",
        "details": "As part of The Collection: Season Two",
        "special_features": []
      }
    }
  ],
  "story_notes": [
    {
      "notes": [
        "The story was originally titled The Zarbi and was made under the working title The Centre of Terror.",
        "Another working title is known to be The Webbed Planet.",
        "\"The Centre\" was initially titled \"Centre of Terror\". The novelisation restores this title for the sixth chapter.",
        "Robert Jewell, Jack Pitt, Gerald Taylor, Hugh Lund, and Kevin Manser are credited as \"Zarbi Operators\" for \"The Web Planet\" and \"The Zarbi\", and under the heading \"The Zarbi\" for \"Escape to Danger\" to \"The Centre\".",
        "Roslyn De Winter was hired to create the distinctive movements and stilted speech of the Menoptera. She was so successful that the production team asked her to take on the role of the Menoptera Vrestin.",
        "Despite not appearing and being uncredited on-screen for \"Escape to Danger\", Jacqueline Hill was still credited in Radio Times.",
        "Originally, the Zarbi had the ability to spit venom, but Dennis Spooner instead created smaller, grub-like creatures to fulfil this function.",
        "The music soundtrack, although from stock, is a highly unusual one, created by a group called Les Structures Sonorés who produced music on glass tubes.",
        "In Bill Strutton's novelisation, the events of the story take place in the year 20,000. This was not derived from any information given in the televised version.",
        "To date, this is the only Doctor Who serial not to feature any humanoid characters in its supporting cast."
      ]
    }
  ],
  "worldbuilding": {
    "in_universe_mythology": [
      "The Animus",
      "The Menoptera",
      "The Zarbi",
      "The Optera"
    ],
    "real_world_cultural_references": [
      "Nelson's Column"
    ],
    "individuals": [
      "The Doctor",
      "Ian Chesterton",
      "Barbara Wright",
      "Vicki",
      "Vrestin",
      "Hrostar",
      "Hrhoonda",
      "Prapillus",
      "Hlynia",
      "Hilio",
      "Hetra",
      "Nemini"
    ],
    "items": [
      "Coal Hill School Tie",
      "Gold Harness",
      "Isoptope",
      "Astral Map"
    ],
    "locations": [
      "Vortis",
      "Pictos",
      "Crater of Needles",
      "Carsinome",
      "Temple of Light"
    ]
  },
  "ratings": {
    "ratings_millions": [
      {
        "part": "The Web Planet",
        "viewers": 13.5
      },
      {
        "part": "The Zarbi",
        "viewers": 12.5
      },
      {
        "part": "Escape to Danger",
        "viewers": 12.5
      },
      {
        "part": "Crater of Needles",
        "viewers": 13.0
      },
      {
        "part": "Invasion",
        "viewers": 12.0
      },
      {
        "part": "The Centre",
        "viewers": 11.5
      }
    ]
  },
  "continuity": {
    "continuity_notes": [
      "This is the Doctor's third known visit to Vortis. He had previously visited in The Lost Ones and The Lair of Zarbi Supremo, and would go there for a fourth time in On the Web Planet.",
      "The Second Doctor returns to Vortis in Twilight of the Gods.",
      "The Fourth Doctor returns to Vortis in The Naked Flame.",
      "The Fifth Doctor returns to Vortis in Return to the Web Planet.",
      "During this adventure with the Zarbi, Ian and Barbara, the Doctor is plucked out of Time for the second time by the Father of Time.",
      "Barbara is wearing the bracelet she was given by Nero.",
      "The Zarbi and the Animus would later appear in London in the year 1868, having been brought there by Adam Mitchell."
    ]
  },
  "plot": [
    {
      "plot_summary": "The TARDIS is forced to land on the planet Vortis, where the Doctor, Ian, Barbara and Vicki get caught up in the struggles between the butterfly-like Menoptera and the ant-like Zarbi, who are under the control of a powerful creature called the Animus. The Menoptera were driven from their home planet to a nearby moon, and they are now trying to reclaim Vortis. The Doctor and his companions get separated, and Barbara is enslaved by the Zarbi. Meanwhile, Ian teams up with a Menoptera named Vrestin to try and reach the Crater of Needles, where the enslaved Menoptera are forced to work. The Doctor and Vicki try to sabotage the Zarbi's operations from within their lair, the Carsinome, while Barbara and the other free Menoptera attempt to stop the Animus itself at the centre of the Carsinome. In the end, the Animus is destroyed, freeing the Zarbi from its control and allowing the Menoptera to reclaim their home planet."
    }
  ]
}