{
  "metadata": {
    "title": "The Keys of Marinus",
    "series": "Doctor Who",
    "season": "1",
    "episode_number": 5,
    "release_date": "11 April - 16 May 1964",
    "writer": "Terry Nation",
    "director": "John Gorrie",
    "producer": "Verity Lambert",
    "main_actors": [
      "William Hartnell",
      "William Russell",
      "Jacqueline Hill",
      "Carole Ann Ford"
    ],
    "time_reference": "Around 5000000 BC"
  },
  "cast_crew": [
    {
      "cast": {
        "name": "William Hartnell",
        "role": "Dr. Who"
      },
      "crew": {
        "name": "Terry Nation",
        "role": "Writer"
      }
    },
    {
      "cast": {
        "name": "William Russell",
        "role": "Ian Chesterton"
      },
      "crew": {
        "name": "John Gorrie",
        "role": "Director"
      }
    },
    {
      "cast": {
        "name": "Jacqueline Hill",
        "role": "Barbara Wright"
      },
      "crew": {
        "name": "Verity Lambert",
        "role": "Producer"
      }
    },
    {
      "cast": {
        "name": "Carole Ann Ford",
        "role": "Susan Foreman"
      },
      "crew": {
        "name": "Norman Kay",
        "role": "Incidental Music"
      }
    }
  ],
  "home_media": [
    {
      "releases": {
        "media_type": "DVD",
        "date": "21 September 2009",
        "special_features": [
          "Commentary by William Russell, Carole Ann Ford, John Gorrie and Raymond Cusick",
          "The Sets of Marinus",
          "Cadet Sweets: 'Doctor Who and the Daleks'",
          "Radio Times Billings",
          "Production Information Subtitles",
          "Photo Gallery",
          "Coming Soon Trailer",
          "8mm behind the scenes footage"
        ]
      }
    },
    {
      "releases": {
        "media_type": "VHS",
        "date": "March 1999",
        "special_features": []
      }
    }
  ],
  "story_notes": [
    {
      "notes": [
        "The working title of this story was Planet Marinus.",
        "Terry Nation wrote this story as a replacement to The Red Fort, a story that was to be set during the Indian Mutiny.",
        "This is the first story to be written by a returning writer.",
        "William Hartnell does not appear in the third and fourth episodes, as he was on holiday during the weeks they were recorded.",
        "The Voords were alien invaders who took advantage of the people of Marinus, rendered vulnerable by the pacifying effects of the Conscience.",
        "Initially, it was hoped that the Voords would catch on with young viewers in the same way the Daleks had inspired Dalekmania, with toys, books and other merchandise. This did not come to pass.",
        "Terry Nation used many existing words for location and character names in the story: Marinus, Morphoton, Millennius, and Arbitan."
      ]
    }
  ],
  "worldbuilding": {
    "in_universe_mythology": [
      "The Conscience of Marinus",
      "The Voord"
    ],
    "real_world_cultural_references": [
      "Pyrrho, the founder of scepticism",
      "Truffles",
      "Pomegranate",
      "Grapes"
    ],
    "individuals": [
      "Arbitan",
      "Yartek"
    ],
    "items": [
      "The Keys of Marinus",
      "Travel dials"
    ],
    "locations": [
      "Marinus",
      "Morphoton",
      "Millennius",
      "The Screaming Jungle",
      "The Snows of Terror"
    ]
  },
  "ratings": {
    "ratings_millions": [
      {
        "part": "The Sea of Death",
        "viewers": 9.9
      },
      {
        "part": "The Velvet Web",
        "viewers": 9.4
      },
      {
        "part": "The Screaming Jungle",
        "viewers": 9.9
      },
      {
        "part": "The Snows of Terror",
        "viewers": 10.4
      },
      {
        "part": "Sentence of Death",
        "viewers": 7.9
      },
      {
        "part": "The Keys of Marinus",
        "viewers": 6.9
      }
    ]
  },
  "continuity": {
    "continuity_notes": [
      "Ian is still wearing the costume given to him by Marco Polo in Cathay in 1289.",
      "The Doctor, Ian, Barbara and Susan encountered the Voord on Hydra more than a century later.",
      "The Doctor also encountered the Voord on Kandalinga several million years later."
    ]
  },
  "plot": [
    {
      "plot_summary": "The TARDIS arrives on the planet Marinus on an island of glass surrounded by a sea of acid. The travellers are forced by the elderly Arbitan to retrieve four of the five operating keys to a machine called the Conscience of Marinus - a machine capable of influencing all minds on the planet - of which he is the keeper. These have been hidden in different locations around the planet to prevent them falling into the hands of the evil Yartek and his Voord warriors, who plan to seize the machine and use its originally benevolent mind-influencing power for their own sinister purposes."
    },
    {
      "plot_summary": "The Doctor and his companions, Barbara, Ian and Susan, land on an island and find the beach is made of glass and the sea of acid. Arbitan explains that he has separated the five keys that regulate the Conscience of Marinus to prevent the Voord from accessing it. He forces the travellers to retrieve the keys for him, cutting them off from the TARDIS. The travellers are teleported to different locations around Marinus to find the keys, encountering a variety of challenges and adversaries, including the Brains of Morphoton, the Ice Soldiers, and the Voord."
    },
    {
      "plot_summary": "Ian and Barbara retrieve four of the keys, but the final key is in the possession of the Voord leader Yartek. Altos and Sabetha, two of Arbitan's friends who had previously searched for the keys, have been captured by Yartek. The Doctor and his companions realize that Arbitan has been killed and Yartek now controls the Conscience. They manage to retrieve the final key and insert a false one, causing the Conscience to explode and kill Yartek and the Voord. The travellers then depart Marinus, leaving Altos and Sabetha to start a new life together."
    }
  ]
}