{
  "metadata": {
    "title": "The Time Meddler",
    "series": "Doctor Who",
    "season": "2",
    "episode_number": 9,
    "release_date": "3 - 24 July 1965",
    "writer": "Dennis Spooner",
    "director": "Douglas Camfield",
    "producer": "Verity Lambert",
    "main_actors": [
      "William Hartnell",
      "Maureen O'Brien",
      "Peter Purves"
    ],
    "time_reference": "1066"
  },
  "cast_crew": [
    {
      "cast": {
        "name": "William Hartnell",
        "role": "Dr. Who"
      },
      "crew": {
        "name": "Dennis Spooner",
        "role": "Writer"
      }
    },
    {
      "cast": {
        "name": "Maureen O'Brien",
        "role": "Vicki"
      },
      "crew": {
        "name": "Douglas Camfield",
        "role": "Director"
      }
    },
    {
      "cast": {
        "name": "Peter Purves",
        "role": "Steven"
      },
      "crew": {
        "name": "Verity Lambert",
        "role": "Producer"
      }
    }
  ],
  "home_media": [
    {
      "releases": {
        "media_type": "DVD",
        "date": "4 February 2008",
        "special_features": [
          "Commentary by Verity Lambert (producer), Peter Purves (Steven Taylor), Donald Tosh (Story Editor) and Barry Newbury (Designer), moderated by Clayton Hickman",
          "Verity Lambert Obituary - A concise essay looking back at the career of one of Doctor Who's co-creators",
          "The Lost Twelve Seconds - A small part of episode four is still missing, and this short item uses an off-air audio recording and an original script to place the missing 12 seconds in context",
          "Restoration - A featurette showing the techniques used in the restoration of this story",
          "Stripped for Action - The First Doctor - A look back at the First Doctor's colourful comic strip adventures",
          "Verity Lambert Gallery - A collection of photographs of the trailblazing producer",
          "Radio Times Billings - Original listings from Radio Times in PDF format (DVD-ROM PC/Mac)",
          "Photo Gallery",
          "Coming Soon Trailer - The Five Doctors: 25th Anniversary Edition"
        ]
      }
    },
    {},
    {
      "releases": {
        "media_type": "VHS",
        "date": "June 2000",
        "special_features": []
      }
    }
  ],
  "story_notes": [
    {
      "notes": [
        "This is the first story in which the acronym TARDIS is said to stand for \"Time and Relative Dimensions in Space\", slightly different than the singular \"Dimension\" as was said in An Unearthly Child.",
        "All episodes exist as 16mm black & white film telerecordings, though \"Checkmate\" is still missing a 12-second sequence showing the Vikings Ulf and Sven being stabbed to death by Wulnoth and the Saxons; no complete copy of the episode is known to exist.",
        "Peter Purves is credited as \"Steven Taylor\" for \"The Watcher\", and as \"Steven\" for \"The Meddling Monk\" to \"Checkmate\".",
        "William Hartnell was on holiday for the week \"The Meddling Monk\" was recorded, and so the Doctor's appearance is limited to the reprise and heard only as a pre-recorded voice-over.",
        "No \"Next Episode\" caption is present on \"Checkmate\", making it the first episode not to do so."
      ]
    }
  ],
  "worldbuilding": {
    "in_universe_mythology": [
      "The Monk claims to have helped the building of Stonehenge with an antigravitional lift."
    ],
    "real_world_cultural_references": [
      "The historical setting had a particular relevance in 1965 as the 900th anniversary of the Battle of Hastings was only a year away."
    ],
    "individuals": [
      "William the Conqueror",
      "Harald Godwinson"
    ],
    "items": [
      "An atomic cannon",
      "Bazookas",
      "A gramophone",
      "A tape recorder",
      "A toaster",
      "An electric griddle"
    ],
    "locations": [
      "Northumbria",
      "A Saxon village",
      "A monastery"
    ]
  },
  "ratings": {
    "ratings_millions": [
      {
        "part": "The Watcher",
        "viewers": 8.9
      },
      {
        "part": "The Meddling Monk",
        "viewers": 8.8
      },
      {
        "part": "A Battle of Wits",
        "viewers": 7.7
      },
      {
        "part": "Checkmate",
        "viewers": 8.3
      }
    ]
  },
  "continuity": {
    "continuity_notes": [
      "The Doctor and Vicki discuss the departure of Ian and Barbara (TV: The Chase) and the Doctor mentions his granddaughter Susan. (TV: The Dalek Invasion of Earth)",
      "The Doctor's handwriting is completely different from that in TV: The Sensorites.",
      "Following his encounter with the Monk, the Doctor installed a device in the TARDIS which was designed to detect further attempts to alter history. (PROSE: The Schoolboy's Story)",
      "Seven lifetimes later, the Eighth Doctor once more encountered the Monk, once more disguised as a monk, in Kell's Abbey. (AUDIO: The Book of Kells)"
    ]
  },
  "plot": [
    {
      "plot_summary": "The Doctor, Vicki, and new companion Steven Taylor arrive in Saxon Northumbria on the eve of the Viking and Norman invasions. It is 1066, a pivotal moment in British history. The hand of a mysterious Monk is at work in the nearby monastery, intending that history takes a different course."
    },
    {
      "plot_summary": "Vicki is moping around the TARDIS, missing Ian and Barbara. The Doctor offers to take her back home, but she admits she has nothing to go back to. The TARDIS then materialises on a rocky shoreline, where the Monk is watching from a cliff. The Doctor, Vicki, and Steven explore the area, finding evidence they are in 1066. Steven remains skeptical about the TARDIS being a time machine. The Monk sneaks into the monastery and begins interfering with history, planning to ensure the Normans are defeated."
    },
    {
      "plot_summary": "The Monk uses his knowledge of modern medicine to nurse the Saxon Eldred back to health. He also learns from Eldred that the full Viking invasion may occur within three days. The Monk seems happy at this news, saying he is on schedule. The Doctor confronts the Monk and demands answers about his plans. The Monk admits he intends to destroy the Viking fleet to allow Harald Godwinson to take the throne, believing this will aid humankind."
    },
    {
      "plot_summary": "Steven and Vicki discover the Monk's TARDIS and his plans to alter history, including collecting a fortune through compound interest and providing humanity with advanced technology. The Doctor defeats the Monk's schemes by disabling the Monk's TARDIS, trapping him in 1066. The Monk is left stranded, realizing his TARDIS is ruined and he can no longer continue his meddling."
    }
  ]
}