{
  "metadata": {
    "title": "The War Machines",
    "series": "Doctor Who",
    "season": "3",
    "episode_number": 10,
    "release_date": "25 June - 16 July 1966",
    "writer": "Ian Stuart Black",
    "director": "Michael Ferguson",
    "producer": "Innes Lloyd",
    "main_actors": [
      "William Hartnell",
      "Jackie Lane",
      "Anneke Wills",
      "Michael Craze"
    ],
    "time_reference": "London, 12 - 20 July 1966"
  },
  "cast_crew": [
    {
      "cast": {
        "name": "William Hartnell",
        "role": "Dr. Who"
      },
      "crew": {
        "name": "Ian Stuart Black",
        "role": "Writer"
      }
    },
    {
      "cast": {
        "name": "Jackie Lane",
        "role": "Dodo Chaplet"
      },
      "crew": {
        "name": "Michael Ferguson",
        "role": "Director"
      }
    },
    {
      "cast": {
        "name": "Anneke Wills",
        "role": "Polly"
      },
      "crew": {
        "name": "Innes Lloyd",
        "role": "Producer"
      }
    }
  ],
  "home_media": [
    {
      "releases": {
        "media_type": "DVD",
        "date": "25 August 2008",
        "special_features": [
          "Commentary by Anneke Wills (Polly) and Michael Ferguson (Director)",
          "Now and Then - A look at the locations used in the making of the story comparing how they appeared in 1966 with how they look today",
          "Blue Peter - A compilation of clips featuring the new Post Office Tower and the War Machines",
          "One Foot in the Past - MP Tony Benn investigates the history of the post office tower",
          "WOTAN Assembly - How these episodes were pieced back together from disparate sources and restored for this DVD",
          "War Machine Design Plan (PDF DVD-ROM)",
          "Radio Times Billings - Listings from Radio Times (PDF)",
          "Production Information",
          "Subtitles",
          "Coming Soon Trailer - Battlefield",
          "Easter Egg: Location film inserts (mute)"
        ]
      }
    }
  ],
  "story_notes": [
    {
      "notes": [
        "The War Machines had the working titles of Doctor Who and the Computers and Doctor Who and the War of the Machines.",
        "Jackie Lane only appears in episodes one and two of the serial and her character departs the Doctor's company off-screen, as her contract expired midway through production.",
        "This story is one of the few First Doctor stories to primarily take place in the modern day.",
        "The idea for this story came about when Kit Pedler was being interviewed for a position as science adviser to the series.",
        "This is the first time that two consecutive stories had the same writer.",
        "This is the first season finale to not be written by Dennis Spooner.",
        "WOTAN is given its own billing, \"...and WOTAN\", on the closing credits of episodes one to three and in Radio Times; although billed in Radio Times for episode four, it is not credited on-screen.",
        "The \"Based on an idea by...\" credit for Kit Pedler appears only on the closing credits and in the Radio Times programme listings for all four episodes, where his surname is misspelled as \"Pedlar\" in both cases.",
        "Many of the characters pronounce WOTAN as \"Votan\", as in the Germanic name for the Norse god Odin.",
        "The Doctor is particularly ruthless in this story, sending a War Machine to destroy WOTAN when he knows that Brett and Krimpton (and most likely Polly too) are with WOTAN and are very likely to get killed (as Krimpton does).",
        "Only one War Machine prop was actually constructed; the production team changed the numbers to represent the different machines.",
        "This is the only time during the First or Second Doctor's era when the TARDIS crew is completely replaced, leaving no continuing character other than the Doctor.",
        "This is the story in which the Doctor is infamously referred to as \"Doctor Who\" by WOTAN.",
        "This is the only time on television that the Doctor is directly called this until the 2017 story World Enough and Time when Missy claims it was the Doctor's first alias."
      ]
    }
  ],
  "worldbuilding": {
    "in_universe_mythology": [
      "WOTAN (Will Operating Thought ANalogue)"
    ],
    "real_world_cultural_references": [
      "Odin"
    ],
    "individuals": [
      "Professor Brett",
      "Sir Charles Summer",
      "Major Green",
      "Professor Krimpton",
      "Dodo Chaplet",
      "Polly",
      "Ben Jackson",
      "Kitty",
      "Flash",
      "The Minister of Defence"
    ],
    "items": [
      "War Machines"
    ],
    "locations": [
      "London",
      "Post Office Tower",
      "Inferno nightclub",
      "Royal Scientific Club",
      "Covent Garden warehouse",
      "Battersea Power Station"
    ]
  },
  "ratings": {
    "ratings_millions": [
      {
        "part": "Episode 1",
        "viewers": 5.4
      },
      {
        "part": "Episode 2",
        "viewers": 4.7
      },
      {
        "part": "Episode 3",
        "viewers": 5.3
      },
      {
        "part": "Episode 4",
        "viewers": 5.5
      }
    ]
  },
  "continuity": {
    "continuity_notes": [
      "The War Machines make a cameo in PROSE: EarthWorld, the Doctor's actions altered history, and UNIT was embarrassed to have missed the events at the Post Office Tower."
    ]
  },
  "plot": [
    {
      "plot_summary": "The TARDIS arrives in London in 1966 and the First Doctor and Dodo visit the Post Office Tower. There they meet Professor Brett, whose revolutionary new computer WOTAN (Will Operating Thought ANalogue) can actually think for itself and is shortly to be linked up to other major computers around the world — a project overseen by civil servant Sir Charles Summer. It transpires, however, that WOTAN considers humans to be inferior and believes they should be ruled by machines. Exerting a hypnotic influence, it arranges the construction of War Machines — heavily-armed, self-contained mobile computers — with which to take over the world. These prove more than a match for troops, but by establishing a magnetic force field the Doctor is able to capture one of them, which he then reprograms to destroy WOTAN. Dodo, now back in her own time, decides to remain on Earth. The Doctor enters the TARDIS alone, but Brett's secretary Polly and her merchant seaman friend Ben Jackson follow him inside just before it dematerialises."
    }
  ]
}