{
  "metadata": {
    "title": "The Savages",
    "series": "Doctor Who",
    "season": "3",
    "episode_number": 9,
    "release_date": "28 May - 18 June 1966",
    "writer": "Ian Stuart Black",
    "director": "Christopher Barry",
    "producer": "Innes Lloyd",
    "main_actors": [
      "William Hartnell",
      "Peter Purves",
      "Jackie Lane"
    ],
    "time_reference": "far future"
  },
  "cast_crew": [
    {
      "cast": {
        "name": "William Hartnell",
        "role": "Dr. Who"
      },
      "crew": {
        "name": "Ian Stuart Black",
        "role": "Writer"
      }
    },
    {
      "cast": {
        "name": "Peter Purves",
        "role": "Steven Taylor"
      },
      "crew": {
        "name": "Christopher Barry",
        "role": "Director"
      }
    },
    {
      "cast": {
        "name": "Jackie Lane",
        "role": "Dodo Chaplet"
      },
      "crew": {
        "name": "Innes Lloyd",
        "role": "Producer"
      }
    }
  ],
  "home_media": [
    {}
  ],
  "story_notes": [
    {
      "notes": [
        "This story had a working title of The White Savages.",
        "No episodes of this four-part story exist in the BBC Archives.",
        "This is the first Doctor Who story to have an overall story title rather than each episode having individual titles.",
        "William Hartnell struggled to remember his lines, so he was effectively given a respite for episode three, where the Doctor had no dialogue.",
        "Hartnell instead worked with Frederick Jaeger to incorporate the Doctor's mannerisms into Jano's personality.",
        "A regular viewer of the show, Ian Stuart Black thought that a Doctor Who credit would impress his children.",
        "For a time, it was thought that this serial might replace The Gunfighters, which neither Innes Lloyd nor Gerry Davis liked.",
        "This is the first incomplete serial since The Crusade to have a full set of tele-snaps and begins a long run of stories with tele-snaps that ultimately ends with The Mind Robber (or, The Wheel in Space if one only includes incomplete serials).",
        "This is because Innes Lloyd was a lot more keen on employing John Cura's services than his predecessor (John Wiles) was and Peter Bryant was much the same as Lloyd after he took over as producer.",
        "The advanced race was originally supposed to be played by actors in blackface as a parable about apartheid era South Africa. This got dropped except for the city's leader Jano.",
        "This is the first Doctor Who story to feature no on-screen deaths of any additional cast members.",
        "Although The Edge of Destruction was the first story to feature no deaths, it also had no additional cast members apart from the Doctor and his companions.",
        "Christopher Barry was impressed with the script, thinking that the series had become stale.",
        "William Hartnell was furious at Peter Purves's departure, as the two had become good friends, while Purves didn't leave by his own accord; his contract was simply not renewed.",
        "Ewen Solon spent three hours in makeup so he could be made up to play one of the Savages.",
        "Unusually, the first eight scenes of episode four were recorded immediately after part three was completed. This ensured that the dry ice used to represent the gas attack on Steven and Dodo would not have to be used a second time.",
        "Although Peter Purves was ready to move on from the series, he pitched an idea for a sequel to this story where the Doctor returns to the planet of the Elders and the Savages, only to discover that Steven's leadership has become thoroughly corrupt.",
        "William Hartnell was upset at Peter Purves' departure, as he had returned from the location shoot for The War Machines, where he'd failed to get on with Michael Craze and Anneke Wills."
      ]
    }
  ],
  "worldbuilding": {
    "in_universe_mythology": [
      "The Doctor uses a portable reacting vibrator for calculations, mistaken for a weapon.",
      "In the TARDIS's emergency cabinet, there are capsules marked D403 able to restore life force in the victims of the Elders."
    ],
    "real_world_cultural_references": [],
    "individuals": [
      "Captain Edal",
      "Exorse",
      "Jano",
      "Senta",
      "Chal",
      "Tor",
      "Avon",
      "Flower",
      "Nanina",
      "Wylda"
    ],
    "items": [
      "light guns"
    ],
    "locations": [
      "Unnamed planet",
      "Valley of Caves",
      "the city"
    ]
  },
  "ratings": {
    "ratings_millions": [
      {
        "part": "1",
        "viewers": 4.8
      },
      {
        "part": "2",
        "viewers": 5.6
      },
      {
        "part": "3",
        "viewers": 5.0
      },
      {
        "part": "4",
        "viewers": 4.5
      }
    ]
  },
  "continuity": {
    "continuity_notes": [
      "The Doctor experiences an energy drain here after already experiencing advanced ageing, (TV: The Daleks' Master Plan) having a remnant of a Vardan clinging to his body while draining his energy, (AUDIO: The Locked Room) and overexertion while fighting the Toymaker, (TV: The Celestial Toymaker) and will soon experience a second life-force depletion before his first regeneration. (TV: The Tenth Planet)",
      "On the planet that he chose as his new home, Steven became king and had three daughters. His youngest, Dodo, was his favourite. He was eventually deposed by his two other daughters. He also had a granddaughter named Sida. (AUDIO: The War To End All Wars)",
      "When Steven is close to a hundred years of age, it is revealed that he is in the same time zone as the Doctor is when he is fighting the Cybermen in December 1986. Considering Steven's apparent age, this would likely place this story sometime in the early 20th century. Although this does contradict the Doctor's initial assessment of the TARDIS landing in the far future, such mistakes are hardly uncommon, especially for the First Doctor.",
      "The Ninth Doctor will also defeat a plot involving life energies being drained from the perceived lower classes to benefit the self-identified upper classes; he also defeats this plot by tricking his enemy into taking on some of his own morality by provoking them into trying to absorb too much of the Doctor's own life force. (AUDIO: Retail Therapy)"
    ]
  },
  "plot": [
    {
      "plot_summary": "The TARDIS has arrived on a far-distant and seemingly idyllic world. Yet the Doctor, Steven and Dodo learn it hides a terrible secret: the apparently civilised Elders maintain their advanced society by draining and transferring to themselves the life-force of the defenceless Savages. Outraged at this exploitation, the Doctor is seemingly helpless to prevent it when some of his own life-force is tapped by the Elders' leader. In the process, however, the leader, Jano, also acquires some of the Doctor's attitudes and conscience. Turning against his own people, he enlists the Savages to destroy the Elders' transference laboratory — a task with which the time travellers gladly assist. Steven agrees to remain behind on the planet to become the leader of the newly united Elders and Savages."
    }
  ]
}